; ModuleID = 'dataset/cases/goeq-oja-0122/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c'
source_filename = "dataset/cases/goeq-oja-0122/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx14.0.0"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr }
%struct.PyModuleDef_Base = type { %struct._object, ptr, i64, ptr }
%struct._object = type { %union.anon, ptr }
%union.anon = type { i64 }
%struct.PyMethodDef = type { ptr, ptr, i32, ptr }
%struct.__pyx_mstatetype = type { ptr, ptr, ptr, ptr, ptr, ptr, [16 x ptr], [2 x ptr], %struct.__Pyx_CodeObjectCache }
%struct.__Pyx_CodeObjectCache = type { i32, i32, ptr }
%struct._typeobject = type { %struct.PyVarObject, ptr, i64, i64, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, ptr, i8, i16 }
%struct.PyVarObject = type { %struct._object, i64 }
%struct.anon.1 = type { i8, [3 x i8] }
%struct.PyStatus = type { i32, ptr, ptr, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__pyx_module_is_main_original", scope: !2, file: !446, line: 1892, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Homebrew clang version 20.1.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !28, globals: !508, splitDebugInlining: false, nameTableKind: Apple, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk", sdk: "MacOSX14.sdk")
!3 = !DIFile(filename: "dataset/cases/goeq-oja-0122/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c", directory: ".")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 695, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/object.h", directory: "")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "PYGEN_RETURN", value: 0)
!10 = !DIEnumerator(name: "PYGEN_ERROR", value: -1)
!11 = !DIEnumerator(name: "PYGEN_NEXT", value: 1)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !14, file: !13, line: 11, baseType: !23, size: 32, elements: !24)
!13 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/initconfig.h", directory: "")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 10, size: 256, elements: !15)
!15 = !{!16, !17, !21, !22}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_type", scope: !14, file: !13, line: 15, baseType: !12, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !14, file: !13, line: 16, baseType: !18, size: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "err_msg", scope: !14, file: !13, line: 17, baseType: !18, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "exitcode", scope: !14, file: !13, line: 18, baseType: !7, size: 32, offset: 192)
!23 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!24 = !{!25, !26, !27}
!25 = !DIEnumerator(name: "_PyStatus_TYPE_OK", value: 0)
!26 = !DIEnumerator(name: "_PyStatus_TYPE_ERROR", value: 1)
!27 = !DIEnumerator(name: "_PyStatus_TYPE_EXIT", value: 2)
!28 = !{!29, !35, !39, !40, !367, !7, !18, !95, !369, !380, !391, !407, !75, !80, !38, !51, !423, !424, !431, !444}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !32, line: 34, baseType: !33)
!32 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_wchar_t.h", directory: "")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wchar_t", file: !34, line: 82, baseType: !7)
!34 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/arm/_types.h", directory: "")
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !36, line: 31, baseType: !37)
!36 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !34, line: 70, baseType: !38)
!38 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !42, line: 18, baseType: !43)
!42 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pytypedefs.h", directory: "")
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !6, line: 110, size: 128, elements: !44)
!44 = !{!45, !63}
!45 = !DIDerivedType(tag: DW_TAG_member, scope: !43, file: !6, line: 122, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !43, file: !6, line: 122, size: 64, elements: !47)
!47 = !{!48, !52}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt_full", scope: !46, file: !6, line: 124, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !50, line: 30, baseType: !51)
!50 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_int64_t.h", directory: "")
!51 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, scope: !46, file: !6, line: 125, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !46, file: !6, line: 125, size: 64, elements: !54)
!54 = !{!55, !58, !62}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !53, file: !6, line: 131, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !57, line: 31, baseType: !23)
!57 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint32_t.h", directory: "")
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ob_overflow", scope: !53, file: !6, line: 132, baseType: !59, size: 16, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !60, line: 31, baseType: !61)
!60 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint16_t.h", directory: "")
!61 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ob_flags", scope: !53, file: !6, line: 133, baseType: !59, size: 16, offset: 48)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !43, file: !6, line: 144, baseType: !64, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !42, line: 20, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !67, line: 148, size: 3328, elements: !68)
!67 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/object.h", directory: "")
!68 = !{!69, !81, !82, !83, !84, !89, !90, !96, !101, !120, !122, !175, !206, !218, !224, !225, !226, !228, !230, !262, !263, !264, !273, !274, !279, !280, !282, !284, !295, !306, !324, !325, !326, !328, !330, !331, !333, !338, !343, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !364, !366}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !66, file: !67, line: 149, baseType: !70, size: 192)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !6, line: 172, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 169, size: 192, elements: !72)
!72 = !{!73, !74}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !71, file: !6, line: 170, baseType: !41, size: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !71, file: !6, line: 171, baseType: !75, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !76, line: 156, baseType: !77)
!76 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pyport.h", directory: "")
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !78, line: 31, baseType: !79)
!78 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_ssize_t.h", directory: "")
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ssize_t", file: !34, line: 97, baseType: !80)
!80 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !66, file: !67, line: 150, baseType: !18, size: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !66, file: !67, line: 151, baseType: !75, size: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !66, file: !67, line: 151, baseType: !75, size: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !66, file: !67, line: 155, baseType: !85, size: 64, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !6, line: 353, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !40}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall_offset", scope: !66, file: !67, line: 156, baseType: !75, size: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !66, file: !67, line: 157, baseType: !91, size: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !6, line: 354, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!40, !40, !95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !66, file: !67, line: 158, baseType: !97, size: 64, offset: 576)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !6, line: 356, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!7, !40, !95, !40}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_async", scope: !66, file: !67, line: 159, baseType: !102, size: 64, offset: 640)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyAsyncMethods", file: !67, line: 135, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 130, size: 256, elements: !105)
!105 = !{!106, !111, !112, !113}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "am_await", scope: !104, file: !67, line: 131, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !6, line: 336, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!40, !40}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "am_aiter", scope: !104, file: !67, line: 132, baseType: !107, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "am_anext", scope: !104, file: !67, line: 133, baseType: !107, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "am_send", scope: !104, file: !67, line: 134, baseType: !114, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "sendfunc", file: !67, line: 128, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!118, !40, !40, !119}
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySendResult", file: !6, line: 699, baseType: !5)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !66, file: !67, line: 161, baseType: !121, size: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !6, line: 358, baseType: !108)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !66, file: !67, line: 165, baseType: !123, size: 64, offset: 768)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !67, line: 106, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 61, size: 2304, elements: !126)
!126 = !{!127, !132, !133, !134, !135, !136, !141, !142, !143, !144, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !125, file: !67, line: 66, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !6, line: 337, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!40, !40, !40}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !125, file: !67, line: 67, baseType: !128, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !125, file: !67, line: 68, baseType: !128, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !125, file: !67, line: 69, baseType: !128, size: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !125, file: !67, line: 70, baseType: !128, size: 64, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !125, file: !67, line: 71, baseType: !137, size: 64, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !6, line: 338, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!40, !40, !40, !40}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !125, file: !67, line: 72, baseType: !107, size: 64, offset: 384)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !125, file: !67, line: 73, baseType: !107, size: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !125, file: !67, line: 74, baseType: !107, size: 64, offset: 512)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !125, file: !67, line: 75, baseType: !145, size: 64, offset: 576)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !6, line: 339, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!7, !40}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !125, file: !67, line: 76, baseType: !107, size: 64, offset: 640)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !125, file: !67, line: 77, baseType: !128, size: 64, offset: 704)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !125, file: !67, line: 78, baseType: !128, size: 64, offset: 768)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !125, file: !67, line: 79, baseType: !128, size: 64, offset: 832)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !125, file: !67, line: 80, baseType: !128, size: 64, offset: 896)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !125, file: !67, line: 81, baseType: !128, size: 64, offset: 960)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !125, file: !67, line: 82, baseType: !107, size: 64, offset: 1024)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !125, file: !67, line: 83, baseType: !39, size: 64, offset: 1088)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !125, file: !67, line: 84, baseType: !107, size: 64, offset: 1152)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !125, file: !67, line: 86, baseType: !128, size: 64, offset: 1216)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !125, file: !67, line: 87, baseType: !128, size: 64, offset: 1280)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !125, file: !67, line: 88, baseType: !128, size: 64, offset: 1344)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !125, file: !67, line: 89, baseType: !128, size: 64, offset: 1408)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !125, file: !67, line: 90, baseType: !137, size: 64, offset: 1472)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !125, file: !67, line: 91, baseType: !128, size: 64, offset: 1536)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !125, file: !67, line: 92, baseType: !128, size: 64, offset: 1600)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !125, file: !67, line: 93, baseType: !128, size: 64, offset: 1664)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !125, file: !67, line: 94, baseType: !128, size: 64, offset: 1728)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !125, file: !67, line: 95, baseType: !128, size: 64, offset: 1792)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !125, file: !67, line: 97, baseType: !128, size: 64, offset: 1856)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !125, file: !67, line: 98, baseType: !128, size: 64, offset: 1920)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !125, file: !67, line: 99, baseType: !128, size: 64, offset: 1984)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !125, file: !67, line: 100, baseType: !128, size: 64, offset: 2048)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !125, file: !67, line: 102, baseType: !107, size: 64, offset: 2112)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_matrix_multiply", scope: !125, file: !67, line: 104, baseType: !128, size: 64, offset: 2176)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_matrix_multiply", scope: !125, file: !67, line: 105, baseType: !128, size: 64, offset: 2240)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !66, file: !67, line: 166, baseType: !176, size: 64, offset: 832)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !67, line: 120, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 108, size: 640, elements: !179)
!179 = !{!180, !185, !186, !191, !192, !193, !198, !199, !204, !205}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !178, file: !67, line: 109, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !6, line: 340, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!75, !40}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !178, file: !67, line: 110, baseType: !128, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !178, file: !67, line: 111, baseType: !187, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !6, line: 341, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!40, !40, !75}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !178, file: !67, line: 112, baseType: !187, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !178, file: !67, line: 113, baseType: !39, size: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !178, file: !67, line: 114, baseType: !194, size: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !6, line: 343, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!7, !40, !75, !40}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !178, file: !67, line: 115, baseType: !39, size: 64, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !178, file: !67, line: 116, baseType: !200, size: 64, offset: 448)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !6, line: 347, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!7, !40, !40}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !178, file: !67, line: 118, baseType: !128, size: 64, offset: 512)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !178, file: !67, line: 119, baseType: !187, size: 64, offset: 576)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !66, file: !67, line: 167, baseType: !207, size: 64, offset: 896)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !67, line: 126, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 122, size: 192, elements: !210)
!210 = !{!211, !212, !213}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !209, file: !67, line: 123, baseType: !181, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !209, file: !67, line: 124, baseType: !128, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !209, file: !67, line: 125, baseType: !214, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !6, line: 345, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!7, !40, !40, !40}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !66, file: !67, line: 171, baseType: !219, size: 64, offset: 960)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !6, line: 359, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!223, !40}
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !76, line: 170, baseType: !75)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !66, file: !67, line: 172, baseType: !137, size: 64, offset: 1024)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !66, file: !67, line: 173, baseType: !121, size: 64, offset: 1088)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !66, file: !67, line: 174, baseType: !227, size: 64, offset: 1152)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !6, line: 355, baseType: !129)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !66, file: !67, line: 175, baseType: !229, size: 64, offset: 1216)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !6, line: 357, baseType: !215)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !66, file: !67, line: 178, baseType: !231, size: 64, offset: 1280)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !67, line: 140, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 137, size: 128, elements: !234)
!234 = !{!235, !257}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !233, file: !67, line: 138, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !237, line: 35, baseType: !238)
!237 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pybuffer.h", directory: "")
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!7, !40, !241, !7}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !237, line: 33, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !237, line: 20, size: 640, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !254, !255, !256}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !243, file: !237, line: 21, baseType: !39, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !243, file: !237, line: 22, baseType: !40, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !243, file: !237, line: 23, baseType: !75, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !243, file: !237, line: 24, baseType: !75, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !243, file: !237, line: 26, baseType: !7, size: 32, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !243, file: !237, line: 27, baseType: !7, size: 32, offset: 288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !243, file: !237, line: 28, baseType: !95, size: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !243, file: !237, line: 29, baseType: !253, size: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !243, file: !237, line: 30, baseType: !253, size: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !243, file: !237, line: 31, baseType: !253, size: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !243, file: !237, line: 32, baseType: !39, size: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !233, file: !67, line: 139, baseType: !258, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !237, line: 36, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !40, !241}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !66, file: !67, line: 181, baseType: !38, size: 64, offset: 1344)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !66, file: !67, line: 183, baseType: !18, size: 64, offset: 1408)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !66, file: !67, line: 187, baseType: !265, size: 64, offset: 1472)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !6, line: 349, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!7, !40, !269, !39}
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !6, line: 348, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!7, !40, !39}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !66, file: !67, line: 190, baseType: !145, size: 64, offset: 1536)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !66, file: !67, line: 194, baseType: !275, size: 64, offset: 1600)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !6, line: 360, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!40, !40, !40, !7}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !66, file: !67, line: 197, baseType: !75, size: 64, offset: 1664)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !66, file: !67, line: 200, baseType: !281, size: 64, offset: 1728)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !6, line: 361, baseType: !108)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !66, file: !67, line: 201, baseType: !283, size: 64, offset: 1792)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !6, line: 362, baseType: !108)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !66, file: !67, line: 204, baseType: !285, size: 64, offset: 1856)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !42, line: 14, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 68, size: 256, elements: !289)
!288 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/methodobject.h", directory: "")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 69, baseType: !18, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 70, baseType: !292, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 19, baseType: !129)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 71, baseType: !7, size: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 73, baseType: !18, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !66, file: !67, line: 205, baseType: !296, size: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !42, line: 16, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !299, line: 41, size: 320, elements: !300)
!299 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/descrobject.h", directory: "")
!300 = !{!301, !302, !303, !304, !305}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !298, file: !299, line: 42, baseType: !18, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !298, file: !299, line: 43, baseType: !7, size: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !298, file: !299, line: 44, baseType: !75, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !298, file: !299, line: 45, baseType: !7, size: 32, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !298, file: !299, line: 46, baseType: !18, size: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !66, file: !67, line: 206, baseType: !307, size: 64, offset: 1984)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGetSetDef", file: !42, line: 15, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !299, line: 11, size: 320, elements: !310)
!310 = !{!311, !312, !317, !322, !323}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !309, file: !299, line: 12, baseType: !18, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !309, file: !299, line: 13, baseType: !313, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !299, line: 8, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!40, !40, !39}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !309, file: !299, line: 14, baseType: !318, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !299, line: 9, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!7, !40, !40, !39}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !309, file: !299, line: 15, baseType: !18, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !309, file: !299, line: 16, baseType: !39, size: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !66, file: !67, line: 208, baseType: !64, size: 64, offset: 2048)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !66, file: !67, line: 209, baseType: !40, size: 64, offset: 2112)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !66, file: !67, line: 210, baseType: !327, size: 64, offset: 2176)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !6, line: 363, baseType: !138)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !66, file: !67, line: 211, baseType: !329, size: 64, offset: 2240)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !6, line: 364, baseType: !215)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !66, file: !67, line: 212, baseType: !75, size: 64, offset: 2304)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !66, file: !67, line: 213, baseType: !332, size: 64, offset: 2368)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !6, line: 365, baseType: !215)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !66, file: !67, line: 214, baseType: !334, size: 64, offset: 2432)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !6, line: 367, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!40, !64, !75}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !66, file: !67, line: 215, baseType: !339, size: 64, offset: 2496)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !6, line: 366, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!40, !64, !40, !40}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !66, file: !67, line: 216, baseType: !344, size: 64, offset: 2560)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !6, line: 352, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !39}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !66, file: !67, line: 217, baseType: !145, size: 64, offset: 2624)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !66, file: !67, line: 218, baseType: !40, size: 64, offset: 2688)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !66, file: !67, line: 219, baseType: !40, size: 64, offset: 2752)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !66, file: !67, line: 220, baseType: !40, size: 64, offset: 2816)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !66, file: !67, line: 221, baseType: !39, size: 64, offset: 2880)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !66, file: !67, line: 222, baseType: !40, size: 64, offset: 2944)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !66, file: !67, line: 223, baseType: !85, size: 64, offset: 3008)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !66, file: !67, line: 228, baseType: !23, size: 32, offset: 3072)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !66, file: !67, line: 230, baseType: !85, size: 64, offset: 3136)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall", scope: !66, file: !67, line: 231, baseType: !358, size: 64, offset: 3200)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "vectorcallfunc", file: !6, line: 370, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!40, !40, !362, !35, !40}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tp_watched", scope: !66, file: !67, line: 234, baseType: !365, size: 8, offset: 3264)
!365 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tp_versions_used", scope: !66, file: !67, line: 241, baseType: !59, size: 16, offset: 3280)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !368, line: 30, baseType: !7)
!368 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_int32_t.h", directory: "")
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !371, line: 15, baseType: !372)
!371 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/bytesobject.h", directory: "")
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !371, line: 5, size: 320, elements: !373)
!373 = !{!374, !375, !376}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !372, file: !371, line: 6, baseType: !70, size: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !372, file: !371, line: 7, baseType: !223, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !372, file: !371, line: 8, baseType: !377, size: 8, offset: 256)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 1)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunctionObject", file: !382, line: 14, baseType: !383)
!382 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/methodobject.h", directory: "")
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 7, size: 448, elements: !384)
!384 = !{!385, !386, !387, !388, !389, !390}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !383, file: !382, line: 8, baseType: !41, size: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "m_ml", scope: !383, file: !382, line: 9, baseType: !285, size: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "m_self", scope: !383, file: !382, line: 10, baseType: !40, size: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "m_module", scope: !383, file: !382, line: 11, baseType: !40, size: 64, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "m_weakreflist", scope: !383, file: !382, line: 12, baseType: !40, size: 64, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "vectorcall", scope: !383, file: !382, line: 13, baseType: !358, size: 64, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !393, line: 163, baseType: !394)
!393 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/unicodeobject.h", directory: "")
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !393, line: 54, size: 320, elements: !395)
!395 = !{!396, !397, !398, !399}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !394, file: !393, line: 99, baseType: !41, size: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !394, file: !393, line: 100, baseType: !75, size: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !394, file: !393, line: 101, baseType: !223, size: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !394, file: !393, line: 162, baseType: !400, size: 32, offset: 256)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !394, file: !393, line: 107, size: 32, elements: !401)
!401 = !{!402, !403, !404, !405, !406}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !400, file: !393, line: 121, baseType: !23, size: 2, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !400, file: !393, line: 145, baseType: !23, size: 3, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !400, file: !393, line: 150, baseType: !23, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !400, file: !393, line: 154, baseType: !23, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "statically_allocated", scope: !400, file: !393, line: 156, baseType: !23, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyLongObject", file: !42, line: 19, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_longobject", file: !410, line: 98, size: 256, elements: !411)
!410 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/longintrepr.h", directory: "")
!411 = !{!412, !413}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !409, file: !410, line: 99, baseType: !41, size: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "long_value", scope: !409, file: !410, line: 100, baseType: !414, size: 128, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyLongValue", file: !410, line: 96, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PyLongValue", file: !410, line: 93, size: 128, elements: !416)
!416 = !{!417, !420}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "lv_tag", scope: !415, file: !410, line: 94, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !419, line: 34, baseType: !38)
!419 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ob_digit", scope: !415, file: !410, line: 95, baseType: !421, size: 32, offset: 64)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, size: 32, elements: !378)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "digit", file: !410, line: 43, baseType: !56)
!423 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFloatObject", file: !426, line: 8, baseType: !427)
!426 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/floatobject.h", directory: "")
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !426, line: 5, size: 192, elements: !428)
!428 = !{!429, !430}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !427, file: !426, line: 6, baseType: !41, size: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ob_fval", scope: !427, file: !426, line: 7, baseType: !423, size: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBaseExceptionObject", file: !433, line: 15, baseType: !434)
!433 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/pyerrors.h", directory: "")
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !433, line: 13, size: 576, elements: !435)
!435 = !{!436, !437, !438, !439, !440, !441, !442, !443}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !434, file: !433, line: 14, baseType: !41, size: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !434, file: !433, line: 14, baseType: !40, size: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !434, file: !433, line: 14, baseType: !40, size: 64, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !434, file: !433, line: 14, baseType: !40, size: 64, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", scope: !434, file: !433, line: 14, baseType: !40, size: 64, offset: 320)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !434, file: !433, line: 14, baseType: !40, size: 64, offset: 384)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "cause", scope: !434, file: !433, line: 14, baseType: !40, size: 64, offset: 448)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_context", scope: !434, file: !433, line: 14, baseType: !20, size: 8, offset: 512)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CodeObjectCacheEntry", file: !446, line: 1726, baseType: !447)
!446 = !DIFile(filename: "dataset/cases/goeq-oja-0122/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c", directory: ".")
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !446, line: 1723, size: 128, elements: !448)
!448 = !{!449, !507}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "code_object", scope: !447, file: !446, line: 1724, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CachedCodeObjectType", file: !446, line: 1721, baseType: !452)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !42, line: 21, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyCodeObject", file: !454, line: 115, size: 1728, elements: !455)
!454 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/code.h", directory: "")
!455 = !{!456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !490, !499, !500, !503, !504, !505, !506}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !453, file: !454, line: 115, baseType: !70, size: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !453, file: !454, line: 115, baseType: !40, size: 64, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !453, file: !454, line: 115, baseType: !40, size: 64, offset: 256)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "co_exceptiontable", scope: !453, file: !454, line: 115, baseType: !40, size: 64, offset: 320)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !453, file: !454, line: 115, baseType: !7, size: 32, offset: 384)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !453, file: !454, line: 115, baseType: !7, size: 32, offset: 416)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "co_posonlyargcount", scope: !453, file: !454, line: 115, baseType: !7, size: 32, offset: 448)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !453, file: !454, line: 115, baseType: !7, size: 32, offset: 480)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !453, file: !454, line: 115, baseType: !7, size: 32, offset: 512)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !453, file: !454, line: 115, baseType: !7, size: 32, offset: 544)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocalsplus", scope: !453, file: !454, line: 115, baseType: !7, size: 32, offset: 576)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "co_framesize", scope: !453, file: !454, line: 115, baseType: !7, size: 32, offset: 608)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !453, file: !454, line: 115, baseType: !7, size: 32, offset: 640)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "co_ncellvars", scope: !453, file: !454, line: 115, baseType: !7, size: 32, offset: 672)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "co_nfreevars", scope: !453, file: !454, line: 115, baseType: !7, size: 32, offset: 704)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "co_version", scope: !453, file: !454, line: 115, baseType: !56, size: 32, offset: 736)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "co_localsplusnames", scope: !453, file: !454, line: 115, baseType: !40, size: 64, offset: 768)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "co_localspluskinds", scope: !453, file: !454, line: 115, baseType: !40, size: 64, offset: 832)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !453, file: !454, line: 115, baseType: !40, size: 64, offset: 896)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !453, file: !454, line: 115, baseType: !40, size: 64, offset: 960)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "co_qualname", scope: !453, file: !454, line: 115, baseType: !40, size: 64, offset: 1024)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "co_linetable", scope: !453, file: !454, line: 115, baseType: !40, size: 64, offset: 1088)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !453, file: !454, line: 115, baseType: !40, size: 64, offset: 1152)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "co_executors", scope: !453, file: !454, line: 115, baseType: !480, size: 64, offset: 1216)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyExecutorArray", file: !454, line: 22, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !454, line: 18, size: 128, elements: !483)
!483 = !{!484, !485, !486}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !482, file: !454, line: 19, baseType: !7, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !482, file: !454, line: 20, baseType: !7, size: 32, offset: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "executors", scope: !482, file: !454, line: 21, baseType: !487, size: 64, offset: 64)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 64, elements: !378)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyExecutorObject", file: !454, line: 21, flags: DIFlagFwdDecl)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_co_cached", scope: !453, file: !454, line: 115, baseType: !491, size: 64, offset: 1280)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyCoCached", file: !454, line: 16, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !454, line: 11, size: 256, elements: !494)
!494 = !{!495, !496, !497, !498}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_co_code", scope: !493, file: !454, line: 12, baseType: !40, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_co_varnames", scope: !493, file: !454, line: 13, baseType: !40, size: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_co_cellvars", scope: !493, file: !454, line: 14, baseType: !40, size: 64, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_co_freevars", scope: !493, file: !454, line: 15, baseType: !40, size: 64, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_co_instrumentation_version", scope: !453, file: !454, line: 115, baseType: !418, size: 64, offset: 1344)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_co_monitoring", scope: !453, file: !454, line: 115, baseType: !501, size: 64, offset: 1408)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyCoMonitoringData", file: !454, line: 115, flags: DIFlagFwdDecl)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_co_unique_id", scope: !453, file: !454, line: 115, baseType: !75, size: 64, offset: 1472)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_co_firsttraceable", scope: !453, file: !454, line: 115, baseType: !7, size: 32, offset: 1536)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "co_extra", scope: !453, file: !454, line: 115, baseType: !39, size: 64, offset: 1600)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "co_code_adaptive", scope: !453, file: !454, line: 115, baseType: !377, size: 8, offset: 1664)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "code_line", scope: !447, file: !446, line: 1725, baseType: !7, size: 32, offset: 64)
!508 = !{!0, !509, !514, !516, !521, !551, !554, !559, !564, !569, !574, !576, !578, !580, !585, !590, !592, !598, !603, !605, !610, !635, !637, !642, !647, !652, !654, !659, !663, !668, !670, !672, !677, !682, !687, !689, !691, !693, !698, !700, !702, !704, !709, !711, !714, !719, !724, !729, !734, !739, !741, !743, !745, !747, !749, !751, !753, !755, !760, !762, !767}
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !446, line: 3598, type: !511, isLocal: true, isDefinition: true)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, elements: !512)
!512 = !{!513}
!513 = !DISubrange(count: 16)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(scope: null, file: !446, line: 3605, type: !377, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !446, line: 2116, type: !518, isLocal: true, isDefinition: true)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 72, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: 9)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "__pyx_moduledef", scope: !2, file: !446, line: 2112, type: !523, isLocal: true, isDefinition: true)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !524, line: 107, size: 832, elements: !525)
!524 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/moduleobject.h", directory: "")
!525 = !{!526, !537, !538, !539, !540, !541, !548, !549, !550}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !523, file: !524, line: 108, baseType: !527, size: 320)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !524, line: 58, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !524, line: 39, size: 320, elements: !529)
!529 = !{!530, !531, !535, !536}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !528, file: !524, line: 40, baseType: !41, size: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !528, file: !524, line: 47, baseType: !532, size: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!40}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !528, file: !524, line: 52, baseType: !75, size: 64, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !528, file: !524, line: 57, baseType: !40, size: 64, offset: 256)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !523, file: !524, line: 109, baseType: !18, size: 64, offset: 320)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !523, file: !524, line: 110, baseType: !18, size: 64, offset: 384)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !523, file: !524, line: 111, baseType: !75, size: 64, offset: 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !523, file: !524, line: 112, baseType: !285, size: 64, offset: 512)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "m_slots", scope: !523, file: !524, line: 113, baseType: !542, size: 64, offset: 576)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Slot", file: !42, line: 13, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Slot", file: !524, line: 69, size: 128, elements: !545)
!545 = !{!546, !547}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !544, file: !524, line: 70, baseType: !7, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !544, file: !524, line: 71, baseType: !39, size: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !523, file: !524, line: 114, baseType: !265, size: 64, offset: 640)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !523, file: !524, line: 115, baseType: !145, size: 64, offset: 704)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !523, file: !524, line: 116, baseType: !344, size: 64, offset: 768)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "__pyx_methods", scope: !2, file: !446, line: 2011, type: !553, isLocal: true, isDefinition: true)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 256, elements: !378)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "__pyx_moduledef_slots", scope: !2, file: !446, line: 2095, type: !556, isLocal: true, isDefinition: true)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 384, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 3)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !446, line: 2244, type: !561, isLocal: true, isDefinition: true)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 40, elements: !562)
!562 = !{!563}
!563 = !DISubrange(count: 5)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !446, line: 2251, type: !566, isLocal: true, isDefinition: true)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 56, elements: !567)
!567 = !{!568}
!568 = !DISubrange(count: 7)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !446, line: 2251, type: !571, isLocal: true, isDefinition: true)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 88, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 11)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !446, line: 2252, type: !566, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !446, line: 2252, type: !518, isLocal: true, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !446, line: 2253, type: !566, isLocal: true, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(scope: null, file: !446, line: 2253, type: !582, isLocal: true, isDefinition: true)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 96, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 12)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !446, line: 2254, type: !587, isLocal: true, isDefinition: true)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 216, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 27)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(scope: null, file: !446, line: 2254, type: !518, isLocal: true, isDefinition: true)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(name: "main_interpreter_id", scope: !594, file: !446, line: 2191, type: !49, isLocal: true, isDefinition: true)
!594 = distinct !DISubprogram(name: "__Pyx_check_single_interpreter", scope: !446, file: !446, line: 2190, type: !595, scopeLine: 2190, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !597)
!595 = !DISubroutineType(types: !596)
!596 = !{!7}
!597 = !{}
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !446, line: 2213, type: !600, isLocal: true, isDefinition: true)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 760, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 95)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "__pyx_m", scope: !2, file: !446, line: 1326, type: !40, isLocal: true, isDefinition: true)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !446, line: 2286, type: !607, isLocal: true, isDefinition: true)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 648, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 81)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "__pyx_mstate_global", scope: !2, file: !446, line: 1948, type: !612, isLocal: true, isDefinition: true)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pyx_mstatetype", file: !446, line: 1927, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !446, line: 1913, size: 1664, elements: !616)
!616 = !{!617, !618, !619, !620, !621, !622, !623, !625, !629}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_d", scope: !615, file: !446, line: 1914, baseType: !40, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_b", scope: !615, file: !446, line: 1915, baseType: !40, size: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_cython_runtime", scope: !615, file: !446, line: 1916, baseType: !40, size: 64, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_tuple", scope: !615, file: !446, line: 1917, baseType: !40, size: 64, offset: 192)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_bytes", scope: !615, file: !446, line: 1918, baseType: !40, size: 64, offset: 256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_unicode", scope: !615, file: !446, line: 1919, baseType: !40, size: 64, offset: 320)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_string_tab", scope: !615, file: !446, line: 1920, baseType: !624, size: 1024, offset: 384)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 1024, elements: !512)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_number_tab", scope: !615, file: !446, line: 1921, baseType: !626, size: 128, offset: 1408)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 128, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 2)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_code_cache", scope: !615, file: !446, line: 1924, baseType: !630, size: 128, offset: 1536)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__Pyx_CodeObjectCache", file: !446, line: 1727, size: 128, elements: !631)
!631 = !{!632, !633, !634}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !630, file: !446, line: 1728, baseType: !7, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "max_count", scope: !630, file: !446, line: 1729, baseType: !7, size: 32, offset: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !630, file: !446, line: 1730, baseType: !444, size: 64, offset: 64)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !446, line: 2316, type: !518, isLocal: true, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !446, line: 2317, type: !639, isLocal: true, isDefinition: true)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 120, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 15)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !446, line: 2318, type: !644, isLocal: true, isDefinition: true)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 104, elements: !645)
!645 = !{!646}
!646 = !DISubrange(count: 13)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !446, line: 2521, type: !649, isLocal: true, isDefinition: true)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 112, elements: !650)
!650 = !{!651}
!651 = !DISubrange(count: 14)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(name: "__pyx_mstate_global_static", scope: !2, file: !446, line: 1942, type: !614, isLocal: true, isDefinition: true)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(scope: null, file: !446, line: 1336, type: !656, isLocal: true, isDefinition: true)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 432, elements: !657)
!657 = !{!658}
!658 = !DISubrange(count: 54)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "__pyx_f", scope: !2, file: !446, line: 1335, type: !661, isLocal: true, isDefinition: true)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !662, size: 64, elements: !378)
!662 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(scope: null, file: !446, line: 4461, type: !665, isLocal: true, isDefinition: true)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 624, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 78)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !446, line: 4467, type: !639, isLocal: true, isDefinition: true)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !446, line: 4467, type: !639, isLocal: true, isDefinition: true)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(scope: null, file: !446, line: 2580, type: !674, isLocal: true, isDefinition: true)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 736, elements: !675)
!675 = !{!676}
!676 = !DISubrange(count: 92)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !446, line: 4477, type: !679, isLocal: true, isDefinition: true)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 136, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 17)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !446, line: 4477, type: !684, isLocal: true, isDefinition: true)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 32, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 4)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !446, line: 4477, type: !561, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !446, line: 4478, type: !571, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !446, line: 4482, type: !684, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !446, line: 4529, type: !695, isLocal: true, isDefinition: true)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1224, elements: !696)
!696 = !{!697}
!697 = !DISubrange(count: 153)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "__pyx_filename", scope: !2, file: !446, line: 1331, type: !18, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "__pyx_lineno", scope: !2, file: !446, line: 1328, type: !7, isLocal: true, isDefinition: true)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "__pyx_clineno", scope: !2, file: !446, line: 1329, type: !7, isLocal: true, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !371, line: 25, type: !706, isLocal: true, isDefinition: true)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 144, elements: !707)
!707 = !{!708}
!708 = !DISubrange(count: 18)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(scope: null, file: !371, line: 25, type: !649, isLocal: true, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(scope: null, file: !371, line: 25, type: !713, isLocal: true, isDefinition: true)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 144, elements: !707)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(scope: null, file: !446, line: 2841, type: !716, isLocal: true, isDefinition: true)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 200, elements: !717)
!717 = !{!718}
!718 = !DISubrange(count: 25)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(scope: null, file: !446, line: 2873, type: !721, isLocal: true, isDefinition: true)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 248, elements: !722)
!722 = !{!723}
!723 = !DISubrange(count: 31)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !446, line: 2880, type: !726, isLocal: true, isDefinition: true)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 344, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 43)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !446, line: 2918, type: !731, isLocal: true, isDefinition: true)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 224, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 28)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !446, line: 2918, type: !736, isLocal: true, isDefinition: true)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 80, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 10)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !446, line: 2918, type: !587, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !446, line: 2920, type: !571, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "__pyx_builtin_input", scope: !2, file: !446, line: 1896, type: !40, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !426, line: 16, type: !706, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !426, line: 16, type: !649, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !426, line: 16, type: !713, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "__pyx_builtin_print", scope: !2, file: !446, line: 1897, type: !40, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !446, line: 3473, type: !571, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !446, line: 1330, type: !757, isLocal: true, isDefinition: true)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 944, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 118)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(name: "__pyx_cfilenm", scope: !2, file: !446, line: 1330, type: !662, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !446, line: 2743, type: !764, isLocal: true, isDefinition: true)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 192, elements: !765)
!765 = !{!766}
!766 = !DISubrange(count: 24)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(scope: null, file: !446, line: 2743, type: !769, isLocal: true, isDefinition: true)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 560, elements: !770)
!770 = !{!771}
!771 = !DISubrange(count: 70)
!772 = !{i32 2, !"SDK Version", [2 x i32] [i32 14, i32 4]}
!773 = !{i32 7, !"Dwarf Version", i32 4}
!774 = !{i32 2, !"Debug Info Version", i32 3}
!775 = !{i32 1, !"wchar_size", i32 4}
!776 = !{i32 8, !"PIC Level", i32 2}
!777 = !{i32 7, !"uwtable", i32 1}
!778 = !{i32 7, !"frame-pointer", i32 1}
!779 = !{!"Homebrew clang version 20.1.8"}
!780 = distinct !DISubprogram(name: "PyInit_original", scope: !446, file: !446, line: 2155, type: !533, scopeLine: 2157, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2)
!781 = !DILocation(line: 2158, column: 10, scope: !780)
!782 = !DILocation(line: 2158, column: 3, scope: !780)
!783 = distinct !DISubprogram(name: "main", scope: !446, file: !446, line: 3587, type: !784, scopeLine: 3588, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !597)
!784 = !DISubroutineType(types: !785)
!785 = !{!7, !7, !786}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!787 = !DILocalVariable(name: "argc", arg: 1, scope: !783, file: !446, line: 3587, type: !7)
!788 = !DILocation(line: 3587, column: 10, scope: !783)
!789 = !DILocalVariable(name: "argv", arg: 2, scope: !783, file: !446, line: 3587, type: !786)
!790 = !DILocation(line: 3587, column: 23, scope: !783)
!791 = !DILocation(line: 3589, column: 10, scope: !792)
!792 = distinct !DILexicalBlock(scope: !783, file: !446, line: 3589, column: 9)
!793 = !DILocation(line: 3589, column: 9, scope: !792)
!794 = !DILocation(line: 3590, column: 16, scope: !795)
!795 = distinct !DILexicalBlock(scope: !792, file: !446, line: 3589, column: 16)
!796 = !DILocation(line: 3590, column: 9, scope: !795)
!797 = !DILocalVariable(name: "i", scope: !798, file: !446, line: 3593, type: !7)
!798 = distinct !DILexicalBlock(scope: !792, file: !446, line: 3592, column: 10)
!799 = !DILocation(line: 3593, column: 13, scope: !798)
!800 = !DILocalVariable(name: "res", scope: !798, file: !446, line: 3593, type: !7)
!801 = !DILocation(line: 3593, column: 16, scope: !798)
!802 = !DILocalVariable(name: "argv_copy", scope: !798, file: !446, line: 3594, type: !29)
!803 = !DILocation(line: 3594, column: 19, scope: !798)
!804 = !DILocation(line: 3594, column: 78, scope: !798)
!805 = !DILocation(line: 3594, column: 69, scope: !798)
!806 = !DILocation(line: 3594, column: 67, scope: !798)
!807 = !DILocation(line: 3594, column: 43, scope: !798)
!808 = !DILocalVariable(name: "argv_copy2", scope: !798, file: !446, line: 3595, type: !29)
!809 = !DILocation(line: 3595, column: 19, scope: !798)
!810 = !DILocation(line: 3595, column: 79, scope: !798)
!811 = !DILocation(line: 3595, column: 70, scope: !798)
!812 = !DILocation(line: 3595, column: 68, scope: !798)
!813 = !DILocation(line: 3595, column: 44, scope: !798)
!814 = !DILocalVariable(name: "oldloc", scope: !798, file: !446, line: 3596, type: !95)
!815 = !DILocation(line: 3596, column: 15, scope: !798)
!816 = !DILocation(line: 3596, column: 31, scope: !798)
!817 = !DILocation(line: 3596, column: 24, scope: !798)
!818 = !DILocation(line: 3597, column: 14, scope: !819)
!819 = distinct !DILexicalBlock(scope: !798, file: !446, line: 3597, column: 13)
!820 = !DILocation(line: 3597, column: 24, scope: !819)
!821 = !DILocation(line: 3597, column: 28, scope: !819)
!822 = !DILocation(line: 3597, column: 39, scope: !819)
!823 = !DILocation(line: 3597, column: 43, scope: !819)
!824 = !DILocation(line: 3598, column: 21, scope: !825)
!825 = distinct !DILexicalBlock(scope: !819, file: !446, line: 3597, column: 51)
!826 = !DILocation(line: 3598, column: 13, scope: !825)
!827 = !DILocation(line: 3599, column: 18, scope: !825)
!828 = !DILocation(line: 3599, column: 13, scope: !825)
!829 = !DILocation(line: 3600, column: 18, scope: !825)
!830 = !DILocation(line: 3600, column: 13, scope: !825)
!831 = !DILocation(line: 3601, column: 18, scope: !825)
!832 = !DILocation(line: 3601, column: 13, scope: !825)
!833 = !DILocation(line: 3602, column: 13, scope: !825)
!834 = !DILocation(line: 3604, column: 13, scope: !798)
!835 = !DILocation(line: 3605, column: 9, scope: !798)
!836 = !DILocation(line: 3606, column: 16, scope: !837)
!837 = distinct !DILexicalBlock(scope: !798, file: !446, line: 3606, column: 9)
!838 = !DILocation(line: 3606, column: 14, scope: !837)
!839 = !DILocation(line: 3606, column: 21, scope: !840)
!840 = distinct !DILexicalBlock(scope: !837, file: !446, line: 3606, column: 9)
!841 = !DILocation(line: 3606, column: 25, scope: !840)
!842 = !DILocation(line: 3606, column: 23, scope: !840)
!843 = !DILocation(line: 3606, column: 9, scope: !837)
!844 = !DILocation(line: 3607, column: 60, scope: !845)
!845 = distinct !DILexicalBlock(scope: !840, file: !446, line: 3606, column: 36)
!846 = !DILocation(line: 3607, column: 65, scope: !845)
!847 = !DILocation(line: 3607, column: 44, scope: !845)
!848 = !DILocation(line: 3607, column: 29, scope: !845)
!849 = !DILocation(line: 3607, column: 39, scope: !845)
!850 = !DILocation(line: 3607, column: 42, scope: !845)
!851 = !DILocation(line: 3607, column: 13, scope: !845)
!852 = !DILocation(line: 3607, column: 24, scope: !845)
!853 = !DILocation(line: 3607, column: 27, scope: !845)
!854 = !DILocation(line: 3608, column: 18, scope: !855)
!855 = distinct !DILexicalBlock(scope: !845, file: !446, line: 3608, column: 17)
!856 = !DILocation(line: 3608, column: 28, scope: !855)
!857 = !DILocation(line: 3608, column: 17, scope: !855)
!858 = !DILocation(line: 3608, column: 36, scope: !855)
!859 = !DILocation(line: 3608, column: 32, scope: !855)
!860 = !DILocation(line: 3609, column: 9, scope: !845)
!861 = !DILocation(line: 3606, column: 32, scope: !840)
!862 = !DILocation(line: 3606, column: 9, scope: !840)
!863 = distinct !{!863, !843, !864, !865}
!864 = !DILocation(line: 3609, column: 9, scope: !837)
!865 = !{!"llvm.loop.mustprogress"}
!866 = !DILocation(line: 3610, column: 27, scope: !798)
!867 = !DILocation(line: 3610, column: 9, scope: !798)
!868 = !DILocation(line: 3611, column: 14, scope: !798)
!869 = !DILocation(line: 3611, column: 9, scope: !798)
!870 = !DILocation(line: 3612, column: 13, scope: !871)
!871 = distinct !DILexicalBlock(scope: !798, file: !446, line: 3612, column: 13)
!872 = !DILocation(line: 3612, column: 17, scope: !871)
!873 = !DILocation(line: 3613, column: 30, scope: !871)
!874 = !DILocation(line: 3613, column: 36, scope: !871)
!875 = !DILocation(line: 3613, column: 19, scope: !871)
!876 = !DILocation(line: 3613, column: 17, scope: !871)
!877 = !DILocation(line: 3613, column: 13, scope: !871)
!878 = !DILocation(line: 3614, column: 16, scope: !879)
!879 = distinct !DILexicalBlock(scope: !798, file: !446, line: 3614, column: 9)
!880 = !DILocation(line: 3614, column: 14, scope: !879)
!881 = !DILocation(line: 3614, column: 21, scope: !882)
!882 = distinct !DILexicalBlock(scope: !879, file: !446, line: 3614, column: 9)
!883 = !DILocation(line: 3614, column: 25, scope: !882)
!884 = !DILocation(line: 3614, column: 23, scope: !882)
!885 = !DILocation(line: 3614, column: 9, scope: !879)
!886 = !DILocation(line: 3615, column: 27, scope: !887)
!887 = distinct !DILexicalBlock(scope: !882, file: !446, line: 3614, column: 36)
!888 = !DILocation(line: 3615, column: 38, scope: !887)
!889 = !DILocation(line: 3615, column: 13, scope: !887)
!890 = !DILocation(line: 3616, column: 9, scope: !887)
!891 = !DILocation(line: 3614, column: 32, scope: !882)
!892 = !DILocation(line: 3614, column: 9, scope: !882)
!893 = distinct !{!893, !885, !894, !865}
!894 = !DILocation(line: 3616, column: 9, scope: !879)
!895 = !DILocation(line: 3617, column: 14, scope: !798)
!896 = !DILocation(line: 3617, column: 9, scope: !798)
!897 = !DILocation(line: 3618, column: 14, scope: !798)
!898 = !DILocation(line: 3618, column: 9, scope: !798)
!899 = !DILocation(line: 3619, column: 16, scope: !798)
!900 = !DILocation(line: 3619, column: 9, scope: !798)
!901 = !DILocation(line: 3621, column: 1, scope: !783)
!902 = distinct !DISubprogram(name: "__Pyx_main", scope: !446, file: !446, line: 3532, type: !903, scopeLine: 3534, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !597)
!903 = !DISubroutineType(types: !904)
!904 = !{!7, !7, !29}
!905 = !DILocalVariable(name: "argc", arg: 1, scope: !902, file: !446, line: 3532, type: !7)
!906 = !DILocation(line: 3532, column: 27, scope: !902)
!907 = !DILocalVariable(name: "argv", arg: 2, scope: !902, file: !446, line: 3532, type: !29)
!908 = !DILocation(line: 3532, column: 43, scope: !902)
!909 = !DILocation(line: 3545, column: 9, scope: !910)
!910 = distinct !DILexicalBlock(scope: !902, file: !446, line: 3545, column: 9)
!911 = !DILocation(line: 3545, column: 61, scope: !910)
!912 = !DILocation(line: 3545, column: 66, scope: !910)
!913 = !DILocalVariable(name: "status", scope: !914, file: !446, line: 3547, type: !915)
!914 = distinct !DILexicalBlock(scope: !902, file: !446, line: 3546, column: 5)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyStatus", file: !13, line: 19, baseType: !14)
!916 = !DILocation(line: 3547, column: 18, scope: !914)
!917 = !DILocalVariable(name: "config", scope: !914, file: !446, line: 3548, type: !918)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyConfig", file: !13, line: 244, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyConfig", file: !13, line: 134, size: 3648, elements: !920)
!920 = !{!921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "_config_init", scope: !919, file: !13, line: 135, baseType: !7, size: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "isolated", scope: !919, file: !13, line: 137, baseType: !7, size: 32, offset: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "use_environment", scope: !919, file: !13, line: 138, baseType: !7, size: 32, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "dev_mode", scope: !919, file: !13, line: 139, baseType: !7, size: 32, offset: 96)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "install_signal_handlers", scope: !919, file: !13, line: 140, baseType: !7, size: 32, offset: 128)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "use_hash_seed", scope: !919, file: !13, line: 141, baseType: !7, size: 32, offset: 160)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "hash_seed", scope: !919, file: !13, line: 142, baseType: !38, size: 64, offset: 192)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "faulthandler", scope: !919, file: !13, line: 143, baseType: !7, size: 32, offset: 256)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "tracemalloc", scope: !919, file: !13, line: 144, baseType: !7, size: 32, offset: 288)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "perf_profiling", scope: !919, file: !13, line: 145, baseType: !7, size: 32, offset: 320)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "remote_debug", scope: !919, file: !13, line: 146, baseType: !7, size: 32, offset: 352)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "import_time", scope: !919, file: !13, line: 147, baseType: !7, size: 32, offset: 384)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "code_debug_ranges", scope: !919, file: !13, line: 148, baseType: !7, size: 32, offset: 416)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "show_ref_count", scope: !919, file: !13, line: 149, baseType: !7, size: 32, offset: 448)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "dump_refs", scope: !919, file: !13, line: 150, baseType: !7, size: 32, offset: 480)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "dump_refs_file", scope: !919, file: !13, line: 151, baseType: !30, size: 64, offset: 512)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_stats", scope: !919, file: !13, line: 152, baseType: !7, size: 32, offset: 576)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "filesystem_encoding", scope: !919, file: !13, line: 153, baseType: !30, size: 64, offset: 640)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "filesystem_errors", scope: !919, file: !13, line: 154, baseType: !30, size: 64, offset: 704)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "pycache_prefix", scope: !919, file: !13, line: 155, baseType: !30, size: 64, offset: 768)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "parse_argv", scope: !919, file: !13, line: 156, baseType: !7, size: 32, offset: 832)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "orig_argv", scope: !919, file: !13, line: 157, baseType: !943, size: 128, offset: 896)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyWideStringList", file: !13, line: 36, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 31, size: 128, elements: !945)
!945 = !{!946, !947}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !944, file: !13, line: 34, baseType: !75, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !944, file: !13, line: 35, baseType: !29, size: 64, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !919, file: !13, line: 158, baseType: !943, size: 128, offset: 1024)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "xoptions", scope: !919, file: !13, line: 159, baseType: !943, size: 128, offset: 1152)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "warnoptions", scope: !919, file: !13, line: 160, baseType: !943, size: 128, offset: 1280)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "site_import", scope: !919, file: !13, line: 161, baseType: !7, size: 32, offset: 1408)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_warning", scope: !919, file: !13, line: 162, baseType: !7, size: 32, offset: 1440)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "warn_default_encoding", scope: !919, file: !13, line: 163, baseType: !7, size: 32, offset: 1472)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "inspect", scope: !919, file: !13, line: 164, baseType: !7, size: 32, offset: 1504)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !919, file: !13, line: 165, baseType: !7, size: 32, offset: 1536)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "optimization_level", scope: !919, file: !13, line: 166, baseType: !7, size: 32, offset: 1568)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "parser_debug", scope: !919, file: !13, line: 167, baseType: !7, size: 32, offset: 1600)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "write_bytecode", scope: !919, file: !13, line: 168, baseType: !7, size: 32, offset: 1632)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !919, file: !13, line: 169, baseType: !7, size: 32, offset: 1664)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !919, file: !13, line: 170, baseType: !7, size: 32, offset: 1696)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "user_site_directory", scope: !919, file: !13, line: 171, baseType: !7, size: 32, offset: 1728)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "configure_c_stdio", scope: !919, file: !13, line: 172, baseType: !7, size: 32, offset: 1760)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "buffered_stdio", scope: !919, file: !13, line: 173, baseType: !7, size: 32, offset: 1792)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "stdio_encoding", scope: !919, file: !13, line: 174, baseType: !30, size: 64, offset: 1856)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "stdio_errors", scope: !919, file: !13, line: 175, baseType: !30, size: 64, offset: 1920)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "check_hash_pycs_mode", scope: !919, file: !13, line: 179, baseType: !30, size: 64, offset: 1984)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "use_frozen_modules", scope: !919, file: !13, line: 180, baseType: !7, size: 32, offset: 2048)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "safe_path", scope: !919, file: !13, line: 181, baseType: !7, size: 32, offset: 2080)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "int_max_str_digits", scope: !919, file: !13, line: 182, baseType: !7, size: 32, offset: 2112)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "thread_inherit_context", scope: !919, file: !13, line: 183, baseType: !7, size: 32, offset: 2144)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "context_aware_warnings", scope: !919, file: !13, line: 184, baseType: !7, size: 32, offset: 2176)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "use_system_logger", scope: !919, file: !13, line: 186, baseType: !7, size: 32, offset: 2208)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_count", scope: !919, file: !13, line: 189, baseType: !7, size: 32, offset: 2240)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "pathconfig_warnings", scope: !919, file: !13, line: 196, baseType: !7, size: 32, offset: 2272)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "program_name", scope: !919, file: !13, line: 197, baseType: !30, size: 64, offset: 2304)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "pythonpath_env", scope: !919, file: !13, line: 198, baseType: !30, size: 64, offset: 2368)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "home", scope: !919, file: !13, line: 199, baseType: !30, size: 64, offset: 2432)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "platlibdir", scope: !919, file: !13, line: 200, baseType: !30, size: 64, offset: 2496)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "module_search_paths_set", scope: !919, file: !13, line: 203, baseType: !7, size: 32, offset: 2560)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "module_search_paths", scope: !919, file: !13, line: 204, baseType: !943, size: 128, offset: 2624)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "stdlib_dir", scope: !919, file: !13, line: 205, baseType: !30, size: 64, offset: 2752)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "executable", scope: !919, file: !13, line: 206, baseType: !30, size: 64, offset: 2816)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "base_executable", scope: !919, file: !13, line: 207, baseType: !30, size: 64, offset: 2880)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !919, file: !13, line: 208, baseType: !30, size: 64, offset: 2944)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "base_prefix", scope: !919, file: !13, line: 209, baseType: !30, size: 64, offset: 3008)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "exec_prefix", scope: !919, file: !13, line: 210, baseType: !30, size: 64, offset: 3072)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "base_exec_prefix", scope: !919, file: !13, line: 211, baseType: !30, size: 64, offset: 3136)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "skip_source_first_line", scope: !919, file: !13, line: 214, baseType: !7, size: 32, offset: 3200)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "run_command", scope: !919, file: !13, line: 215, baseType: !30, size: 64, offset: 3264)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "run_module", scope: !919, file: !13, line: 216, baseType: !30, size: 64, offset: 3328)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "run_filename", scope: !919, file: !13, line: 217, baseType: !30, size: 64, offset: 3392)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "sys_path_0", scope: !919, file: !13, line: 220, baseType: !30, size: 64, offset: 3456)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_install_importlib", scope: !919, file: !13, line: 226, baseType: !7, size: 32, offset: 3520)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_init_main", scope: !919, file: !13, line: 229, baseType: !7, size: 32, offset: 3552)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_is_python_build", scope: !919, file: !13, line: 232, baseType: !7, size: 32, offset: 3584)
!996 = !DILocation(line: 3548, column: 18, scope: !914)
!997 = !DILocation(line: 3549, column: 9, scope: !914)
!998 = !DILocation(line: 3550, column: 16, scope: !914)
!999 = !DILocation(line: 3550, column: 27, scope: !914)
!1000 = !DILocation(line: 3551, column: 13, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !914, file: !446, line: 3551, column: 13)
!1002 = !DILocation(line: 3551, column: 18, scope: !1001)
!1003 = !DILocation(line: 3551, column: 21, scope: !1001)
!1004 = !DILocation(line: 3552, column: 58, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !1001, file: !446, line: 3551, column: 27)
!1006 = !DILocation(line: 3552, column: 72, scope: !1005)
!1007 = !DILocation(line: 3552, column: 22, scope: !1005)
!1008 = !DILocation(line: 3553, column: 17, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !1005, file: !446, line: 3553, column: 17)
!1010 = !DILocation(line: 3554, column: 17, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1009, file: !446, line: 3553, column: 45)
!1012 = !DILocation(line: 3555, column: 17, scope: !1011)
!1013 = !DILocation(line: 3557, column: 48, scope: !1005)
!1014 = !DILocation(line: 3557, column: 54, scope: !1005)
!1015 = !DILocation(line: 3557, column: 22, scope: !1005)
!1016 = !DILocation(line: 3558, column: 17, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1005, file: !446, line: 3558, column: 17)
!1018 = !DILocation(line: 3559, column: 17, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !1017, file: !446, line: 3558, column: 45)
!1020 = !DILocation(line: 3560, column: 17, scope: !1019)
!1021 = !DILocation(line: 3562, column: 9, scope: !1005)
!1022 = !DILocation(line: 3563, column: 18, scope: !914)
!1023 = !DILocation(line: 3564, column: 13, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !914, file: !446, line: 3564, column: 13)
!1025 = !DILocation(line: 3565, column: 13, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1024, file: !446, line: 3564, column: 41)
!1027 = !DILocation(line: 3566, column: 13, scope: !1026)
!1028 = !DILocation(line: 3568, column: 9, scope: !914)
!1029 = !DILocalVariable(name: "m", scope: !1030, file: !446, line: 3571, type: !40)
!1030 = distinct !DILexicalBlock(scope: !902, file: !446, line: 3570, column: 5)
!1031 = !DILocation(line: 3571, column: 17, scope: !1030)
!1032 = !DILocation(line: 3572, column: 37, scope: !1030)
!1033 = !DILocation(line: 3573, column: 11, scope: !1030)
!1034 = !DILocation(line: 3573, column: 9, scope: !1030)
!1035 = !DILocation(line: 3574, column: 12, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1030, file: !446, line: 3574, column: 11)
!1037 = !DILocation(line: 3574, column: 14, scope: !1036)
!1038 = !DILocation(line: 3574, column: 17, scope: !1036)
!1039 = !DILocation(line: 3575, column: 11, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1036, file: !446, line: 3574, column: 35)
!1041 = !DILocation(line: 3576, column: 11, scope: !1040)
!1042 = !DILocation(line: 3578, column: 7, scope: !1030)
!1043 = !DILocation(line: 3580, column: 9, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !902, file: !446, line: 3580, column: 9)
!1045 = !DILocation(line: 3580, column: 25, scope: !1044)
!1046 = !DILocation(line: 3581, column: 9, scope: !1044)
!1047 = !DILocation(line: 3582, column: 5, scope: !902)
!1048 = !DILocation(line: 3583, column: 1, scope: !902)
!1049 = distinct !DISubprogram(name: "__pyx_pymod_create", scope: !446, file: !446, line: 2235, type: !1050, scopeLine: 2235, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !597)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!40, !40, !1052}
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef", file: !42, line: 12, baseType: !523)
