; ModuleID = 'dataset/cases/goeq-oja-0123/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c'
source_filename = "dataset/cases/goeq-oja-0123/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx14.0.0"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr }
%struct.PyModuleDef_Base = type { %struct._object, ptr, i64, ptr }
%struct._object = type { %union.anon, ptr }
%union.anon = type { i64 }
%struct.PyMethodDef = type { ptr, ptr, i32, ptr }
%struct.__pyx_mstatetype = type { ptr, ptr, ptr, ptr, ptr, ptr, [14 x ptr], [2 x ptr], %struct.__Pyx_CodeObjectCache }
%struct.__Pyx_CodeObjectCache = type { i32, i32, ptr }
%struct._typeobject = type { %struct.PyVarObject, ptr, i64, i64, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, ptr, i8, i16 }
%struct.PyVarObject = type { %struct._object, i64 }
%struct.anon.1 = type { i8, [3 x i8] }
%struct.PyStatus = type { i32, ptr, ptr, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__pyx_module_is_main_original", scope: !2, file: !437, line: 1885, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Homebrew clang version 20.1.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !28, globals: !500, splitDebugInlining: false, nameTableKind: Apple, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk", sdk: "MacOSX14.sdk")
!3 = !DIFile(filename: "dataset/cases/goeq-oja-0123/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c", directory: ".")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 695, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/object.h", directory: "")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "PYGEN_RETURN", value: 0)
!10 = !DIEnumerator(name: "PYGEN_ERROR", value: -1)
!11 = !DIEnumerator(name: "PYGEN_NEXT", value: 1)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !14, file: !13, line: 11, baseType: !23, size: 32, elements: !24)
!13 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/initconfig.h", directory: "")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 10, size: 256, elements: !15)
!15 = !{!16, !17, !21, !22}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_type", scope: !14, file: !13, line: 15, baseType: !12, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !14, file: !13, line: 16, baseType: !18, size: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "err_msg", scope: !14, file: !13, line: 17, baseType: !18, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "exitcode", scope: !14, file: !13, line: 18, baseType: !7, size: 32, offset: 192)
!23 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!24 = !{!25, !26, !27}
!25 = !DIEnumerator(name: "_PyStatus_TYPE_OK", value: 0)
!26 = !DIEnumerator(name: "_PyStatus_TYPE_ERROR", value: 1)
!27 = !DIEnumerator(name: "_PyStatus_TYPE_EXIT", value: 2)
!28 = !{!29, !35, !39, !40, !367, !7, !95, !369, !380, !396, !75, !80, !38, !51, !414, !415, !422, !435}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !32, line: 34, baseType: !33)
!32 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_wchar_t.h", directory: "")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wchar_t", file: !34, line: 82, baseType: !7)
!34 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/arm/_types.h", directory: "")
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !36, line: 31, baseType: !37)
!36 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !34, line: 70, baseType: !38)
!38 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !42, line: 18, baseType: !43)
!42 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pytypedefs.h", directory: "")
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !6, line: 110, size: 128, elements: !44)
!44 = !{!45, !63}
!45 = !DIDerivedType(tag: DW_TAG_member, scope: !43, file: !6, line: 122, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !43, file: !6, line: 122, size: 64, elements: !47)
!47 = !{!48, !52}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt_full", scope: !46, file: !6, line: 124, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !50, line: 30, baseType: !51)
!50 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_int64_t.h", directory: "")
!51 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, scope: !46, file: !6, line: 125, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !46, file: !6, line: 125, size: 64, elements: !54)
!54 = !{!55, !58, !62}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !53, file: !6, line: 131, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !57, line: 31, baseType: !23)
!57 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint32_t.h", directory: "")
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ob_overflow", scope: !53, file: !6, line: 132, baseType: !59, size: 16, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !60, line: 31, baseType: !61)
!60 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint16_t.h", directory: "")
!61 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ob_flags", scope: !53, file: !6, line: 133, baseType: !59, size: 16, offset: 48)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !43, file: !6, line: 144, baseType: !64, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !42, line: 20, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !67, line: 148, size: 3328, elements: !68)
!67 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/object.h", directory: "")
!68 = !{!69, !81, !82, !83, !84, !89, !90, !96, !101, !120, !122, !175, !206, !218, !224, !225, !226, !228, !230, !262, !263, !264, !273, !274, !279, !280, !282, !284, !295, !306, !324, !325, !326, !328, !330, !331, !333, !338, !343, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !364, !366}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !66, file: !67, line: 149, baseType: !70, size: 192)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !6, line: 172, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 169, size: 192, elements: !72)
!72 = !{!73, !74}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !71, file: !6, line: 170, baseType: !41, size: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !71, file: !6, line: 171, baseType: !75, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !76, line: 156, baseType: !77)
!76 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pyport.h", directory: "")
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !78, line: 31, baseType: !79)
!78 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_ssize_t.h", directory: "")
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ssize_t", file: !34, line: 97, baseType: !80)
!80 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !66, file: !67, line: 150, baseType: !18, size: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !66, file: !67, line: 151, baseType: !75, size: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !66, file: !67, line: 151, baseType: !75, size: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !66, file: !67, line: 155, baseType: !85, size: 64, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !6, line: 353, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !40}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall_offset", scope: !66, file: !67, line: 156, baseType: !75, size: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !66, file: !67, line: 157, baseType: !91, size: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !6, line: 354, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!40, !40, !95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !66, file: !67, line: 158, baseType: !97, size: 64, offset: 576)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !6, line: 356, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!7, !40, !95, !40}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_async", scope: !66, file: !67, line: 159, baseType: !102, size: 64, offset: 640)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyAsyncMethods", file: !67, line: 135, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 130, size: 256, elements: !105)
!105 = !{!106, !111, !112, !113}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "am_await", scope: !104, file: !67, line: 131, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !6, line: 336, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!40, !40}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "am_aiter", scope: !104, file: !67, line: 132, baseType: !107, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "am_anext", scope: !104, file: !67, line: 133, baseType: !107, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "am_send", scope: !104, file: !67, line: 134, baseType: !114, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "sendfunc", file: !67, line: 128, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!118, !40, !40, !119}
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySendResult", file: !6, line: 699, baseType: !5)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !66, file: !67, line: 161, baseType: !121, size: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !6, line: 358, baseType: !108)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !66, file: !67, line: 165, baseType: !123, size: 64, offset: 768)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !67, line: 106, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 61, size: 2304, elements: !126)
!126 = !{!127, !132, !133, !134, !135, !136, !141, !142, !143, !144, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !125, file: !67, line: 66, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !6, line: 337, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!40, !40, !40}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !125, file: !67, line: 67, baseType: !128, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !125, file: !67, line: 68, baseType: !128, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !125, file: !67, line: 69, baseType: !128, size: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !125, file: !67, line: 70, baseType: !128, size: 64, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !125, file: !67, line: 71, baseType: !137, size: 64, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !6, line: 338, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!40, !40, !40, !40}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !125, file: !67, line: 72, baseType: !107, size: 64, offset: 384)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !125, file: !67, line: 73, baseType: !107, size: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !125, file: !67, line: 74, baseType: !107, size: 64, offset: 512)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !125, file: !67, line: 75, baseType: !145, size: 64, offset: 576)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !6, line: 339, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!7, !40}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !125, file: !67, line: 76, baseType: !107, size: 64, offset: 640)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !125, file: !67, line: 77, baseType: !128, size: 64, offset: 704)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !125, file: !67, line: 78, baseType: !128, size: 64, offset: 768)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !125, file: !67, line: 79, baseType: !128, size: 64, offset: 832)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !125, file: !67, line: 80, baseType: !128, size: 64, offset: 896)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !125, file: !67, line: 81, baseType: !128, size: 64, offset: 960)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !125, file: !67, line: 82, baseType: !107, size: 64, offset: 1024)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !125, file: !67, line: 83, baseType: !39, size: 64, offset: 1088)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !125, file: !67, line: 84, baseType: !107, size: 64, offset: 1152)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !125, file: !67, line: 86, baseType: !128, size: 64, offset: 1216)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !125, file: !67, line: 87, baseType: !128, size: 64, offset: 1280)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !125, file: !67, line: 88, baseType: !128, size: 64, offset: 1344)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !125, file: !67, line: 89, baseType: !128, size: 64, offset: 1408)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !125, file: !67, line: 90, baseType: !137, size: 64, offset: 1472)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !125, file: !67, line: 91, baseType: !128, size: 64, offset: 1536)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !125, file: !67, line: 92, baseType: !128, size: 64, offset: 1600)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !125, file: !67, line: 93, baseType: !128, size: 64, offset: 1664)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !125, file: !67, line: 94, baseType: !128, size: 64, offset: 1728)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !125, file: !67, line: 95, baseType: !128, size: 64, offset: 1792)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !125, file: !67, line: 97, baseType: !128, size: 64, offset: 1856)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !125, file: !67, line: 98, baseType: !128, size: 64, offset: 1920)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !125, file: !67, line: 99, baseType: !128, size: 64, offset: 1984)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !125, file: !67, line: 100, baseType: !128, size: 64, offset: 2048)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !125, file: !67, line: 102, baseType: !107, size: 64, offset: 2112)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_matrix_multiply", scope: !125, file: !67, line: 104, baseType: !128, size: 64, offset: 2176)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_matrix_multiply", scope: !125, file: !67, line: 105, baseType: !128, size: 64, offset: 2240)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !66, file: !67, line: 166, baseType: !176, size: 64, offset: 832)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !67, line: 120, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 108, size: 640, elements: !179)
!179 = !{!180, !185, !186, !191, !192, !193, !198, !199, !204, !205}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !178, file: !67, line: 109, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !6, line: 340, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!75, !40}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !178, file: !67, line: 110, baseType: !128, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !178, file: !67, line: 111, baseType: !187, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !6, line: 341, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!40, !40, !75}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !178, file: !67, line: 112, baseType: !187, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !178, file: !67, line: 113, baseType: !39, size: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !178, file: !67, line: 114, baseType: !194, size: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !6, line: 343, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!7, !40, !75, !40}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !178, file: !67, line: 115, baseType: !39, size: 64, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !178, file: !67, line: 116, baseType: !200, size: 64, offset: 448)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !6, line: 347, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!7, !40, !40}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !178, file: !67, line: 118, baseType: !128, size: 64, offset: 512)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !178, file: !67, line: 119, baseType: !187, size: 64, offset: 576)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !66, file: !67, line: 167, baseType: !207, size: 64, offset: 896)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !67, line: 126, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 122, size: 192, elements: !210)
!210 = !{!211, !212, !213}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !209, file: !67, line: 123, baseType: !181, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !209, file: !67, line: 124, baseType: !128, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !209, file: !67, line: 125, baseType: !214, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !6, line: 345, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!7, !40, !40, !40}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !66, file: !67, line: 171, baseType: !219, size: 64, offset: 960)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !6, line: 359, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!223, !40}
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !76, line: 170, baseType: !75)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !66, file: !67, line: 172, baseType: !137, size: 64, offset: 1024)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !66, file: !67, line: 173, baseType: !121, size: 64, offset: 1088)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !66, file: !67, line: 174, baseType: !227, size: 64, offset: 1152)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !6, line: 355, baseType: !129)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !66, file: !67, line: 175, baseType: !229, size: 64, offset: 1216)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !6, line: 357, baseType: !215)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !66, file: !67, line: 178, baseType: !231, size: 64, offset: 1280)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !67, line: 140, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 137, size: 128, elements: !234)
!234 = !{!235, !257}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !233, file: !67, line: 138, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !237, line: 35, baseType: !238)
!237 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pybuffer.h", directory: "")
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!7, !40, !241, !7}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !237, line: 33, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !237, line: 20, size: 640, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !254, !255, !256}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !243, file: !237, line: 21, baseType: !39, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !243, file: !237, line: 22, baseType: !40, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !243, file: !237, line: 23, baseType: !75, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !243, file: !237, line: 24, baseType: !75, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !243, file: !237, line: 26, baseType: !7, size: 32, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !243, file: !237, line: 27, baseType: !7, size: 32, offset: 288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !243, file: !237, line: 28, baseType: !95, size: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !243, file: !237, line: 29, baseType: !253, size: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !243, file: !237, line: 30, baseType: !253, size: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !243, file: !237, line: 31, baseType: !253, size: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !243, file: !237, line: 32, baseType: !39, size: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !233, file: !67, line: 139, baseType: !258, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !237, line: 36, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !40, !241}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !66, file: !67, line: 181, baseType: !38, size: 64, offset: 1344)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !66, file: !67, line: 183, baseType: !18, size: 64, offset: 1408)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !66, file: !67, line: 187, baseType: !265, size: 64, offset: 1472)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !6, line: 349, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!7, !40, !269, !39}
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !6, line: 348, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!7, !40, !39}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !66, file: !67, line: 190, baseType: !145, size: 64, offset: 1536)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !66, file: !67, line: 194, baseType: !275, size: 64, offset: 1600)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !6, line: 360, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!40, !40, !40, !7}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !66, file: !67, line: 197, baseType: !75, size: 64, offset: 1664)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !66, file: !67, line: 200, baseType: !281, size: 64, offset: 1728)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !6, line: 361, baseType: !108)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !66, file: !67, line: 201, baseType: !283, size: 64, offset: 1792)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !6, line: 362, baseType: !108)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !66, file: !67, line: 204, baseType: !285, size: 64, offset: 1856)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !42, line: 14, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 68, size: 256, elements: !289)
!288 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/methodobject.h", directory: "")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 69, baseType: !18, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 70, baseType: !292, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 19, baseType: !129)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 71, baseType: !7, size: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 73, baseType: !18, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !66, file: !67, line: 205, baseType: !296, size: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !42, line: 16, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !299, line: 41, size: 320, elements: !300)
!299 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/descrobject.h", directory: "")
!300 = !{!301, !302, !303, !304, !305}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !298, file: !299, line: 42, baseType: !18, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !298, file: !299, line: 43, baseType: !7, size: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !298, file: !299, line: 44, baseType: !75, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !298, file: !299, line: 45, baseType: !7, size: 32, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !298, file: !299, line: 46, baseType: !18, size: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !66, file: !67, line: 206, baseType: !307, size: 64, offset: 1984)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGetSetDef", file: !42, line: 15, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !299, line: 11, size: 320, elements: !310)
!310 = !{!311, !312, !317, !322, !323}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !309, file: !299, line: 12, baseType: !18, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !309, file: !299, line: 13, baseType: !313, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !299, line: 8, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!40, !40, !39}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !309, file: !299, line: 14, baseType: !318, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !299, line: 9, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!7, !40, !40, !39}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !309, file: !299, line: 15, baseType: !18, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !309, file: !299, line: 16, baseType: !39, size: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !66, file: !67, line: 208, baseType: !64, size: 64, offset: 2048)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !66, file: !67, line: 209, baseType: !40, size: 64, offset: 2112)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !66, file: !67, line: 210, baseType: !327, size: 64, offset: 2176)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !6, line: 363, baseType: !138)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !66, file: !67, line: 211, baseType: !329, size: 64, offset: 2240)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !6, line: 364, baseType: !215)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !66, file: !67, line: 212, baseType: !75, size: 64, offset: 2304)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !66, file: !67, line: 213, baseType: !332, size: 64, offset: 2368)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !6, line: 365, baseType: !215)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !66, file: !67, line: 214, baseType: !334, size: 64, offset: 2432)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !6, line: 367, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!40, !64, !75}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !66, file: !67, line: 215, baseType: !339, size: 64, offset: 2496)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !6, line: 366, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!40, !64, !40, !40}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !66, file: !67, line: 216, baseType: !344, size: 64, offset: 2560)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !6, line: 352, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !39}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !66, file: !67, line: 217, baseType: !145, size: 64, offset: 2624)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !66, file: !67, line: 218, baseType: !40, size: 64, offset: 2688)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !66, file: !67, line: 219, baseType: !40, size: 64, offset: 2752)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !66, file: !67, line: 220, baseType: !40, size: 64, offset: 2816)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !66, file: !67, line: 221, baseType: !39, size: 64, offset: 2880)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !66, file: !67, line: 222, baseType: !40, size: 64, offset: 2944)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !66, file: !67, line: 223, baseType: !85, size: 64, offset: 3008)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !66, file: !67, line: 228, baseType: !23, size: 32, offset: 3072)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !66, file: !67, line: 230, baseType: !85, size: 64, offset: 3136)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall", scope: !66, file: !67, line: 231, baseType: !358, size: 64, offset: 3200)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "vectorcallfunc", file: !6, line: 370, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!40, !40, !362, !35, !40}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tp_watched", scope: !66, file: !67, line: 234, baseType: !365, size: 8, offset: 3264)
!365 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tp_versions_used", scope: !66, file: !67, line: 241, baseType: !59, size: 16, offset: 3280)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !368, line: 30, baseType: !7)
!368 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_int32_t.h", directory: "")
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunctionObject", file: !371, line: 14, baseType: !372)
!371 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/methodobject.h", directory: "")
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !371, line: 7, size: 448, elements: !373)
!373 = !{!374, !375, !376, !377, !378, !379}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !372, file: !371, line: 8, baseType: !41, size: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "m_ml", scope: !372, file: !371, line: 9, baseType: !285, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "m_self", scope: !372, file: !371, line: 10, baseType: !40, size: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "m_module", scope: !372, file: !371, line: 11, baseType: !40, size: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "m_weakreflist", scope: !372, file: !371, line: 12, baseType: !40, size: 64, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "vectorcall", scope: !372, file: !371, line: 13, baseType: !358, size: 64, offset: 384)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !382, line: 163, baseType: !383)
!382 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/unicodeobject.h", directory: "")
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 54, size: 320, elements: !384)
!384 = !{!385, !386, !387, !388}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !383, file: !382, line: 99, baseType: !41, size: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !383, file: !382, line: 100, baseType: !75, size: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !383, file: !382, line: 101, baseType: !223, size: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !383, file: !382, line: 162, baseType: !389, size: 32, offset: 256)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !383, file: !382, line: 107, size: 32, elements: !390)
!390 = !{!391, !392, !393, !394, !395}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !389, file: !382, line: 121, baseType: !23, size: 2, flags: DIFlagBitField, extraData: i64 0)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !389, file: !382, line: 145, baseType: !23, size: 3, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !389, file: !382, line: 150, baseType: !23, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !389, file: !382, line: 154, baseType: !23, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "statically_allocated", scope: !389, file: !382, line: 156, baseType: !23, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyLongObject", file: !42, line: 19, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_longobject", file: !399, line: 98, size: 256, elements: !400)
!399 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/longintrepr.h", directory: "")
!400 = !{!401, !402}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !398, file: !399, line: 99, baseType: !41, size: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "long_value", scope: !398, file: !399, line: 100, baseType: !403, size: 128, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyLongValue", file: !399, line: 96, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PyLongValue", file: !399, line: 93, size: 128, elements: !405)
!405 = !{!406, !409}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "lv_tag", scope: !404, file: !399, line: 94, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !408, line: 34, baseType: !38)
!408 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ob_digit", scope: !404, file: !399, line: 95, baseType: !410, size: 32, offset: 64)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 32, elements: !412)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "digit", file: !399, line: 43, baseType: !56)
!412 = !{!413}
!413 = !DISubrange(count: 1)
!414 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFloatObject", file: !417, line: 8, baseType: !418)
!417 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/floatobject.h", directory: "")
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !417, line: 5, size: 192, elements: !419)
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !418, file: !417, line: 6, baseType: !41, size: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ob_fval", scope: !418, file: !417, line: 7, baseType: !414, size: 64, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBaseExceptionObject", file: !424, line: 15, baseType: !425)
!424 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/pyerrors.h", directory: "")
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !424, line: 13, size: 576, elements: !426)
!426 = !{!427, !428, !429, !430, !431, !432, !433, !434}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !425, file: !424, line: 14, baseType: !41, size: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !425, file: !424, line: 14, baseType: !40, size: 64, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !425, file: !424, line: 14, baseType: !40, size: 64, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !425, file: !424, line: 14, baseType: !40, size: 64, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", scope: !425, file: !424, line: 14, baseType: !40, size: 64, offset: 320)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !425, file: !424, line: 14, baseType: !40, size: 64, offset: 384)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "cause", scope: !425, file: !424, line: 14, baseType: !40, size: 64, offset: 448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_context", scope: !425, file: !424, line: 14, baseType: !20, size: 8, offset: 512)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CodeObjectCacheEntry", file: !437, line: 1719, baseType: !438)
!437 = !DIFile(filename: "dataset/cases/goeq-oja-0123/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c", directory: ".")
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !437, line: 1716, size: 128, elements: !439)
!439 = !{!440, !499}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "code_object", scope: !438, file: !437, line: 1717, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CachedCodeObjectType", file: !437, line: 1714, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !42, line: 21, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyCodeObject", file: !445, line: 115, size: 1728, elements: !446)
!445 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/code.h", directory: "")
!446 = !{!447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !481, !490, !491, !494, !495, !496, !497}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !444, file: !445, line: 115, baseType: !70, size: 192)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !444, file: !445, line: 115, baseType: !40, size: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !444, file: !445, line: 115, baseType: !40, size: 64, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "co_exceptiontable", scope: !444, file: !445, line: 115, baseType: !40, size: 64, offset: 320)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !444, file: !445, line: 115, baseType: !7, size: 32, offset: 384)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !444, file: !445, line: 115, baseType: !7, size: 32, offset: 416)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "co_posonlyargcount", scope: !444, file: !445, line: 115, baseType: !7, size: 32, offset: 448)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !444, file: !445, line: 115, baseType: !7, size: 32, offset: 480)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !444, file: !445, line: 115, baseType: !7, size: 32, offset: 512)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !444, file: !445, line: 115, baseType: !7, size: 32, offset: 544)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocalsplus", scope: !444, file: !445, line: 115, baseType: !7, size: 32, offset: 576)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "co_framesize", scope: !444, file: !445, line: 115, baseType: !7, size: 32, offset: 608)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !444, file: !445, line: 115, baseType: !7, size: 32, offset: 640)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "co_ncellvars", scope: !444, file: !445, line: 115, baseType: !7, size: 32, offset: 672)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "co_nfreevars", scope: !444, file: !445, line: 115, baseType: !7, size: 32, offset: 704)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "co_version", scope: !444, file: !445, line: 115, baseType: !56, size: 32, offset: 736)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "co_localsplusnames", scope: !444, file: !445, line: 115, baseType: !40, size: 64, offset: 768)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "co_localspluskinds", scope: !444, file: !445, line: 115, baseType: !40, size: 64, offset: 832)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !444, file: !445, line: 115, baseType: !40, size: 64, offset: 896)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !444, file: !445, line: 115, baseType: !40, size: 64, offset: 960)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "co_qualname", scope: !444, file: !445, line: 115, baseType: !40, size: 64, offset: 1024)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "co_linetable", scope: !444, file: !445, line: 115, baseType: !40, size: 64, offset: 1088)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !444, file: !445, line: 115, baseType: !40, size: 64, offset: 1152)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "co_executors", scope: !444, file: !445, line: 115, baseType: !471, size: 64, offset: 1216)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyExecutorArray", file: !445, line: 22, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !445, line: 18, size: 128, elements: !474)
!474 = !{!475, !476, !477}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !473, file: !445, line: 19, baseType: !7, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !473, file: !445, line: 20, baseType: !7, size: 32, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "executors", scope: !473, file: !445, line: 21, baseType: !478, size: 64, offset: 64)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 64, elements: !412)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyExecutorObject", file: !445, line: 21, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_co_cached", scope: !444, file: !445, line: 115, baseType: !482, size: 64, offset: 1280)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyCoCached", file: !445, line: 16, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !445, line: 11, size: 256, elements: !485)
!485 = !{!486, !487, !488, !489}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_co_code", scope: !484, file: !445, line: 12, baseType: !40, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_co_varnames", scope: !484, file: !445, line: 13, baseType: !40, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_co_cellvars", scope: !484, file: !445, line: 14, baseType: !40, size: 64, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_co_freevars", scope: !484, file: !445, line: 15, baseType: !40, size: 64, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_co_instrumentation_version", scope: !444, file: !445, line: 115, baseType: !407, size: 64, offset: 1344)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_co_monitoring", scope: !444, file: !445, line: 115, baseType: !492, size: 64, offset: 1408)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyCoMonitoringData", file: !445, line: 115, flags: DIFlagFwdDecl)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_co_unique_id", scope: !444, file: !445, line: 115, baseType: !75, size: 64, offset: 1472)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_co_firsttraceable", scope: !444, file: !445, line: 115, baseType: !7, size: 32, offset: 1536)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "co_extra", scope: !444, file: !445, line: 115, baseType: !39, size: 64, offset: 1600)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "co_code_adaptive", scope: !444, file: !445, line: 115, baseType: !498, size: 8, offset: 1664)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, elements: !412)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "code_line", scope: !438, file: !437, line: 1718, baseType: !7, size: 32, offset: 64)
!500 = !{!0, !501, !506, !508, !513, !543, !546, !551, !556, !561, !566, !568, !570, !572, !577, !582, !584, !590, !595, !597, !602, !629, !631, !636, !641, !644, !646, !651, !655, !660, !662, !664, !669, !674, !679, !681, !683, !685, !690, !692, !694, !696, !701, !706, !711, !716, !721, !723, !725, !727, !732, !734, !737, !739, !741, !746, !748, !753}
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(scope: null, file: !437, line: 3513, type: !503, isLocal: true, isDefinition: true)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, elements: !504)
!504 = !{!505}
!505 = !DISubrange(count: 16)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !437, line: 3520, type: !498, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !437, line: 2107, type: !510, isLocal: true, isDefinition: true)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 72, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 9)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "__pyx_moduledef", scope: !2, file: !437, line: 2103, type: !515, isLocal: true, isDefinition: true)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !516, line: 107, size: 832, elements: !517)
!516 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/moduleobject.h", directory: "")
!517 = !{!518, !529, !530, !531, !532, !533, !540, !541, !542}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !515, file: !516, line: 108, baseType: !519, size: 320)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !516, line: 58, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !516, line: 39, size: 320, elements: !521)
!521 = !{!522, !523, !527, !528}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !520, file: !516, line: 40, baseType: !41, size: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !520, file: !516, line: 47, baseType: !524, size: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!40}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !520, file: !516, line: 52, baseType: !75, size: 64, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !520, file: !516, line: 57, baseType: !40, size: 64, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !515, file: !516, line: 109, baseType: !18, size: 64, offset: 320)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !515, file: !516, line: 110, baseType: !18, size: 64, offset: 384)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !515, file: !516, line: 111, baseType: !75, size: 64, offset: 448)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !515, file: !516, line: 112, baseType: !285, size: 64, offset: 512)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "m_slots", scope: !515, file: !516, line: 113, baseType: !534, size: 64, offset: 576)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Slot", file: !42, line: 13, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Slot", file: !516, line: 69, size: 128, elements: !537)
!537 = !{!538, !539}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !536, file: !516, line: 70, baseType: !7, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !536, file: !516, line: 71, baseType: !39, size: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !515, file: !516, line: 114, baseType: !265, size: 64, offset: 640)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !515, file: !516, line: 115, baseType: !145, size: 64, offset: 704)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !515, file: !516, line: 116, baseType: !344, size: 64, offset: 768)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "__pyx_methods", scope: !2, file: !437, line: 2002, type: !545, isLocal: true, isDefinition: true)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 256, elements: !412)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "__pyx_moduledef_slots", scope: !2, file: !437, line: 2086, type: !548, isLocal: true, isDefinition: true)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !535, size: 384, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 3)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !437, line: 2235, type: !553, isLocal: true, isDefinition: true)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 40, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 5)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !437, line: 2242, type: !558, isLocal: true, isDefinition: true)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 56, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 7)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !437, line: 2242, type: !563, isLocal: true, isDefinition: true)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 88, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 11)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !437, line: 2243, type: !558, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !437, line: 2243, type: !510, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !437, line: 2244, type: !558, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !437, line: 2244, type: !574, isLocal: true, isDefinition: true)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 96, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 12)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !437, line: 2245, type: !579, isLocal: true, isDefinition: true)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 216, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 27)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(scope: null, file: !437, line: 2245, type: !510, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "main_interpreter_id", scope: !586, file: !437, line: 2182, type: !49, isLocal: true, isDefinition: true)
!586 = distinct !DISubprogram(name: "__Pyx_check_single_interpreter", scope: !437, file: !437, line: 2181, type: !587, scopeLine: 2181, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !589)
!587 = !DISubroutineType(types: !588)
!588 = !{!7}
!589 = !{}
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(scope: null, file: !437, line: 2204, type: !592, isLocal: true, isDefinition: true)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 760, elements: !593)
!593 = !{!594}
!594 = !DISubrange(count: 95)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "__pyx_m", scope: !2, file: !437, line: 1326, type: !40, isLocal: true, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(scope: null, file: !437, line: 2275, type: !599, isLocal: true, isDefinition: true)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 648, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 81)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "__pyx_mstate_global", scope: !2, file: !437, line: 1941, type: !604, isLocal: true, isDefinition: true)
!604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pyx_mstatetype", file: !437, line: 1920, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !437, line: 1906, size: 1536, elements: !608)
!608 = !{!609, !610, !611, !612, !613, !614, !615, !619, !623}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_d", scope: !607, file: !437, line: 1907, baseType: !40, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_b", scope: !607, file: !437, line: 1908, baseType: !40, size: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_cython_runtime", scope: !607, file: !437, line: 1909, baseType: !40, size: 64, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_tuple", scope: !607, file: !437, line: 1910, baseType: !40, size: 64, offset: 192)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_bytes", scope: !607, file: !437, line: 1911, baseType: !40, size: 64, offset: 256)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_unicode", scope: !607, file: !437, line: 1912, baseType: !40, size: 64, offset: 320)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_string_tab", scope: !607, file: !437, line: 1913, baseType: !616, size: 896, offset: 384)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 896, elements: !617)
!617 = !{!618}
!618 = !DISubrange(count: 14)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_number_tab", scope: !607, file: !437, line: 1914, baseType: !620, size: 128, offset: 1280)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 128, elements: !621)
!621 = !{!622}
!622 = !DISubrange(count: 2)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_code_cache", scope: !607, file: !437, line: 1917, baseType: !624, size: 128, offset: 1408)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__Pyx_CodeObjectCache", file: !437, line: 1720, size: 128, elements: !625)
!625 = !{!626, !627, !628}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !624, file: !437, line: 1721, baseType: !7, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "max_count", scope: !624, file: !437, line: 1722, baseType: !7, size: 32, offset: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !624, file: !437, line: 1723, baseType: !435, size: 64, offset: 64)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !437, line: 2305, type: !510, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !437, line: 2306, type: !633, isLocal: true, isDefinition: true)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 120, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 15)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !437, line: 2307, type: !638, isLocal: true, isDefinition: true)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 104, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 13)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !437, line: 2478, type: !643, isLocal: true, isDefinition: true)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 112, elements: !617)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "__pyx_mstate_global_static", scope: !2, file: !437, line: 1935, type: !606, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !437, line: 1336, type: !648, isLocal: true, isDefinition: true)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 432, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 54)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "__pyx_f", scope: !2, file: !437, line: 1335, type: !653, isLocal: true, isDefinition: true)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !654, size: 64, elements: !412)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(scope: null, file: !437, line: 4376, type: !657, isLocal: true, isDefinition: true)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 624, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 78)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !437, line: 4382, type: !633, isLocal: true, isDefinition: true)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !437, line: 4382, type: !633, isLocal: true, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !437, line: 2528, type: !666, isLocal: true, isDefinition: true)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 720, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 90)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(scope: null, file: !437, line: 4392, type: !671, isLocal: true, isDefinition: true)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 136, elements: !672)
!672 = !{!673}
!673 = !DISubrange(count: 17)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(scope: null, file: !437, line: 4392, type: !676, isLocal: true, isDefinition: true)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 32, elements: !677)
!677 = !{!678}
!678 = !DISubrange(count: 4)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !437, line: 4392, type: !553, isLocal: true, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(scope: null, file: !437, line: 4393, type: !563, isLocal: true, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(scope: null, file: !437, line: 4397, type: !676, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !437, line: 4444, type: !687, isLocal: true, isDefinition: true)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1224, elements: !688)
!688 = !{!689}
!689 = !DISubrange(count: 153)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(name: "__pyx_filename", scope: !2, file: !437, line: 1331, type: !18, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(name: "__pyx_lineno", scope: !2, file: !437, line: 1328, type: !7, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "__pyx_clineno", scope: !2, file: !437, line: 1329, type: !7, isLocal: true, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(scope: null, file: !437, line: 2780, type: !698, isLocal: true, isDefinition: true)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 200, elements: !699)
!699 = !{!700}
!700 = !DISubrange(count: 25)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !437, line: 2812, type: !703, isLocal: true, isDefinition: true)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 248, elements: !704)
!704 = !{!705}
!705 = !DISubrange(count: 31)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !437, line: 2819, type: !708, isLocal: true, isDefinition: true)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 344, elements: !709)
!709 = !{!710}
!710 = !DISubrange(count: 43)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(scope: null, file: !437, line: 2857, type: !713, isLocal: true, isDefinition: true)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 224, elements: !714)
!714 = !{!715}
!715 = !DISubrange(count: 28)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(scope: null, file: !437, line: 2857, type: !718, isLocal: true, isDefinition: true)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 80, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 10)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(scope: null, file: !437, line: 2857, type: !579, isLocal: true, isDefinition: true)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !437, line: 2859, type: !563, isLocal: true, isDefinition: true)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "__pyx_builtin_input", scope: !2, file: !437, line: 1889, type: !40, isLocal: true, isDefinition: true)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(scope: null, file: !417, line: 16, type: !729, isLocal: true, isDefinition: true)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 144, elements: !730)
!730 = !{!731}
!731 = !DISubrange(count: 18)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !417, line: 16, type: !643, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !417, line: 16, type: !736, isLocal: true, isDefinition: true)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 144, elements: !730)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "__pyx_builtin_print", scope: !2, file: !437, line: 1890, type: !40, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !437, line: 3388, type: !563, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !437, line: 1330, type: !743, isLocal: true, isDefinition: true)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 944, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 118)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "__pyx_cfilenm", scope: !2, file: !437, line: 1330, type: !654, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !437, line: 2682, type: !750, isLocal: true, isDefinition: true)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 192, elements: !751)
!751 = !{!752}
!752 = !DISubrange(count: 24)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !437, line: 2682, type: !755, isLocal: true, isDefinition: true)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 560, elements: !756)
!756 = !{!757}
!757 = !DISubrange(count: 70)
!758 = !{i32 2, !"SDK Version", [2 x i32] [i32 14, i32 4]}
!759 = !{i32 7, !"Dwarf Version", i32 4}
!760 = !{i32 2, !"Debug Info Version", i32 3}
!761 = !{i32 1, !"wchar_size", i32 4}
!762 = !{i32 8, !"PIC Level", i32 2}
!763 = !{i32 7, !"uwtable", i32 1}
!764 = !{i32 7, !"frame-pointer", i32 1}
!765 = !{!"Homebrew clang version 20.1.8"}
!766 = distinct !DISubprogram(name: "PyInit_original", scope: !437, file: !437, line: 2146, type: !525, scopeLine: 2148, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2)
!767 = !DILocation(line: 2149, column: 10, scope: !766)
!768 = !DILocation(line: 2149, column: 3, scope: !766)
!769 = distinct !DISubprogram(name: "main", scope: !437, file: !437, line: 3502, type: !770, scopeLine: 3503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !589)
!770 = !DISubroutineType(types: !771)
!771 = !{!7, !7, !772}
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!773 = !DILocalVariable(name: "argc", arg: 1, scope: !769, file: !437, line: 3502, type: !7)
!774 = !DILocation(line: 3502, column: 10, scope: !769)
!775 = !DILocalVariable(name: "argv", arg: 2, scope: !769, file: !437, line: 3502, type: !772)
!776 = !DILocation(line: 3502, column: 23, scope: !769)
!777 = !DILocation(line: 3504, column: 10, scope: !778)
!778 = distinct !DILexicalBlock(scope: !769, file: !437, line: 3504, column: 9)
!779 = !DILocation(line: 3504, column: 9, scope: !778)
!780 = !DILocation(line: 3505, column: 16, scope: !781)
!781 = distinct !DILexicalBlock(scope: !778, file: !437, line: 3504, column: 16)
!782 = !DILocation(line: 3505, column: 9, scope: !781)
!783 = !DILocalVariable(name: "i", scope: !784, file: !437, line: 3508, type: !7)
!784 = distinct !DILexicalBlock(scope: !778, file: !437, line: 3507, column: 10)
!785 = !DILocation(line: 3508, column: 13, scope: !784)
!786 = !DILocalVariable(name: "res", scope: !784, file: !437, line: 3508, type: !7)
!787 = !DILocation(line: 3508, column: 16, scope: !784)
!788 = !DILocalVariable(name: "argv_copy", scope: !784, file: !437, line: 3509, type: !29)
!789 = !DILocation(line: 3509, column: 19, scope: !784)
!790 = !DILocation(line: 3509, column: 78, scope: !784)
!791 = !DILocation(line: 3509, column: 69, scope: !784)
!792 = !DILocation(line: 3509, column: 67, scope: !784)
!793 = !DILocation(line: 3509, column: 43, scope: !784)
!794 = !DILocalVariable(name: "argv_copy2", scope: !784, file: !437, line: 3510, type: !29)
!795 = !DILocation(line: 3510, column: 19, scope: !784)
!796 = !DILocation(line: 3510, column: 79, scope: !784)
!797 = !DILocation(line: 3510, column: 70, scope: !784)
!798 = !DILocation(line: 3510, column: 68, scope: !784)
!799 = !DILocation(line: 3510, column: 44, scope: !784)
!800 = !DILocalVariable(name: "oldloc", scope: !784, file: !437, line: 3511, type: !95)
!801 = !DILocation(line: 3511, column: 15, scope: !784)
!802 = !DILocation(line: 3511, column: 31, scope: !784)
!803 = !DILocation(line: 3511, column: 24, scope: !784)
!804 = !DILocation(line: 3512, column: 14, scope: !805)
!805 = distinct !DILexicalBlock(scope: !784, file: !437, line: 3512, column: 13)
!806 = !DILocation(line: 3512, column: 24, scope: !805)
!807 = !DILocation(line: 3512, column: 28, scope: !805)
!808 = !DILocation(line: 3512, column: 39, scope: !805)
!809 = !DILocation(line: 3512, column: 43, scope: !805)
!810 = !DILocation(line: 3513, column: 21, scope: !811)
!811 = distinct !DILexicalBlock(scope: !805, file: !437, line: 3512, column: 51)
!812 = !DILocation(line: 3513, column: 13, scope: !811)
!813 = !DILocation(line: 3514, column: 18, scope: !811)
!814 = !DILocation(line: 3514, column: 13, scope: !811)
!815 = !DILocation(line: 3515, column: 18, scope: !811)
!816 = !DILocation(line: 3515, column: 13, scope: !811)
!817 = !DILocation(line: 3516, column: 18, scope: !811)
!818 = !DILocation(line: 3516, column: 13, scope: !811)
!819 = !DILocation(line: 3517, column: 13, scope: !811)
!820 = !DILocation(line: 3519, column: 13, scope: !784)
!821 = !DILocation(line: 3520, column: 9, scope: !784)
!822 = !DILocation(line: 3521, column: 16, scope: !823)
!823 = distinct !DILexicalBlock(scope: !784, file: !437, line: 3521, column: 9)
!824 = !DILocation(line: 3521, column: 14, scope: !823)
!825 = !DILocation(line: 3521, column: 21, scope: !826)
!826 = distinct !DILexicalBlock(scope: !823, file: !437, line: 3521, column: 9)
!827 = !DILocation(line: 3521, column: 25, scope: !826)
!828 = !DILocation(line: 3521, column: 23, scope: !826)
!829 = !DILocation(line: 3521, column: 9, scope: !823)
!830 = !DILocation(line: 3522, column: 60, scope: !831)
!831 = distinct !DILexicalBlock(scope: !826, file: !437, line: 3521, column: 36)
!832 = !DILocation(line: 3522, column: 65, scope: !831)
!833 = !DILocation(line: 3522, column: 44, scope: !831)
!834 = !DILocation(line: 3522, column: 29, scope: !831)
!835 = !DILocation(line: 3522, column: 39, scope: !831)
!836 = !DILocation(line: 3522, column: 42, scope: !831)
!837 = !DILocation(line: 3522, column: 13, scope: !831)
!838 = !DILocation(line: 3522, column: 24, scope: !831)
!839 = !DILocation(line: 3522, column: 27, scope: !831)
!840 = !DILocation(line: 3523, column: 18, scope: !841)
!841 = distinct !DILexicalBlock(scope: !831, file: !437, line: 3523, column: 17)
!842 = !DILocation(line: 3523, column: 28, scope: !841)
!843 = !DILocation(line: 3523, column: 17, scope: !841)
!844 = !DILocation(line: 3523, column: 36, scope: !841)
!845 = !DILocation(line: 3523, column: 32, scope: !841)
!846 = !DILocation(line: 3524, column: 9, scope: !831)
!847 = !DILocation(line: 3521, column: 32, scope: !826)
!848 = !DILocation(line: 3521, column: 9, scope: !826)
!849 = distinct !{!849, !829, !850, !851}
!850 = !DILocation(line: 3524, column: 9, scope: !823)
!851 = !{!"llvm.loop.mustprogress"}
!852 = !DILocation(line: 3525, column: 27, scope: !784)
!853 = !DILocation(line: 3525, column: 9, scope: !784)
!854 = !DILocation(line: 3526, column: 14, scope: !784)
!855 = !DILocation(line: 3526, column: 9, scope: !784)
!856 = !DILocation(line: 3527, column: 13, scope: !857)
!857 = distinct !DILexicalBlock(scope: !784, file: !437, line: 3527, column: 13)
!858 = !DILocation(line: 3527, column: 17, scope: !857)
!859 = !DILocation(line: 3528, column: 30, scope: !857)
!860 = !DILocation(line: 3528, column: 36, scope: !857)
!861 = !DILocation(line: 3528, column: 19, scope: !857)
!862 = !DILocation(line: 3528, column: 17, scope: !857)
!863 = !DILocation(line: 3528, column: 13, scope: !857)
!864 = !DILocation(line: 3529, column: 16, scope: !865)
!865 = distinct !DILexicalBlock(scope: !784, file: !437, line: 3529, column: 9)
!866 = !DILocation(line: 3529, column: 14, scope: !865)
!867 = !DILocation(line: 3529, column: 21, scope: !868)
!868 = distinct !DILexicalBlock(scope: !865, file: !437, line: 3529, column: 9)
!869 = !DILocation(line: 3529, column: 25, scope: !868)
!870 = !DILocation(line: 3529, column: 23, scope: !868)
!871 = !DILocation(line: 3529, column: 9, scope: !865)
!872 = !DILocation(line: 3530, column: 27, scope: !873)
!873 = distinct !DILexicalBlock(scope: !868, file: !437, line: 3529, column: 36)
!874 = !DILocation(line: 3530, column: 38, scope: !873)
!875 = !DILocation(line: 3530, column: 13, scope: !873)
!876 = !DILocation(line: 3531, column: 9, scope: !873)
!877 = !DILocation(line: 3529, column: 32, scope: !868)
!878 = !DILocation(line: 3529, column: 9, scope: !868)
!879 = distinct !{!879, !871, !880, !851}
!880 = !DILocation(line: 3531, column: 9, scope: !865)
!881 = !DILocation(line: 3532, column: 14, scope: !784)
!882 = !DILocation(line: 3532, column: 9, scope: !784)
!883 = !DILocation(line: 3533, column: 14, scope: !784)
!884 = !DILocation(line: 3533, column: 9, scope: !784)
!885 = !DILocation(line: 3534, column: 16, scope: !784)
!886 = !DILocation(line: 3534, column: 9, scope: !784)
!887 = !DILocation(line: 3536, column: 1, scope: !769)
!888 = distinct !DISubprogram(name: "__Pyx_main", scope: !437, file: !437, line: 3447, type: !889, scopeLine: 3449, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !589)
!889 = !DISubroutineType(types: !890)
!890 = !{!7, !7, !29}
!891 = !DILocalVariable(name: "argc", arg: 1, scope: !888, file: !437, line: 3447, type: !7)
!892 = !DILocation(line: 3447, column: 27, scope: !888)
!893 = !DILocalVariable(name: "argv", arg: 2, scope: !888, file: !437, line: 3447, type: !29)
!894 = !DILocation(line: 3447, column: 43, scope: !888)
!895 = !DILocation(line: 3460, column: 9, scope: !896)
!896 = distinct !DILexicalBlock(scope: !888, file: !437, line: 3460, column: 9)
!897 = !DILocation(line: 3460, column: 61, scope: !896)
!898 = !DILocation(line: 3460, column: 66, scope: !896)
!899 = !DILocalVariable(name: "status", scope: !900, file: !437, line: 3462, type: !901)
!900 = distinct !DILexicalBlock(scope: !888, file: !437, line: 3461, column: 5)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyStatus", file: !13, line: 19, baseType: !14)
!902 = !DILocation(line: 3462, column: 18, scope: !900)
!903 = !DILocalVariable(name: "config", scope: !900, file: !437, line: 3463, type: !904)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyConfig", file: !13, line: 244, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyConfig", file: !13, line: 134, size: 3648, elements: !906)
!906 = !{!907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_config_init", scope: !905, file: !13, line: 135, baseType: !7, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "isolated", scope: !905, file: !13, line: 137, baseType: !7, size: 32, offset: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "use_environment", scope: !905, file: !13, line: 138, baseType: !7, size: 32, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "dev_mode", scope: !905, file: !13, line: 139, baseType: !7, size: 32, offset: 96)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "install_signal_handlers", scope: !905, file: !13, line: 140, baseType: !7, size: 32, offset: 128)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "use_hash_seed", scope: !905, file: !13, line: 141, baseType: !7, size: 32, offset: 160)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "hash_seed", scope: !905, file: !13, line: 142, baseType: !38, size: 64, offset: 192)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "faulthandler", scope: !905, file: !13, line: 143, baseType: !7, size: 32, offset: 256)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "tracemalloc", scope: !905, file: !13, line: 144, baseType: !7, size: 32, offset: 288)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "perf_profiling", scope: !905, file: !13, line: 145, baseType: !7, size: 32, offset: 320)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "remote_debug", scope: !905, file: !13, line: 146, baseType: !7, size: 32, offset: 352)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "import_time", scope: !905, file: !13, line: 147, baseType: !7, size: 32, offset: 384)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "code_debug_ranges", scope: !905, file: !13, line: 148, baseType: !7, size: 32, offset: 416)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "show_ref_count", scope: !905, file: !13, line: 149, baseType: !7, size: 32, offset: 448)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "dump_refs", scope: !905, file: !13, line: 150, baseType: !7, size: 32, offset: 480)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "dump_refs_file", scope: !905, file: !13, line: 151, baseType: !30, size: 64, offset: 512)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_stats", scope: !905, file: !13, line: 152, baseType: !7, size: 32, offset: 576)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "filesystem_encoding", scope: !905, file: !13, line: 153, baseType: !30, size: 64, offset: 640)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "filesystem_errors", scope: !905, file: !13, line: 154, baseType: !30, size: 64, offset: 704)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "pycache_prefix", scope: !905, file: !13, line: 155, baseType: !30, size: 64, offset: 768)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "parse_argv", scope: !905, file: !13, line: 156, baseType: !7, size: 32, offset: 832)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "orig_argv", scope: !905, file: !13, line: 157, baseType: !929, size: 128, offset: 896)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyWideStringList", file: !13, line: 36, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 31, size: 128, elements: !931)
!931 = !{!932, !933}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !930, file: !13, line: 34, baseType: !75, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !930, file: !13, line: 35, baseType: !29, size: 64, offset: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !905, file: !13, line: 158, baseType: !929, size: 128, offset: 1024)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "xoptions", scope: !905, file: !13, line: 159, baseType: !929, size: 128, offset: 1152)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "warnoptions", scope: !905, file: !13, line: 160, baseType: !929, size: 128, offset: 1280)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "site_import", scope: !905, file: !13, line: 161, baseType: !7, size: 32, offset: 1408)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_warning", scope: !905, file: !13, line: 162, baseType: !7, size: 32, offset: 1440)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "warn_default_encoding", scope: !905, file: !13, line: 163, baseType: !7, size: 32, offset: 1472)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "inspect", scope: !905, file: !13, line: 164, baseType: !7, size: 32, offset: 1504)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !905, file: !13, line: 165, baseType: !7, size: 32, offset: 1536)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "optimization_level", scope: !905, file: !13, line: 166, baseType: !7, size: 32, offset: 1568)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "parser_debug", scope: !905, file: !13, line: 167, baseType: !7, size: 32, offset: 1600)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "write_bytecode", scope: !905, file: !13, line: 168, baseType: !7, size: 32, offset: 1632)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !905, file: !13, line: 169, baseType: !7, size: 32, offset: 1664)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !905, file: !13, line: 170, baseType: !7, size: 32, offset: 1696)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "user_site_directory", scope: !905, file: !13, line: 171, baseType: !7, size: 32, offset: 1728)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "configure_c_stdio", scope: !905, file: !13, line: 172, baseType: !7, size: 32, offset: 1760)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "buffered_stdio", scope: !905, file: !13, line: 173, baseType: !7, size: 32, offset: 1792)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "stdio_encoding", scope: !905, file: !13, line: 174, baseType: !30, size: 64, offset: 1856)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "stdio_errors", scope: !905, file: !13, line: 175, baseType: !30, size: 64, offset: 1920)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "check_hash_pycs_mode", scope: !905, file: !13, line: 179, baseType: !30, size: 64, offset: 1984)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "use_frozen_modules", scope: !905, file: !13, line: 180, baseType: !7, size: 32, offset: 2048)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "safe_path", scope: !905, file: !13, line: 181, baseType: !7, size: 32, offset: 2080)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "int_max_str_digits", scope: !905, file: !13, line: 182, baseType: !7, size: 32, offset: 2112)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "thread_inherit_context", scope: !905, file: !13, line: 183, baseType: !7, size: 32, offset: 2144)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "context_aware_warnings", scope: !905, file: !13, line: 184, baseType: !7, size: 32, offset: 2176)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "use_system_logger", scope: !905, file: !13, line: 186, baseType: !7, size: 32, offset: 2208)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_count", scope: !905, file: !13, line: 189, baseType: !7, size: 32, offset: 2240)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "pathconfig_warnings", scope: !905, file: !13, line: 196, baseType: !7, size: 32, offset: 2272)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "program_name", scope: !905, file: !13, line: 197, baseType: !30, size: 64, offset: 2304)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "pythonpath_env", scope: !905, file: !13, line: 198, baseType: !30, size: 64, offset: 2368)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "home", scope: !905, file: !13, line: 199, baseType: !30, size: 64, offset: 2432)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "platlibdir", scope: !905, file: !13, line: 200, baseType: !30, size: 64, offset: 2496)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "module_search_paths_set", scope: !905, file: !13, line: 203, baseType: !7, size: 32, offset: 2560)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "module_search_paths", scope: !905, file: !13, line: 204, baseType: !929, size: 128, offset: 2624)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "stdlib_dir", scope: !905, file: !13, line: 205, baseType: !30, size: 64, offset: 2752)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "executable", scope: !905, file: !13, line: 206, baseType: !30, size: 64, offset: 2816)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "base_executable", scope: !905, file: !13, line: 207, baseType: !30, size: 64, offset: 2880)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !905, file: !13, line: 208, baseType: !30, size: 64, offset: 2944)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "base_prefix", scope: !905, file: !13, line: 209, baseType: !30, size: 64, offset: 3008)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "exec_prefix", scope: !905, file: !13, line: 210, baseType: !30, size: 64, offset: 3072)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "base_exec_prefix", scope: !905, file: !13, line: 211, baseType: !30, size: 64, offset: 3136)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "skip_source_first_line", scope: !905, file: !13, line: 214, baseType: !7, size: 32, offset: 3200)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "run_command", scope: !905, file: !13, line: 215, baseType: !30, size: 64, offset: 3264)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "run_module", scope: !905, file: !13, line: 216, baseType: !30, size: 64, offset: 3328)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "run_filename", scope: !905, file: !13, line: 217, baseType: !30, size: 64, offset: 3392)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "sys_path_0", scope: !905, file: !13, line: 220, baseType: !30, size: 64, offset: 3456)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_install_importlib", scope: !905, file: !13, line: 226, baseType: !7, size: 32, offset: 3520)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_init_main", scope: !905, file: !13, line: 229, baseType: !7, size: 32, offset: 3552)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_is_python_build", scope: !905, file: !13, line: 232, baseType: !7, size: 32, offset: 3584)
!982 = !DILocation(line: 3463, column: 18, scope: !900)
!983 = !DILocation(line: 3464, column: 9, scope: !900)
!984 = !DILocation(line: 3465, column: 16, scope: !900)
!985 = !DILocation(line: 3465, column: 27, scope: !900)
!986 = !DILocation(line: 3466, column: 13, scope: !987)
!987 = distinct !DILexicalBlock(scope: !900, file: !437, line: 3466, column: 13)
!988 = !DILocation(line: 3466, column: 18, scope: !987)
!989 = !DILocation(line: 3466, column: 21, scope: !987)
!990 = !DILocation(line: 3467, column: 58, scope: !991)
!991 = distinct !DILexicalBlock(scope: !987, file: !437, line: 3466, column: 27)
!992 = !DILocation(line: 3467, column: 72, scope: !991)
!993 = !DILocation(line: 3467, column: 22, scope: !991)
!994 = !DILocation(line: 3468, column: 17, scope: !995)
!995 = distinct !DILexicalBlock(scope: !991, file: !437, line: 3468, column: 17)
!996 = !DILocation(line: 3469, column: 17, scope: !997)
!997 = distinct !DILexicalBlock(scope: !995, file: !437, line: 3468, column: 45)
!998 = !DILocation(line: 3470, column: 17, scope: !997)
!999 = !DILocation(line: 3472, column: 48, scope: !991)
!1000 = !DILocation(line: 3472, column: 54, scope: !991)
!1001 = !DILocation(line: 3472, column: 22, scope: !991)
!1002 = !DILocation(line: 3473, column: 17, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !991, file: !437, line: 3473, column: 17)
!1004 = !DILocation(line: 3474, column: 17, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !1003, file: !437, line: 3473, column: 45)
!1006 = !DILocation(line: 3475, column: 17, scope: !1005)
!1007 = !DILocation(line: 3477, column: 9, scope: !991)
!1008 = !DILocation(line: 3478, column: 18, scope: !900)
!1009 = !DILocation(line: 3479, column: 13, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !900, file: !437, line: 3479, column: 13)
!1011 = !DILocation(line: 3480, column: 13, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !1010, file: !437, line: 3479, column: 41)
!1013 = !DILocation(line: 3481, column: 13, scope: !1012)
!1014 = !DILocation(line: 3483, column: 9, scope: !900)
!1015 = !DILocalVariable(name: "m", scope: !1016, file: !437, line: 3486, type: !40)
!1016 = distinct !DILexicalBlock(scope: !888, file: !437, line: 3485, column: 5)
!1017 = !DILocation(line: 3486, column: 17, scope: !1016)
!1018 = !DILocation(line: 3487, column: 37, scope: !1016)
!1019 = !DILocation(line: 3488, column: 11, scope: !1016)
!1020 = !DILocation(line: 3488, column: 9, scope: !1016)
!1021 = !DILocation(line: 3489, column: 12, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1016, file: !437, line: 3489, column: 11)
!1023 = !DILocation(line: 3489, column: 14, scope: !1022)
!1024 = !DILocation(line: 3489, column: 17, scope: !1022)
!1025 = !DILocation(line: 3490, column: 11, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1022, file: !437, line: 3489, column: 35)
!1027 = !DILocation(line: 3491, column: 11, scope: !1026)
!1028 = !DILocation(line: 3493, column: 7, scope: !1016)
!1029 = !DILocation(line: 3495, column: 9, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !888, file: !437, line: 3495, column: 9)
!1031 = !DILocation(line: 3495, column: 25, scope: !1030)
!1032 = !DILocation(line: 3496, column: 9, scope: !1030)
!1033 = !DILocation(line: 3497, column: 5, scope: !888)
!1034 = !DILocation(line: 3498, column: 1, scope: !888)
!1035 = distinct !DISubprogram(name: "__pyx_pymod_create", scope: !437, file: !437, line: 2226, type: !1036, scopeLine: 2226, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !589)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!40, !40, !1038}
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef", file: !42, line: 12, baseType: !515)
!1040 = !DILocalVariable(name: "spec", arg: 1, scope: !1035, file: !437, line: 2226, type: !40)
!1041 = !DILocation(line: 2226, column: 65, scope: !1035)
!1042 = !DILocalVariable(name: "def", arg: 2, scope: !1035, file: !437, line: 2226, type: !1038)
!1043 = !DILocation(line: 2226, column: 84, scope: !1035)
!1044 = !DILocalVariable(name: "module", scope: !1035, file: !437, line: 2227, type: !40)
!1045 = !DILocation(line: 2227, column: 15, scope: !1035)
!1046 = !DILocalVariable(name: "moddict", scope: !1035, file: !437, line: 2227, type: !40)
!1047 = !DILocation(line: 2227, column: 31, scope: !1035)
!1048 = !DILocalVariable(name: "modname", scope: !1035, file: !437, line: 2227, type: !40)
!1049 = !DILocation(line: 2227, column: 41, scope: !1035)
!1050 = !DILocation(line: 2228, column: 5, scope: !1035)
!1051 = !DILocation(line: 2230, column: 9, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1035, file: !437, line: 2230, column: 9)
!1053 = !DILocation(line: 2231, column: 9, scope: !1052)
!1054 = !DILocation(line: 2233, column: 9, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1035, file: !437, line: 2233, column: 9)
!1056 = !DILocation(line: 2234, column: 29, scope: !1055)
!1057 = !DILocation(line: 2234, column: 16, scope: !1055)
!1058 = !DILocation(line: 2234, column: 9, scope: !1055)
!1059 = !DILocation(line: 2235, column: 38, scope: !1035)
!1060 = !DILocation(line: 2235, column: 15, scope: !1035)
!1061 = !DILocation(line: 2235, column: 13, scope: !1035)
