; ModuleID = 'dataset/cases/goeq-ojva-0130/artifacts/cython-clang-llvm-o0-embed-v1/prog_a/program.c'
source_filename = "dataset/cases/goeq-ojva-0130/artifacts/cython-clang-llvm-o0-embed-v1/prog_a/program.c"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx14.0.0"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr }
%struct.PyModuleDef_Base = type { %struct._object, ptr, i64, ptr }
%struct._object = type { %union.anon, ptr }
%union.anon = type { i64 }
%struct.PyMethodDef = type { ptr, ptr, i32, ptr }
%struct.__pyx_mstatetype = type { ptr, ptr, ptr, ptr, ptr, ptr, [14 x ptr], [2 x ptr], %struct.__Pyx_CodeObjectCache }
%struct.__Pyx_CodeObjectCache = type { i32, i32, ptr }
%struct._typeobject = type { %struct.PyVarObject, ptr, i64, i64, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, ptr, i8, i16 }
%struct.PyVarObject = type { %struct._object, i64 }
%struct.anon.1 = type { i8, [3 x i8] }
%struct.PyStatus = type { i32, ptr, ptr, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__pyx_module_is_main_original", scope: !2, file: !498, line: 2040, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Homebrew clang version 20.1.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !34, globals: !560, splitDebugInlining: false, nameTableKind: Apple, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk", sdk: "MacOSX14.sdk")
!3 = !DIFile(filename: "dataset/cases/goeq-ojva-0130/artifacts/cython-clang-llvm-o0-embed-v1/prog_a/program.c", directory: ".")
!4 = !{!5, !12, !19}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 695, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/object.h", directory: "")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "PYGEN_RETURN", value: 0)
!10 = !DIEnumerator(name: "PYGEN_ERROR", value: -1)
!11 = !DIEnumerator(name: "PYGEN_NEXT", value: 1)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !13, line: 245, baseType: !14, size: 32, elements: !15)
!13 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/unicodeobject.h", directory: "")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16, !17, !18}
!16 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!17 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!18 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !21, file: !20, line: 11, baseType: !14, size: 32, elements: !30)
!20 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/initconfig.h", directory: "")
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !20, line: 10, size: 256, elements: !22)
!22 = !{!23, !24, !28, !29}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_type", scope: !21, file: !20, line: 15, baseType: !19, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !21, file: !20, line: 16, baseType: !25, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!27 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "err_msg", scope: !21, file: !20, line: 17, baseType: !25, size: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "exitcode", scope: !21, file: !20, line: 18, baseType: !7, size: 32, offset: 192)
!30 = !{!31, !32, !33}
!31 = !DIEnumerator(name: "_PyStatus_TYPE_OK", value: 0)
!32 = !DIEnumerator(name: "_PyStatus_TYPE_ERROR", value: 1)
!33 = !DIEnumerator(name: "_PyStatus_TYPE_EXIT", value: 2)
!34 = !{!35, !41, !45, !46, !373, !7, !25, !101, !375, !386, !397, !413, !81, !414, !429, !436, !438, !445, !466, !468, !470, !27, !472, !473, !86, !483, !496}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !38, line: 34, baseType: !39)
!38 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_wchar_t.h", directory: "")
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wchar_t", file: !40, line: 82, baseType: !7)
!40 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/arm/_types.h", directory: "")
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !42, line: 31, baseType: !43)
!42 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !40, line: 70, baseType: !44)
!44 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !48, line: 18, baseType: !49)
!48 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pytypedefs.h", directory: "")
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !6, line: 110, size: 128, elements: !50)
!50 = !{!51, !69}
!51 = !DIDerivedType(tag: DW_TAG_member, scope: !49, file: !6, line: 122, baseType: !52, size: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !49, file: !6, line: 122, size: 64, elements: !53)
!53 = !{!54, !58}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt_full", scope: !52, file: !6, line: 124, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !56, line: 30, baseType: !57)
!56 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_int64_t.h", directory: "")
!57 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, scope: !52, file: !6, line: 125, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !52, file: !6, line: 125, size: 64, elements: !60)
!60 = !{!61, !64, !68}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !59, file: !6, line: 131, baseType: !62, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !63, line: 31, baseType: !14)
!63 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint32_t.h", directory: "")
!64 = !DIDerivedType(tag: DW_TAG_member, name: "ob_overflow", scope: !59, file: !6, line: 132, baseType: !65, size: 16, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !66, line: 31, baseType: !67)
!66 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint16_t.h", directory: "")
!67 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ob_flags", scope: !59, file: !6, line: 133, baseType: !65, size: 16, offset: 48)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !49, file: !6, line: 144, baseType: !70, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !48, line: 20, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !73, line: 148, size: 3328, elements: !74)
!73 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/object.h", directory: "")
!74 = !{!75, !87, !88, !89, !90, !95, !96, !102, !107, !126, !128, !181, !212, !224, !230, !231, !232, !234, !236, !268, !269, !270, !279, !280, !285, !286, !288, !290, !301, !312, !330, !331, !332, !334, !336, !337, !339, !344, !349, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !370, !372}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !72, file: !73, line: 149, baseType: !76, size: 192)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !6, line: 172, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 169, size: 192, elements: !78)
!78 = !{!79, !80}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !77, file: !6, line: 170, baseType: !47, size: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !77, file: !6, line: 171, baseType: !81, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !82, line: 156, baseType: !83)
!82 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pyport.h", directory: "")
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !84, line: 31, baseType: !85)
!84 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_ssize_t.h", directory: "")
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ssize_t", file: !40, line: 97, baseType: !86)
!86 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !72, file: !73, line: 150, baseType: !25, size: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !72, file: !73, line: 151, baseType: !81, size: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !72, file: !73, line: 151, baseType: !81, size: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !72, file: !73, line: 155, baseType: !91, size: 64, offset: 384)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !6, line: 353, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !46}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall_offset", scope: !72, file: !73, line: 156, baseType: !81, size: 64, offset: 448)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !72, file: !73, line: 157, baseType: !97, size: 64, offset: 512)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !6, line: 354, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!46, !46, !101}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !72, file: !73, line: 158, baseType: !103, size: 64, offset: 576)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !6, line: 356, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!7, !46, !101, !46}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_async", scope: !72, file: !73, line: 159, baseType: !108, size: 64, offset: 640)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyAsyncMethods", file: !73, line: 135, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 130, size: 256, elements: !111)
!111 = !{!112, !117, !118, !119}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "am_await", scope: !110, file: !73, line: 131, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !6, line: 336, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!46, !46}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "am_aiter", scope: !110, file: !73, line: 132, baseType: !113, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "am_anext", scope: !110, file: !73, line: 133, baseType: !113, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "am_send", scope: !110, file: !73, line: 134, baseType: !120, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "sendfunc", file: !73, line: 128, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!124, !46, !46, !125}
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySendResult", file: !6, line: 699, baseType: !5)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !72, file: !73, line: 161, baseType: !127, size: 64, offset: 704)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !6, line: 358, baseType: !114)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !72, file: !73, line: 165, baseType: !129, size: 64, offset: 768)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !73, line: 106, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 61, size: 2304, elements: !132)
!132 = !{!133, !138, !139, !140, !141, !142, !147, !148, !149, !150, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !131, file: !73, line: 66, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !6, line: 337, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!46, !46, !46}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !131, file: !73, line: 67, baseType: !134, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !131, file: !73, line: 68, baseType: !134, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !131, file: !73, line: 69, baseType: !134, size: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !131, file: !73, line: 70, baseType: !134, size: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !131, file: !73, line: 71, baseType: !143, size: 64, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !6, line: 338, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!46, !46, !46, !46}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !131, file: !73, line: 72, baseType: !113, size: 64, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !131, file: !73, line: 73, baseType: !113, size: 64, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !131, file: !73, line: 74, baseType: !113, size: 64, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !131, file: !73, line: 75, baseType: !151, size: 64, offset: 576)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !6, line: 339, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!7, !46}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !131, file: !73, line: 76, baseType: !113, size: 64, offset: 640)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !131, file: !73, line: 77, baseType: !134, size: 64, offset: 704)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !131, file: !73, line: 78, baseType: !134, size: 64, offset: 768)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !131, file: !73, line: 79, baseType: !134, size: 64, offset: 832)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !131, file: !73, line: 80, baseType: !134, size: 64, offset: 896)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !131, file: !73, line: 81, baseType: !134, size: 64, offset: 960)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !131, file: !73, line: 82, baseType: !113, size: 64, offset: 1024)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !131, file: !73, line: 83, baseType: !45, size: 64, offset: 1088)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !131, file: !73, line: 84, baseType: !113, size: 64, offset: 1152)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !131, file: !73, line: 86, baseType: !134, size: 64, offset: 1216)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !131, file: !73, line: 87, baseType: !134, size: 64, offset: 1280)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !131, file: !73, line: 88, baseType: !134, size: 64, offset: 1344)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !131, file: !73, line: 89, baseType: !134, size: 64, offset: 1408)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !131, file: !73, line: 90, baseType: !143, size: 64, offset: 1472)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !131, file: !73, line: 91, baseType: !134, size: 64, offset: 1536)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !131, file: !73, line: 92, baseType: !134, size: 64, offset: 1600)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !131, file: !73, line: 93, baseType: !134, size: 64, offset: 1664)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !131, file: !73, line: 94, baseType: !134, size: 64, offset: 1728)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !131, file: !73, line: 95, baseType: !134, size: 64, offset: 1792)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !131, file: !73, line: 97, baseType: !134, size: 64, offset: 1856)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !131, file: !73, line: 98, baseType: !134, size: 64, offset: 1920)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !131, file: !73, line: 99, baseType: !134, size: 64, offset: 1984)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !131, file: !73, line: 100, baseType: !134, size: 64, offset: 2048)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !131, file: !73, line: 102, baseType: !113, size: 64, offset: 2112)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_matrix_multiply", scope: !131, file: !73, line: 104, baseType: !134, size: 64, offset: 2176)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_matrix_multiply", scope: !131, file: !73, line: 105, baseType: !134, size: 64, offset: 2240)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !72, file: !73, line: 166, baseType: !182, size: 64, offset: 832)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !73, line: 120, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 108, size: 640, elements: !185)
!185 = !{!186, !191, !192, !197, !198, !199, !204, !205, !210, !211}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !184, file: !73, line: 109, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !6, line: 340, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!81, !46}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !184, file: !73, line: 110, baseType: !134, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !184, file: !73, line: 111, baseType: !193, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !6, line: 341, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!46, !46, !81}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !184, file: !73, line: 112, baseType: !193, size: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !184, file: !73, line: 113, baseType: !45, size: 64, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !184, file: !73, line: 114, baseType: !200, size: 64, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !6, line: 343, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!7, !46, !81, !46}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !184, file: !73, line: 115, baseType: !45, size: 64, offset: 384)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !184, file: !73, line: 116, baseType: !206, size: 64, offset: 448)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !6, line: 347, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!7, !46, !46}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !184, file: !73, line: 118, baseType: !134, size: 64, offset: 512)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !184, file: !73, line: 119, baseType: !193, size: 64, offset: 576)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !72, file: !73, line: 167, baseType: !213, size: 64, offset: 896)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !73, line: 126, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 122, size: 192, elements: !216)
!216 = !{!217, !218, !219}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !215, file: !73, line: 123, baseType: !187, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !215, file: !73, line: 124, baseType: !134, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !215, file: !73, line: 125, baseType: !220, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !6, line: 345, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!7, !46, !46, !46}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !72, file: !73, line: 171, baseType: !225, size: 64, offset: 960)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !6, line: 359, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!229, !46}
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !82, line: 170, baseType: !81)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !72, file: !73, line: 172, baseType: !143, size: 64, offset: 1024)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !72, file: !73, line: 173, baseType: !127, size: 64, offset: 1088)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !72, file: !73, line: 174, baseType: !233, size: 64, offset: 1152)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !6, line: 355, baseType: !135)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !72, file: !73, line: 175, baseType: !235, size: 64, offset: 1216)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !6, line: 357, baseType: !221)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !72, file: !73, line: 178, baseType: !237, size: 64, offset: 1280)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !73, line: 140, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 137, size: 128, elements: !240)
!240 = !{!241, !263}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !239, file: !73, line: 138, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !243, line: 35, baseType: !244)
!243 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pybuffer.h", directory: "")
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!7, !46, !247, !7}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !243, line: 33, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !243, line: 20, size: 640, elements: !250)
!250 = !{!251, !252, !253, !254, !255, !256, !257, !258, !260, !261, !262}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !249, file: !243, line: 21, baseType: !45, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !249, file: !243, line: 22, baseType: !46, size: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !249, file: !243, line: 23, baseType: !81, size: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !249, file: !243, line: 24, baseType: !81, size: 64, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !249, file: !243, line: 26, baseType: !7, size: 32, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !249, file: !243, line: 27, baseType: !7, size: 32, offset: 288)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !249, file: !243, line: 28, baseType: !101, size: 64, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !249, file: !243, line: 29, baseType: !259, size: 64, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !249, file: !243, line: 30, baseType: !259, size: 64, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !249, file: !243, line: 31, baseType: !259, size: 64, offset: 512)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !249, file: !243, line: 32, baseType: !45, size: 64, offset: 576)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !239, file: !73, line: 139, baseType: !264, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !243, line: 36, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !46, !247}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !72, file: !73, line: 181, baseType: !44, size: 64, offset: 1344)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !72, file: !73, line: 183, baseType: !25, size: 64, offset: 1408)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !72, file: !73, line: 187, baseType: !271, size: 64, offset: 1472)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !6, line: 349, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!7, !46, !275, !45}
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !6, line: 348, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!7, !46, !45}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !72, file: !73, line: 190, baseType: !151, size: 64, offset: 1536)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !72, file: !73, line: 194, baseType: !281, size: 64, offset: 1600)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !6, line: 360, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!46, !46, !46, !7}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !72, file: !73, line: 197, baseType: !81, size: 64, offset: 1664)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !72, file: !73, line: 200, baseType: !287, size: 64, offset: 1728)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !6, line: 361, baseType: !114)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !72, file: !73, line: 201, baseType: !289, size: 64, offset: 1792)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !6, line: 362, baseType: !114)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !72, file: !73, line: 204, baseType: !291, size: 64, offset: 1856)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !48, line: 14, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !294, line: 68, size: 256, elements: !295)
!294 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/methodobject.h", directory: "")
!295 = !{!296, !297, !299, !300}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !293, file: !294, line: 69, baseType: !25, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !293, file: !294, line: 70, baseType: !298, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !294, line: 19, baseType: !135)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !293, file: !294, line: 71, baseType: !7, size: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !293, file: !294, line: 73, baseType: !25, size: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !72, file: !73, line: 205, baseType: !302, size: 64, offset: 1920)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !48, line: 16, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !305, line: 41, size: 320, elements: !306)
!305 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/descrobject.h", directory: "")
!306 = !{!307, !308, !309, !310, !311}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !304, file: !305, line: 42, baseType: !25, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !304, file: !305, line: 43, baseType: !7, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !304, file: !305, line: 44, baseType: !81, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !304, file: !305, line: 45, baseType: !7, size: 32, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !304, file: !305, line: 46, baseType: !25, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !72, file: !73, line: 206, baseType: !313, size: 64, offset: 1984)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGetSetDef", file: !48, line: 15, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !305, line: 11, size: 320, elements: !316)
!316 = !{!317, !318, !323, !328, !329}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !315, file: !305, line: 12, baseType: !25, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !315, file: !305, line: 13, baseType: !319, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !305, line: 8, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!46, !46, !45}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !315, file: !305, line: 14, baseType: !324, size: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !305, line: 9, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!7, !46, !46, !45}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !315, file: !305, line: 15, baseType: !25, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !315, file: !305, line: 16, baseType: !45, size: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !72, file: !73, line: 208, baseType: !70, size: 64, offset: 2048)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !72, file: !73, line: 209, baseType: !46, size: 64, offset: 2112)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !72, file: !73, line: 210, baseType: !333, size: 64, offset: 2176)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !6, line: 363, baseType: !144)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !72, file: !73, line: 211, baseType: !335, size: 64, offset: 2240)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !6, line: 364, baseType: !221)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !72, file: !73, line: 212, baseType: !81, size: 64, offset: 2304)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !72, file: !73, line: 213, baseType: !338, size: 64, offset: 2368)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !6, line: 365, baseType: !221)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !72, file: !73, line: 214, baseType: !340, size: 64, offset: 2432)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !6, line: 367, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!46, !70, !81}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !72, file: !73, line: 215, baseType: !345, size: 64, offset: 2496)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !6, line: 366, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!46, !70, !46, !46}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !72, file: !73, line: 216, baseType: !350, size: 64, offset: 2560)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !6, line: 352, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !45}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !72, file: !73, line: 217, baseType: !151, size: 64, offset: 2624)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !72, file: !73, line: 218, baseType: !46, size: 64, offset: 2688)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !72, file: !73, line: 219, baseType: !46, size: 64, offset: 2752)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !72, file: !73, line: 220, baseType: !46, size: 64, offset: 2816)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !72, file: !73, line: 221, baseType: !45, size: 64, offset: 2880)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !72, file: !73, line: 222, baseType: !46, size: 64, offset: 2944)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !72, file: !73, line: 223, baseType: !91, size: 64, offset: 3008)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !72, file: !73, line: 228, baseType: !14, size: 32, offset: 3072)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !72, file: !73, line: 230, baseType: !91, size: 64, offset: 3136)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall", scope: !72, file: !73, line: 231, baseType: !364, size: 64, offset: 3200)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "vectorcallfunc", file: !6, line: 370, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!46, !46, !368, !41, !46}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tp_watched", scope: !72, file: !73, line: 234, baseType: !371, size: 8, offset: 3264)
!371 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tp_versions_used", scope: !72, file: !73, line: 241, baseType: !65, size: 16, offset: 3280)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !374, line: 30, baseType: !7)
!374 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_int32_t.h", directory: "")
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !377, line: 15, baseType: !378)
!377 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/bytesobject.h", directory: "")
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !377, line: 5, size: 320, elements: !379)
!379 = !{!380, !381, !382}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !378, file: !377, line: 6, baseType: !76, size: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !378, file: !377, line: 7, baseType: !229, size: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !378, file: !377, line: 8, baseType: !383, size: 8, offset: 256)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 1)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunctionObject", file: !388, line: 14, baseType: !389)
!388 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/methodobject.h", directory: "")
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !388, line: 7, size: 448, elements: !390)
!390 = !{!391, !392, !393, !394, !395, !396}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !389, file: !388, line: 8, baseType: !47, size: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "m_ml", scope: !389, file: !388, line: 9, baseType: !291, size: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "m_self", scope: !389, file: !388, line: 10, baseType: !46, size: 64, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "m_module", scope: !389, file: !388, line: 11, baseType: !46, size: 64, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "m_weakreflist", scope: !389, file: !388, line: 12, baseType: !46, size: 64, offset: 320)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "vectorcall", scope: !389, file: !388, line: 13, baseType: !364, size: 64, offset: 384)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyLongObject", file: !48, line: 19, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_longobject", file: !400, line: 98, size: 256, elements: !401)
!400 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/longintrepr.h", directory: "")
!401 = !{!402, !403}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !399, file: !400, line: 99, baseType: !47, size: 128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "long_value", scope: !399, file: !400, line: 100, baseType: !404, size: 128, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyLongValue", file: !400, line: 96, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PyLongValue", file: !400, line: 93, size: 128, elements: !406)
!406 = !{!407, !410}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "lv_tag", scope: !405, file: !400, line: 94, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !409, line: 34, baseType: !44)
!409 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ob_digit", scope: !405, file: !400, line: 95, baseType: !411, size: 32, offset: 64)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 32, elements: !384)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "digit", file: !400, line: 43, baseType: !62)
!413 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !13, line: 163, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 54, size: 320, elements: !417)
!417 = !{!418, !419, !420, !421}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !416, file: !13, line: 99, baseType: !47, size: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !416, file: !13, line: 100, baseType: !81, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !416, file: !13, line: 101, baseType: !229, size: 64, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !416, file: !13, line: 162, baseType: !422, size: 32, offset: 256)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !416, file: !13, line: 107, size: 32, elements: !423)
!423 = !{!424, !425, !426, !427, !428}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !422, file: !13, line: 121, baseType: !14, size: 2, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !422, file: !13, line: 145, baseType: !14, size: 3, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !422, file: !13, line: 150, baseType: !14, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !422, file: !13, line: 154, baseType: !14, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "statically_allocated", scope: !422, file: !13, line: 156, baseType: !14, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFloatObject", file: !431, line: 8, baseType: !432)
!431 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/floatobject.h", directory: "")
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !431, line: 5, size: 192, elements: !433)
!433 = !{!434, !435}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !432, file: !431, line: 6, baseType: !47, size: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ob_fval", scope: !432, file: !431, line: 7, baseType: !413, size: 64, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !13, line: 173, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 168, size: 448, elements: !441)
!441 = !{!442, !443, !444}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !440, file: !13, line: 169, baseType: !415, size: 320)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !440, file: !13, line: 170, baseType: !81, size: 64, offset: 320)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !440, file: !13, line: 172, baseType: !101, size: 64, offset: 384)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !13, line: 184, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 176, size: 512, elements: !448)
!448 = !{!449, !450}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !447, file: !13, line: 177, baseType: !439, size: 448)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !447, file: !13, line: 183, baseType: !451, size: 64, offset: 448)
!451 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !447, file: !13, line: 178, size: 64, elements: !452)
!452 = !{!453, !454, !460, !463}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !451, file: !13, line: 179, baseType: !45, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !451, file: !13, line: 180, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !457, line: 96, baseType: !458)
!457 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/unicodeobject.h", directory: "")
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !459, line: 31, baseType: !371)
!459 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint8_t.h", directory: "")
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !451, file: !13, line: 181, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !457, line: 95, baseType: !65)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !451, file: !13, line: 182, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !457, line: 94, baseType: !62)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !456)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !462)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !465)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyByteArrayObject", file: !475, line: 12, baseType: !476)
!475 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/bytearrayobject.h", directory: "")
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !475, line: 6, size: 448, elements: !477)
!477 = !{!478, !479, !480, !481, !482}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !476, file: !475, line: 7, baseType: !76, size: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ob_alloc", scope: !476, file: !475, line: 8, baseType: !81, size: 64, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ob_bytes", scope: !476, file: !475, line: 9, baseType: !101, size: 64, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ob_start", scope: !476, file: !475, line: 10, baseType: !101, size: 64, offset: 320)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ob_exports", scope: !476, file: !475, line: 11, baseType: !81, size: 64, offset: 384)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBaseExceptionObject", file: !485, line: 15, baseType: !486)
!485 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/pyerrors.h", directory: "")
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !485, line: 13, size: 576, elements: !487)
!487 = !{!488, !489, !490, !491, !492, !493, !494, !495}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !486, file: !485, line: 14, baseType: !47, size: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !486, file: !485, line: 14, baseType: !46, size: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !486, file: !485, line: 14, baseType: !46, size: 64, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !486, file: !485, line: 14, baseType: !46, size: 64, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", scope: !486, file: !485, line: 14, baseType: !46, size: 64, offset: 320)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !486, file: !485, line: 14, baseType: !46, size: 64, offset: 384)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "cause", scope: !486, file: !485, line: 14, baseType: !46, size: 64, offset: 448)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_context", scope: !486, file: !485, line: 14, baseType: !27, size: 8, offset: 512)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CodeObjectCacheEntry", file: !498, line: 1874, baseType: !499)
!498 = !DIFile(filename: "dataset/cases/goeq-ojva-0130/artifacts/cython-clang-llvm-o0-embed-v1/prog_a/program.c", directory: ".")
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !498, line: 1871, size: 128, elements: !500)
!500 = !{!501, !559}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "code_object", scope: !499, file: !498, line: 1872, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CachedCodeObjectType", file: !498, line: 1869, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !48, line: 21, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyCodeObject", file: !506, line: 115, size: 1728, elements: !507)
!506 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/code.h", directory: "")
!507 = !{!508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !542, !551, !552, !555, !556, !557, !558}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !505, file: !506, line: 115, baseType: !76, size: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !505, file: !506, line: 115, baseType: !46, size: 64, offset: 192)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !505, file: !506, line: 115, baseType: !46, size: 64, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "co_exceptiontable", scope: !505, file: !506, line: 115, baseType: !46, size: 64, offset: 320)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !505, file: !506, line: 115, baseType: !7, size: 32, offset: 384)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !505, file: !506, line: 115, baseType: !7, size: 32, offset: 416)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "co_posonlyargcount", scope: !505, file: !506, line: 115, baseType: !7, size: 32, offset: 448)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !505, file: !506, line: 115, baseType: !7, size: 32, offset: 480)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !505, file: !506, line: 115, baseType: !7, size: 32, offset: 512)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !505, file: !506, line: 115, baseType: !7, size: 32, offset: 544)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocalsplus", scope: !505, file: !506, line: 115, baseType: !7, size: 32, offset: 576)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "co_framesize", scope: !505, file: !506, line: 115, baseType: !7, size: 32, offset: 608)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !505, file: !506, line: 115, baseType: !7, size: 32, offset: 640)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "co_ncellvars", scope: !505, file: !506, line: 115, baseType: !7, size: 32, offset: 672)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "co_nfreevars", scope: !505, file: !506, line: 115, baseType: !7, size: 32, offset: 704)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "co_version", scope: !505, file: !506, line: 115, baseType: !62, size: 32, offset: 736)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "co_localsplusnames", scope: !505, file: !506, line: 115, baseType: !46, size: 64, offset: 768)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "co_localspluskinds", scope: !505, file: !506, line: 115, baseType: !46, size: 64, offset: 832)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !505, file: !506, line: 115, baseType: !46, size: 64, offset: 896)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !505, file: !506, line: 115, baseType: !46, size: 64, offset: 960)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "co_qualname", scope: !505, file: !506, line: 115, baseType: !46, size: 64, offset: 1024)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "co_linetable", scope: !505, file: !506, line: 115, baseType: !46, size: 64, offset: 1088)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !505, file: !506, line: 115, baseType: !46, size: 64, offset: 1152)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "co_executors", scope: !505, file: !506, line: 115, baseType: !532, size: 64, offset: 1216)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyExecutorArray", file: !506, line: 22, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !506, line: 18, size: 128, elements: !535)
!535 = !{!536, !537, !538}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !534, file: !506, line: 19, baseType: !7, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !534, file: !506, line: 20, baseType: !7, size: 32, offset: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "executors", scope: !534, file: !506, line: 21, baseType: !539, size: 64, offset: 64)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 64, elements: !384)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyExecutorObject", file: !506, line: 21, flags: DIFlagFwdDecl)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_co_cached", scope: !505, file: !506, line: 115, baseType: !543, size: 64, offset: 1280)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyCoCached", file: !506, line: 16, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !506, line: 11, size: 256, elements: !546)
!546 = !{!547, !548, !549, !550}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_co_code", scope: !545, file: !506, line: 12, baseType: !46, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_co_varnames", scope: !545, file: !506, line: 13, baseType: !46, size: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_co_cellvars", scope: !545, file: !506, line: 14, baseType: !46, size: 64, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_co_freevars", scope: !545, file: !506, line: 15, baseType: !46, size: 64, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_co_instrumentation_version", scope: !505, file: !506, line: 115, baseType: !408, size: 64, offset: 1344)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_co_monitoring", scope: !505, file: !506, line: 115, baseType: !553, size: 64, offset: 1408)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyCoMonitoringData", file: !506, line: 115, flags: DIFlagFwdDecl)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_co_unique_id", scope: !505, file: !506, line: 115, baseType: !81, size: 64, offset: 1472)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_co_firsttraceable", scope: !505, file: !506, line: 115, baseType: !7, size: 32, offset: 1536)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "co_extra", scope: !505, file: !506, line: 115, baseType: !45, size: 64, offset: 1600)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "co_code_adaptive", scope: !505, file: !506, line: 115, baseType: !383, size: 8, offset: 1664)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "code_line", scope: !499, file: !498, line: 1873, baseType: !7, size: 32, offset: 64)
!560 = !{!0, !561, !566, !568, !573, !603, !606, !611, !616, !621, !626, !628, !630, !632, !637, !642, !644, !650, !655, !657, !662, !689, !691, !696, !701, !704, !706, !711, !715, !720, !722, !724, !729, !734, !739, !741, !743, !745, !750, !752, !754, !756, !761, !763, !766, !771, !776, !781, !786, !791, !793, !795, !797, !799, !801, !806, !811, !816, !821, !823, !828, !830, !832, !834, !839, !842, !844, !846, !851, !854, !859, !861, !864, !866, !871, !874, !879, !881, !884, !886, !891, !893, !896, !898, !900, !902, !907, !909, !911}
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !498, line: 3752, type: !563, isLocal: true, isDefinition: true)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 128, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 16)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !498, line: 3759, type: !383, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !498, line: 2262, type: !570, isLocal: true, isDefinition: true)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 72, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 9)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(name: "__pyx_moduledef", scope: !2, file: !498, line: 2258, type: !575, isLocal: true, isDefinition: true)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !576, line: 107, size: 832, elements: !577)
!576 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/moduleobject.h", directory: "")
!577 = !{!578, !589, !590, !591, !592, !593, !600, !601, !602}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !575, file: !576, line: 108, baseType: !579, size: 320)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !576, line: 58, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !576, line: 39, size: 320, elements: !581)
!581 = !{!582, !583, !587, !588}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !580, file: !576, line: 40, baseType: !47, size: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !580, file: !576, line: 47, baseType: !584, size: 64, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!46}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !580, file: !576, line: 52, baseType: !81, size: 64, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !580, file: !576, line: 57, baseType: !46, size: 64, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !575, file: !576, line: 109, baseType: !25, size: 64, offset: 320)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !575, file: !576, line: 110, baseType: !25, size: 64, offset: 384)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !575, file: !576, line: 111, baseType: !81, size: 64, offset: 448)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !575, file: !576, line: 112, baseType: !291, size: 64, offset: 512)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "m_slots", scope: !575, file: !576, line: 113, baseType: !594, size: 64, offset: 576)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Slot", file: !48, line: 13, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Slot", file: !576, line: 69, size: 128, elements: !597)
!597 = !{!598, !599}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !596, file: !576, line: 70, baseType: !7, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !596, file: !576, line: 71, baseType: !45, size: 64, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !575, file: !576, line: 114, baseType: !271, size: 64, offset: 640)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !575, file: !576, line: 115, baseType: !151, size: 64, offset: 704)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !575, file: !576, line: 116, baseType: !350, size: 64, offset: 768)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "__pyx_methods", scope: !2, file: !498, line: 2157, type: !605, isLocal: true, isDefinition: true)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 256, elements: !384)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "__pyx_moduledef_slots", scope: !2, file: !498, line: 2241, type: !608, isLocal: true, isDefinition: true)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 384, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 3)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !498, line: 2390, type: !613, isLocal: true, isDefinition: true)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 40, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 5)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !498, line: 2397, type: !618, isLocal: true, isDefinition: true)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 56, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 7)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !498, line: 2397, type: !623, isLocal: true, isDefinition: true)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 88, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 11)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !498, line: 2398, type: !618, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !498, line: 2398, type: !570, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !498, line: 2399, type: !618, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !498, line: 2399, type: !634, isLocal: true, isDefinition: true)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 96, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 12)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !498, line: 2400, type: !639, isLocal: true, isDefinition: true)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 216, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 27)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !498, line: 2400, type: !570, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "main_interpreter_id", scope: !646, file: !498, line: 2337, type: !55, isLocal: true, isDefinition: true)
!646 = distinct !DISubprogram(name: "__Pyx_check_single_interpreter", scope: !498, file: !498, line: 2336, type: !647, scopeLine: 2336, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !649)
!647 = !DISubroutineType(types: !648)
!648 = !{!7}
!649 = !{}
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !498, line: 2359, type: !652, isLocal: true, isDefinition: true)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 760, elements: !653)
!653 = !{!654}
!654 = !DISubrange(count: 95)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "__pyx_m", scope: !2, file: !498, line: 1326, type: !46, isLocal: true, isDefinition: true)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(scope: null, file: !498, line: 2429, type: !659, isLocal: true, isDefinition: true)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 648, elements: !660)
!660 = !{!661}
!661 = !DISubrange(count: 81)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "__pyx_mstate_global", scope: !2, file: !498, line: 2096, type: !664, isLocal: true, isDefinition: true)
!664 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !665)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pyx_mstatetype", file: !498, line: 2075, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !498, line: 2061, size: 1536, elements: !668)
!668 = !{!669, !670, !671, !672, !673, !674, !675, !679, !683}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_d", scope: !667, file: !498, line: 2062, baseType: !46, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_b", scope: !667, file: !498, line: 2063, baseType: !46, size: 64, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_cython_runtime", scope: !667, file: !498, line: 2064, baseType: !46, size: 64, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_tuple", scope: !667, file: !498, line: 2065, baseType: !46, size: 64, offset: 192)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_bytes", scope: !667, file: !498, line: 2066, baseType: !46, size: 64, offset: 256)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_unicode", scope: !667, file: !498, line: 2067, baseType: !46, size: 64, offset: 320)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_string_tab", scope: !667, file: !498, line: 2068, baseType: !676, size: 896, offset: 384)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 896, elements: !677)
!677 = !{!678}
!678 = !DISubrange(count: 14)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_number_tab", scope: !667, file: !498, line: 2069, baseType: !680, size: 128, offset: 1280)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 128, elements: !681)
!681 = !{!682}
!682 = !DISubrange(count: 2)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_code_cache", scope: !667, file: !498, line: 2072, baseType: !684, size: 128, offset: 1408)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__Pyx_CodeObjectCache", file: !498, line: 1875, size: 128, elements: !685)
!685 = !{!686, !687, !688}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !684, file: !498, line: 1876, baseType: !7, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "max_count", scope: !684, file: !498, line: 1877, baseType: !7, size: 32, offset: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !684, file: !498, line: 1878, baseType: !496, size: 64, offset: 64)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !498, line: 2459, type: !570, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !498, line: 2460, type: !693, isLocal: true, isDefinition: true)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 120, elements: !694)
!694 = !{!695}
!695 = !DISubrange(count: 15)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(scope: null, file: !498, line: 2461, type: !698, isLocal: true, isDefinition: true)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 104, elements: !699)
!699 = !{!700}
!700 = !DISubrange(count: 13)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !498, line: 2619, type: !703, isLocal: true, isDefinition: true)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 112, elements: !677)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(name: "__pyx_mstate_global_static", scope: !2, file: !498, line: 2090, type: !666, isLocal: true, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !498, line: 1336, type: !708, isLocal: true, isDefinition: true)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 440, elements: !709)
!709 = !{!710}
!710 = !DISubrange(count: 55)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "__pyx_f", scope: !2, file: !498, line: 1335, type: !713, isLocal: true, isDefinition: true)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 64, elements: !384)
!714 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(scope: null, file: !498, line: 4615, type: !717, isLocal: true, isDefinition: true)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 624, elements: !718)
!718 = !{!719}
!719 = !DISubrange(count: 78)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(scope: null, file: !498, line: 4621, type: !693, isLocal: true, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !498, line: 4621, type: !693, isLocal: true, isDefinition: true)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !498, line: 2678, type: !726, isLocal: true, isDefinition: true)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 608, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 76)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !498, line: 4631, type: !731, isLocal: true, isDefinition: true)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 136, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 17)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !498, line: 4631, type: !736, isLocal: true, isDefinition: true)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 32, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 4)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !498, line: 4631, type: !613, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !498, line: 4632, type: !623, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !498, line: 4636, type: !736, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !498, line: 4683, type: !747, isLocal: true, isDefinition: true)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1224, elements: !748)
!748 = !{!749}
!749 = !DISubrange(count: 153)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "__pyx_filename", scope: !2, file: !498, line: 1331, type: !25, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "__pyx_lineno", scope: !2, file: !498, line: 1328, type: !7, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "__pyx_clineno", scope: !2, file: !498, line: 1329, type: !7, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !377, line: 25, type: !758, isLocal: true, isDefinition: true)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 144, elements: !759)
!759 = !{!760}
!760 = !DISubrange(count: 18)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(scope: null, file: !377, line: 25, type: !703, isLocal: true, isDefinition: true)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(scope: null, file: !377, line: 25, type: !765, isLocal: true, isDefinition: true)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 144, elements: !759)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(scope: null, file: !498, line: 2946, type: !768, isLocal: true, isDefinition: true)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 200, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 25)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(scope: null, file: !498, line: 3117, type: !773, isLocal: true, isDefinition: true)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 248, elements: !774)
!774 = !{!775}
!775 = !DISubrange(count: 31)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(scope: null, file: !498, line: 3124, type: !778, isLocal: true, isDefinition: true)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 344, elements: !779)
!779 = !{!780}
!780 = !DISubrange(count: 43)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !498, line: 3162, type: !783, isLocal: true, isDefinition: true)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 224, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 28)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(scope: null, file: !498, line: 3162, type: !788, isLocal: true, isDefinition: true)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 80, elements: !789)
!789 = !{!790}
!790 = !DISubrange(count: 10)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(scope: null, file: !498, line: 3162, type: !639, isLocal: true, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(scope: null, file: !498, line: 3164, type: !623, isLocal: true, isDefinition: true)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "__pyx_builtin_input", scope: !2, file: !498, line: 2044, type: !46, isLocal: true, isDefinition: true)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(scope: null, file: !400, line: 123, type: !758, isLocal: true, isDefinition: true)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(scope: null, file: !400, line: 123, type: !703, isLocal: true, isDefinition: true)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(scope: null, file: !400, line: 123, type: !803, isLocal: true, isDefinition: true)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 520, elements: !804)
!804 = !{!805}
!805 = !DISubrange(count: 65)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(scope: null, file: !400, line: 133, type: !808, isLocal: true, isDefinition: true)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 168, elements: !809)
!809 = !{!810}
!810 = !DISubrange(count: 21)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(scope: null, file: !400, line: 134, type: !813, isLocal: true, isDefinition: true)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 240, elements: !814)
!814 = !{!815}
!815 = !DISubrange(count: 30)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(scope: null, file: !13, line: 227, type: !818, isLocal: true, isDefinition: true)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 152, elements: !819)
!819 = !{!820}
!820 = !DISubrange(count: 19)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(scope: null, file: !13, line: 227, type: !563, isLocal: true, isDefinition: true)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(scope: null, file: !13, line: 227, type: !825, isLocal: true, isDefinition: true)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 160, elements: !826)
!826 = !{!827}
!827 = !DISubrange(count: 20)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(scope: null, file: !431, line: 16, type: !758, isLocal: true, isDefinition: true)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(scope: null, file: !431, line: 16, type: !703, isLocal: true, isDefinition: true)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(scope: null, file: !431, line: 16, type: !765, isLocal: true, isDefinition: true)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(scope: null, file: !498, line: 1729, type: !836, isLocal: true, isDefinition: true)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 288, elements: !837)
!837 = !{!838}
!838 = !DISubrange(count: 36)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(scope: null, file: !498, line: 1729, type: !841, isLocal: true, isDefinition: true)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 168, elements: !809)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(scope: null, file: !13, line: 299, type: !808, isLocal: true, isDefinition: true)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(scope: null, file: !13, line: 234, type: !808, isLocal: true, isDefinition: true)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(scope: null, file: !13, line: 265, type: !848, isLocal: true, isDefinition: true)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 192, elements: !849)
!849 = !{!850}
!850 = !DISubrange(count: 24)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(scope: null, file: !13, line: 272, type: !853, isLocal: true, isDefinition: true)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 216, elements: !640)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(scope: null, file: !13, line: 272, type: !856, isLocal: true, isDefinition: true)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 208, elements: !857)
!857 = !{!858}
!858 = !DISubrange(count: 26)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(scope: null, file: !13, line: 274, type: !698, isLocal: true, isDefinition: true)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(scope: null, file: !13, line: 335, type: !863, isLocal: true, isDefinition: true)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 120, elements: !694)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(scope: null, file: !13, line: 335, type: !623, isLocal: true, isDefinition: true)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(scope: null, file: !13, line: 342, type: !868, isLocal: true, isDefinition: true)
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 232, elements: !869)
!869 = !{!870}
!870 = !DISubrange(count: 29)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(scope: null, file: !377, line: 30, type: !873, isLocal: true, isDefinition: true)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 136, elements: !732)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(scope: null, file: !6, line: 284, type: !876, isLocal: true, isDefinition: true)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 64, elements: !877)
!877 = !{!878}
!878 = !DISubrange(count: 8)
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(scope: null, file: !6, line: 284, type: !570, isLocal: true, isDefinition: true)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(scope: null, file: !6, line: 284, type: !883, isLocal: true, isDefinition: true)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 224, elements: !784)
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(scope: null, file: !6, line: 285, type: !883, isLocal: true, isDefinition: true)
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(scope: null, file: !475, line: 22, type: !888, isLocal: true, isDefinition: true)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 176, elements: !889)
!889 = !{!890}
!890 = !DISubrange(count: 22)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(scope: null, file: !475, line: 22, type: !765, isLocal: true, isDefinition: true)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(scope: null, file: !475, line: 22, type: !895, isLocal: true, isDefinition: true)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 176, elements: !889)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(scope: null, file: !475, line: 31, type: !808, isLocal: true, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "__pyx_builtin_print", scope: !2, file: !498, line: 2045, type: !46, isLocal: true, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(scope: null, file: !498, line: 3627, type: !623, isLocal: true, isDefinition: true)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(scope: null, file: !498, line: 1330, type: !904, isLocal: true, isDefinition: true)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 952, elements: !905)
!905 = !{!906}
!906 = !DISubrange(count: 119)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(name: "__pyx_cfilenm", scope: !2, file: !498, line: 1330, type: !714, isLocal: true, isDefinition: true)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !498, line: 2848, type: !848, isLocal: true, isDefinition: true)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(scope: null, file: !498, line: 2848, type: !913, isLocal: true, isDefinition: true)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 560, elements: !914)
!914 = !{!915}
!915 = !DISubrange(count: 70)
!916 = !{i32 2, !"SDK Version", [2 x i32] [i32 14, i32 4]}
!917 = !{i32 7, !"Dwarf Version", i32 4}
!918 = !{i32 2, !"Debug Info Version", i32 3}
!919 = !{i32 1, !"wchar_size", i32 4}
!920 = !{i32 8, !"PIC Level", i32 2}
!921 = !{i32 7, !"uwtable", i32 1}
!922 = !{i32 7, !"frame-pointer", i32 1}
!923 = !{!"Homebrew clang version 20.1.8"}
!924 = distinct !DISubprogram(name: "PyInit_original", scope: !498, file: !498, line: 2301, type: !585, scopeLine: 2303, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2)
!925 = !DILocation(line: 2304, column: 10, scope: !924)
!926 = !DILocation(line: 2304, column: 3, scope: !924)
!927 = distinct !DISubprogram(name: "main", scope: !498, file: !498, line: 3741, type: !928, scopeLine: 3742, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !649)
!928 = !DISubroutineType(types: !929)
!929 = !{!7, !7, !930}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!931 = !DILocalVariable(name: "argc", arg: 1, scope: !927, file: !498, line: 3741, type: !7)
!932 = !DILocation(line: 3741, column: 10, scope: !927)
!933 = !DILocalVariable(name: "argv", arg: 2, scope: !927, file: !498, line: 3741, type: !930)
!934 = !DILocation(line: 3741, column: 23, scope: !927)
!935 = !DILocation(line: 3743, column: 10, scope: !936)
!936 = distinct !DILexicalBlock(scope: !927, file: !498, line: 3743, column: 9)
!937 = !DILocation(line: 3743, column: 9, scope: !936)
!938 = !DILocation(line: 3744, column: 16, scope: !939)
!939 = distinct !DILexicalBlock(scope: !936, file: !498, line: 3743, column: 16)
!940 = !DILocation(line: 3744, column: 9, scope: !939)
!941 = !DILocalVariable(name: "i", scope: !942, file: !498, line: 3747, type: !7)
!942 = distinct !DILexicalBlock(scope: !936, file: !498, line: 3746, column: 10)
!943 = !DILocation(line: 3747, column: 13, scope: !942)
!944 = !DILocalVariable(name: "res", scope: !942, file: !498, line: 3747, type: !7)
!945 = !DILocation(line: 3747, column: 16, scope: !942)
!946 = !DILocalVariable(name: "argv_copy", scope: !942, file: !498, line: 3748, type: !35)
!947 = !DILocation(line: 3748, column: 19, scope: !942)
!948 = !DILocation(line: 3748, column: 78, scope: !942)
!949 = !DILocation(line: 3748, column: 69, scope: !942)
!950 = !DILocation(line: 3748, column: 67, scope: !942)
!951 = !DILocation(line: 3748, column: 43, scope: !942)
!952 = !DILocalVariable(name: "argv_copy2", scope: !942, file: !498, line: 3749, type: !35)
!953 = !DILocation(line: 3749, column: 19, scope: !942)
!954 = !DILocation(line: 3749, column: 79, scope: !942)
!955 = !DILocation(line: 3749, column: 70, scope: !942)
!956 = !DILocation(line: 3749, column: 68, scope: !942)
!957 = !DILocation(line: 3749, column: 44, scope: !942)
!958 = !DILocalVariable(name: "oldloc", scope: !942, file: !498, line: 3750, type: !101)
!959 = !DILocation(line: 3750, column: 15, scope: !942)
!960 = !DILocation(line: 3750, column: 31, scope: !942)
!961 = !DILocation(line: 3750, column: 24, scope: !942)
!962 = !DILocation(line: 3751, column: 14, scope: !963)
!963 = distinct !DILexicalBlock(scope: !942, file: !498, line: 3751, column: 13)
!964 = !DILocation(line: 3751, column: 24, scope: !963)
!965 = !DILocation(line: 3751, column: 28, scope: !963)
!966 = !DILocation(line: 3751, column: 39, scope: !963)
!967 = !DILocation(line: 3751, column: 43, scope: !963)
!968 = !DILocation(line: 3752, column: 21, scope: !969)
!969 = distinct !DILexicalBlock(scope: !963, file: !498, line: 3751, column: 51)
!970 = !DILocation(line: 3752, column: 13, scope: !969)
!971 = !DILocation(line: 3753, column: 18, scope: !969)
!972 = !DILocation(line: 3753, column: 13, scope: !969)
!973 = !DILocation(line: 3754, column: 18, scope: !969)
!974 = !DILocation(line: 3754, column: 13, scope: !969)
!975 = !DILocation(line: 3755, column: 18, scope: !969)
!976 = !DILocation(line: 3755, column: 13, scope: !969)
!977 = !DILocation(line: 3756, column: 13, scope: !969)
!978 = !DILocation(line: 3758, column: 13, scope: !942)
!979 = !DILocation(line: 3759, column: 9, scope: !942)
!980 = !DILocation(line: 3760, column: 16, scope: !981)
!981 = distinct !DILexicalBlock(scope: !942, file: !498, line: 3760, column: 9)
!982 = !DILocation(line: 3760, column: 14, scope: !981)
!983 = !DILocation(line: 3760, column: 21, scope: !984)
!984 = distinct !DILexicalBlock(scope: !981, file: !498, line: 3760, column: 9)
!985 = !DILocation(line: 3760, column: 25, scope: !984)
!986 = !DILocation(line: 3760, column: 23, scope: !984)
!987 = !DILocation(line: 3760, column: 9, scope: !981)
!988 = !DILocation(line: 3761, column: 60, scope: !989)
!989 = distinct !DILexicalBlock(scope: !984, file: !498, line: 3760, column: 36)
!990 = !DILocation(line: 3761, column: 65, scope: !989)
!991 = !DILocation(line: 3761, column: 44, scope: !989)
!992 = !DILocation(line: 3761, column: 29, scope: !989)
!993 = !DILocation(line: 3761, column: 39, scope: !989)
!994 = !DILocation(line: 3761, column: 42, scope: !989)
!995 = !DILocation(line: 3761, column: 13, scope: !989)
!996 = !DILocation(line: 3761, column: 24, scope: !989)
!997 = !DILocation(line: 3761, column: 27, scope: !989)
!998 = !DILocation(line: 3762, column: 18, scope: !999)
!999 = distinct !DILexicalBlock(scope: !989, file: !498, line: 3762, column: 17)
!1000 = !DILocation(line: 3762, column: 28, scope: !999)
!1001 = !DILocation(line: 3762, column: 17, scope: !999)
!1002 = !DILocation(line: 3762, column: 36, scope: !999)
!1003 = !DILocation(line: 3762, column: 32, scope: !999)
!1004 = !DILocation(line: 3763, column: 9, scope: !989)
!1005 = !DILocation(line: 3760, column: 32, scope: !984)
!1006 = !DILocation(line: 3760, column: 9, scope: !984)
!1007 = distinct !{!1007, !987, !1008, !1009}
!1008 = !DILocation(line: 3763, column: 9, scope: !981)
!1009 = !{!"llvm.loop.mustprogress"}
!1010 = !DILocation(line: 3764, column: 27, scope: !942)
!1011 = !DILocation(line: 3764, column: 9, scope: !942)
!1012 = !DILocation(line: 3765, column: 14, scope: !942)
!1013 = !DILocation(line: 3765, column: 9, scope: !942)
!1014 = !DILocation(line: 3766, column: 13, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !942, file: !498, line: 3766, column: 13)
!1016 = !DILocation(line: 3766, column: 17, scope: !1015)
!1017 = !DILocation(line: 3767, column: 30, scope: !1015)
!1018 = !DILocation(line: 3767, column: 36, scope: !1015)
!1019 = !DILocation(line: 3767, column: 19, scope: !1015)
!1020 = !DILocation(line: 3767, column: 17, scope: !1015)
!1021 = !DILocation(line: 3767, column: 13, scope: !1015)
!1022 = !DILocation(line: 3768, column: 16, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !942, file: !498, line: 3768, column: 9)
!1024 = !DILocation(line: 3768, column: 14, scope: !1023)
!1025 = !DILocation(line: 3768, column: 21, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1023, file: !498, line: 3768, column: 9)
!1027 = !DILocation(line: 3768, column: 25, scope: !1026)
!1028 = !DILocation(line: 3768, column: 23, scope: !1026)
!1029 = !DILocation(line: 3768, column: 9, scope: !1023)
!1030 = !DILocation(line: 3769, column: 27, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1026, file: !498, line: 3768, column: 36)
!1032 = !DILocation(line: 3769, column: 38, scope: !1031)
!1033 = !DILocation(line: 3769, column: 13, scope: !1031)
!1034 = !DILocation(line: 3770, column: 9, scope: !1031)
!1035 = !DILocation(line: 3768, column: 32, scope: !1026)
!1036 = !DILocation(line: 3768, column: 9, scope: !1026)
!1037 = distinct !{!1037, !1029, !1038, !1009}
!1038 = !DILocation(line: 3770, column: 9, scope: !1023)
!1039 = !DILocation(line: 3771, column: 14, scope: !942)
!1040 = !DILocation(line: 3771, column: 9, scope: !942)
!1041 = !DILocation(line: 3772, column: 14, scope: !942)
!1042 = !DILocation(line: 3772, column: 9, scope: !942)
!1043 = !DILocation(line: 3773, column: 16, scope: !942)
!1044 = !DILocation(line: 3773, column: 9, scope: !942)
!1045 = !DILocation(line: 3775, column: 1, scope: !927)
!1046 = distinct !DISubprogram(name: "__Pyx_main", scope: !498, file: !498, line: 3686, type: !1047, scopeLine: 3688, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !649)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!7, !7, !35}
!1049 = !DILocalVariable(name: "argc", arg: 1, scope: !1046, file: !498, line: 3686, type: !7)
!1050 = !DILocation(line: 3686, column: 27, scope: !1046)
!1051 = !DILocalVariable(name: "argv", arg: 2, scope: !1046, file: !498, line: 3686, type: !35)
!1052 = !DILocation(line: 3686, column: 43, scope: !1046)
!1053 = !DILocation(line: 3699, column: 9, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1046, file: !498, line: 3699, column: 9)
!1055 = !DILocation(line: 3699, column: 61, scope: !1054)
!1056 = !DILocation(line: 3699, column: 66, scope: !1054)
!1057 = !DILocalVariable(name: "status", scope: !1058, file: !498, line: 3701, type: !1059)
!1058 = distinct !DILexicalBlock(scope: !1046, file: !498, line: 3700, column: 5)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyStatus", file: !20, line: 19, baseType: !21)
!1060 = !DILocation(line: 3701, column: 18, scope: !1058)
!1061 = !DILocalVariable(name: "config", scope: !1058, file: !498, line: 3702, type: !1062)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyConfig", file: !20, line: 244, baseType: !1063)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyConfig", file: !20, line: 134, size: 3648, elements: !1064)
!1064 = !{!1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "_config_init", scope: !1063, file: !20, line: 135, baseType: !7, size: 32)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "isolated", scope: !1063, file: !20, line: 137, baseType: !7, size: 32, offset: 32)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "use_environment", scope: !1063, file: !20, line: 138, baseType: !7, size: 32, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "dev_mode", scope: !1063, file: !20, line: 139, baseType: !7, size: 32, offset: 96)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "install_signal_handlers", scope: !1063, file: !20, line: 140, baseType: !7, size: 32, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "use_hash_seed", scope: !1063, file: !20, line: 141, baseType: !7, size: 32, offset: 160)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "hash_seed", scope: !1063, file: !20, line: 142, baseType: !44, size: 64, offset: 192)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "faulthandler", scope: !1063, file: !20, line: 143, baseType: !7, size: 32, offset: 256)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "tracemalloc", scope: !1063, file: !20, line: 144, baseType: !7, size: 32, offset: 288)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "perf_profiling", scope: !1063, file: !20, line: 145, baseType: !7, size: 32, offset: 320)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "remote_debug", scope: !1063, file: !20, line: 146, baseType: !7, size: 32, offset: 352)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "import_time", scope: !1063, file: !20, line: 147, baseType: !7, size: 32, offset: 384)
