; ModuleID = 'dataset/cases/goeq-ojva-0127/artifacts/cython-clang-llvm-o0-embed-v1/prog_a/program.c'
source_filename = "dataset/cases/goeq-ojva-0127/artifacts/cython-clang-llvm-o0-embed-v1/prog_a/program.c"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx14.0.0"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr }
%struct.PyModuleDef_Base = type { %struct._object, ptr, i64, ptr }
%struct._object = type { %union.anon, ptr }
%union.anon = type { i64 }
%struct.PyMethodDef = type { ptr, ptr, i32, ptr }
%struct.__pyx_mstatetype = type { ptr, ptr, ptr, ptr, ptr, ptr, %struct.__Pyx_CachedCFunction, %struct.__Pyx_CachedCFunction, [1 x ptr], [27 x ptr], [2 x ptr], ptr, ptr, %struct.__Pyx_CodeObjectCache }
%struct.__Pyx_CachedCFunction = type { ptr, ptr, ptr, ptr, i32 }
%struct.__Pyx_CodeObjectCache = type { i32, i32, ptr }
%struct.anon.1 = type { i8, [3 x i8] }
%struct._typeobject = type { %struct.PyVarObject, ptr, i64, i64, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, ptr, i8, i16 }
%struct.PyVarObject = type { %struct._object, i64 }
%struct.PyGetSetDef = type { ptr, ptr, ptr, ptr, ptr }
%struct._longobject = type { %struct._object, %struct._PyLongValue }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__pyx_module_is_main_original", scope: !2, file: !399, line: 2188, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Homebrew clang version 20.1.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !34, globals: !622, splitDebugInlining: false, nameTableKind: Apple, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk", sdk: "MacOSX14.sdk")
!3 = !DIFile(filename: "dataset/cases/goeq-ojva-0127/artifacts/cython-clang-llvm-o0-embed-v1/prog_a/program.c", directory: ".")
!4 = !{!5, !12, !19}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 695, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/object.h", directory: "")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "PYGEN_RETURN", value: 0)
!10 = !DIEnumerator(name: "PYGEN_ERROR", value: -1)
!11 = !DIEnumerator(name: "PYGEN_NEXT", value: 1)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !13, line: 245, baseType: !14, size: 32, elements: !15)
!13 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/unicodeobject.h", directory: "")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16, !17, !18}
!16 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!17 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!18 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !21, file: !20, line: 11, baseType: !14, size: 32, elements: !30)
!20 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/initconfig.h", directory: "")
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !20, line: 10, size: 256, elements: !22)
!22 = !{!23, !24, !28, !29}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_type", scope: !21, file: !20, line: 15, baseType: !19, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !21, file: !20, line: 16, baseType: !25, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!27 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "err_msg", scope: !21, file: !20, line: 17, baseType: !25, size: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "exitcode", scope: !21, file: !20, line: 18, baseType: !7, size: 32, offset: 192)
!30 = !{!31, !32, !33}
!31 = !DIEnumerator(name: "_PyStatus_TYPE_OK", value: 0)
!32 = !DIEnumerator(name: "_PyStatus_TYPE_ERROR", value: 1)
!33 = !DIEnumerator(name: "_PyStatus_TYPE_EXIT", value: 2)
!34 = !{!35, !41, !45, !46, !373, !7, !25, !101, !375, !70, !386, !397, !421, !430, !125, !449, !450, !451, !454, !298, !319, !324, !455, !14, !81, !463, !467, !471, !44, !486, !487, !488, !86, !495, !510, !512, !519, !540, !542, !544, !546, !559}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !38, line: 34, baseType: !39)
!38 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_wchar_t.h", directory: "")
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wchar_t", file: !40, line: 82, baseType: !7)
!40 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/arm/_types.h", directory: "")
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !42, line: 31, baseType: !43)
!42 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !40, line: 70, baseType: !44)
!44 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !48, line: 18, baseType: !49)
!48 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pytypedefs.h", directory: "")
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !6, line: 110, size: 128, elements: !50)
!50 = !{!51, !69}
!51 = !DIDerivedType(tag: DW_TAG_member, scope: !49, file: !6, line: 122, baseType: !52, size: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !49, file: !6, line: 122, size: 64, elements: !53)
!53 = !{!54, !58}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt_full", scope: !52, file: !6, line: 124, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !56, line: 30, baseType: !57)
!56 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_int64_t.h", directory: "")
!57 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, scope: !52, file: !6, line: 125, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !52, file: !6, line: 125, size: 64, elements: !60)
!60 = !{!61, !64, !68}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !59, file: !6, line: 131, baseType: !62, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !63, line: 31, baseType: !14)
!63 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint32_t.h", directory: "")
!64 = !DIDerivedType(tag: DW_TAG_member, name: "ob_overflow", scope: !59, file: !6, line: 132, baseType: !65, size: 16, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !66, line: 31, baseType: !67)
!66 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint16_t.h", directory: "")
!67 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ob_flags", scope: !59, file: !6, line: 133, baseType: !65, size: 16, offset: 48)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !49, file: !6, line: 144, baseType: !70, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !48, line: 20, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !73, line: 148, size: 3328, elements: !74)
!73 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/object.h", directory: "")
!74 = !{!75, !87, !88, !89, !90, !95, !96, !102, !107, !126, !128, !181, !212, !224, !230, !231, !232, !234, !236, !268, !269, !270, !279, !280, !285, !286, !288, !290, !301, !312, !330, !331, !332, !334, !336, !337, !339, !344, !349, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !370, !372}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !72, file: !73, line: 149, baseType: !76, size: 192)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !6, line: 172, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 169, size: 192, elements: !78)
!78 = !{!79, !80}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !77, file: !6, line: 170, baseType: !47, size: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !77, file: !6, line: 171, baseType: !81, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !82, line: 156, baseType: !83)
!82 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pyport.h", directory: "")
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !84, line: 31, baseType: !85)
!84 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_ssize_t.h", directory: "")
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ssize_t", file: !40, line: 97, baseType: !86)
!86 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !72, file: !73, line: 150, baseType: !25, size: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !72, file: !73, line: 151, baseType: !81, size: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !72, file: !73, line: 151, baseType: !81, size: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !72, file: !73, line: 155, baseType: !91, size: 64, offset: 384)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !6, line: 353, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !46}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall_offset", scope: !72, file: !73, line: 156, baseType: !81, size: 64, offset: 448)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !72, file: !73, line: 157, baseType: !97, size: 64, offset: 512)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !6, line: 354, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!46, !46, !101}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !72, file: !73, line: 158, baseType: !103, size: 64, offset: 576)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !6, line: 356, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!7, !46, !101, !46}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_async", scope: !72, file: !73, line: 159, baseType: !108, size: 64, offset: 640)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyAsyncMethods", file: !73, line: 135, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 130, size: 256, elements: !111)
!111 = !{!112, !117, !118, !119}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "am_await", scope: !110, file: !73, line: 131, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !6, line: 336, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!46, !46}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "am_aiter", scope: !110, file: !73, line: 132, baseType: !113, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "am_anext", scope: !110, file: !73, line: 133, baseType: !113, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "am_send", scope: !110, file: !73, line: 134, baseType: !120, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "sendfunc", file: !73, line: 128, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!124, !46, !46, !125}
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySendResult", file: !6, line: 699, baseType: !5)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !72, file: !73, line: 161, baseType: !127, size: 64, offset: 704)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !6, line: 358, baseType: !114)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !72, file: !73, line: 165, baseType: !129, size: 64, offset: 768)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !73, line: 106, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 61, size: 2304, elements: !132)
!132 = !{!133, !138, !139, !140, !141, !142, !147, !148, !149, !150, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !131, file: !73, line: 66, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !6, line: 337, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!46, !46, !46}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !131, file: !73, line: 67, baseType: !134, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !131, file: !73, line: 68, baseType: !134, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !131, file: !73, line: 69, baseType: !134, size: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !131, file: !73, line: 70, baseType: !134, size: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !131, file: !73, line: 71, baseType: !143, size: 64, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !6, line: 338, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!46, !46, !46, !46}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !131, file: !73, line: 72, baseType: !113, size: 64, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !131, file: !73, line: 73, baseType: !113, size: 64, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !131, file: !73, line: 74, baseType: !113, size: 64, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !131, file: !73, line: 75, baseType: !151, size: 64, offset: 576)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !6, line: 339, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!7, !46}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !131, file: !73, line: 76, baseType: !113, size: 64, offset: 640)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !131, file: !73, line: 77, baseType: !134, size: 64, offset: 704)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !131, file: !73, line: 78, baseType: !134, size: 64, offset: 768)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !131, file: !73, line: 79, baseType: !134, size: 64, offset: 832)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !131, file: !73, line: 80, baseType: !134, size: 64, offset: 896)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !131, file: !73, line: 81, baseType: !134, size: 64, offset: 960)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !131, file: !73, line: 82, baseType: !113, size: 64, offset: 1024)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !131, file: !73, line: 83, baseType: !45, size: 64, offset: 1088)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !131, file: !73, line: 84, baseType: !113, size: 64, offset: 1152)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !131, file: !73, line: 86, baseType: !134, size: 64, offset: 1216)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !131, file: !73, line: 87, baseType: !134, size: 64, offset: 1280)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !131, file: !73, line: 88, baseType: !134, size: 64, offset: 1344)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !131, file: !73, line: 89, baseType: !134, size: 64, offset: 1408)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !131, file: !73, line: 90, baseType: !143, size: 64, offset: 1472)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !131, file: !73, line: 91, baseType: !134, size: 64, offset: 1536)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !131, file: !73, line: 92, baseType: !134, size: 64, offset: 1600)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !131, file: !73, line: 93, baseType: !134, size: 64, offset: 1664)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !131, file: !73, line: 94, baseType: !134, size: 64, offset: 1728)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !131, file: !73, line: 95, baseType: !134, size: 64, offset: 1792)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !131, file: !73, line: 97, baseType: !134, size: 64, offset: 1856)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !131, file: !73, line: 98, baseType: !134, size: 64, offset: 1920)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !131, file: !73, line: 99, baseType: !134, size: 64, offset: 1984)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !131, file: !73, line: 100, baseType: !134, size: 64, offset: 2048)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !131, file: !73, line: 102, baseType: !113, size: 64, offset: 2112)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_matrix_multiply", scope: !131, file: !73, line: 104, baseType: !134, size: 64, offset: 2176)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_matrix_multiply", scope: !131, file: !73, line: 105, baseType: !134, size: 64, offset: 2240)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !72, file: !73, line: 166, baseType: !182, size: 64, offset: 832)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !73, line: 120, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 108, size: 640, elements: !185)
!185 = !{!186, !191, !192, !197, !198, !199, !204, !205, !210, !211}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !184, file: !73, line: 109, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !6, line: 340, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!81, !46}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !184, file: !73, line: 110, baseType: !134, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !184, file: !73, line: 111, baseType: !193, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !6, line: 341, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!46, !46, !81}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !184, file: !73, line: 112, baseType: !193, size: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !184, file: !73, line: 113, baseType: !45, size: 64, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !184, file: !73, line: 114, baseType: !200, size: 64, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !6, line: 343, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!7, !46, !81, !46}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !184, file: !73, line: 115, baseType: !45, size: 64, offset: 384)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !184, file: !73, line: 116, baseType: !206, size: 64, offset: 448)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !6, line: 347, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!7, !46, !46}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !184, file: !73, line: 118, baseType: !134, size: 64, offset: 512)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !184, file: !73, line: 119, baseType: !193, size: 64, offset: 576)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !72, file: !73, line: 167, baseType: !213, size: 64, offset: 896)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !73, line: 126, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 122, size: 192, elements: !216)
!216 = !{!217, !218, !219}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !215, file: !73, line: 123, baseType: !187, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !215, file: !73, line: 124, baseType: !134, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !215, file: !73, line: 125, baseType: !220, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !6, line: 345, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!7, !46, !46, !46}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !72, file: !73, line: 171, baseType: !225, size: 64, offset: 960)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !6, line: 359, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!229, !46}
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !82, line: 170, baseType: !81)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !72, file: !73, line: 172, baseType: !143, size: 64, offset: 1024)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !72, file: !73, line: 173, baseType: !127, size: 64, offset: 1088)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !72, file: !73, line: 174, baseType: !233, size: 64, offset: 1152)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !6, line: 355, baseType: !135)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !72, file: !73, line: 175, baseType: !235, size: 64, offset: 1216)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !6, line: 357, baseType: !221)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !72, file: !73, line: 178, baseType: !237, size: 64, offset: 1280)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !73, line: 140, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 137, size: 128, elements: !240)
!240 = !{!241, !263}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !239, file: !73, line: 138, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !243, line: 35, baseType: !244)
!243 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pybuffer.h", directory: "")
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!7, !46, !247, !7}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !243, line: 33, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !243, line: 20, size: 640, elements: !250)
!250 = !{!251, !252, !253, !254, !255, !256, !257, !258, !260, !261, !262}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !249, file: !243, line: 21, baseType: !45, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !249, file: !243, line: 22, baseType: !46, size: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !249, file: !243, line: 23, baseType: !81, size: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !249, file: !243, line: 24, baseType: !81, size: 64, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !249, file: !243, line: 26, baseType: !7, size: 32, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !249, file: !243, line: 27, baseType: !7, size: 32, offset: 288)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !249, file: !243, line: 28, baseType: !101, size: 64, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !249, file: !243, line: 29, baseType: !259, size: 64, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !249, file: !243, line: 30, baseType: !259, size: 64, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !249, file: !243, line: 31, baseType: !259, size: 64, offset: 512)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !249, file: !243, line: 32, baseType: !45, size: 64, offset: 576)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !239, file: !73, line: 139, baseType: !264, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !243, line: 36, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !46, !247}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !72, file: !73, line: 181, baseType: !44, size: 64, offset: 1344)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !72, file: !73, line: 183, baseType: !25, size: 64, offset: 1408)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !72, file: !73, line: 187, baseType: !271, size: 64, offset: 1472)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !6, line: 349, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!7, !46, !275, !45}
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !6, line: 348, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!7, !46, !45}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !72, file: !73, line: 190, baseType: !151, size: 64, offset: 1536)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !72, file: !73, line: 194, baseType: !281, size: 64, offset: 1600)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !6, line: 360, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!46, !46, !46, !7}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !72, file: !73, line: 197, baseType: !81, size: 64, offset: 1664)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !72, file: !73, line: 200, baseType: !287, size: 64, offset: 1728)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !6, line: 361, baseType: !114)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !72, file: !73, line: 201, baseType: !289, size: 64, offset: 1792)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !6, line: 362, baseType: !114)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !72, file: !73, line: 204, baseType: !291, size: 64, offset: 1856)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !48, line: 14, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !294, line: 68, size: 256, elements: !295)
!294 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/methodobject.h", directory: "")
!295 = !{!296, !297, !299, !300}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !293, file: !294, line: 69, baseType: !25, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !293, file: !294, line: 70, baseType: !298, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !294, line: 19, baseType: !135)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !293, file: !294, line: 71, baseType: !7, size: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !293, file: !294, line: 73, baseType: !25, size: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !72, file: !73, line: 205, baseType: !302, size: 64, offset: 1920)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !48, line: 16, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !305, line: 41, size: 320, elements: !306)
!305 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/descrobject.h", directory: "")
!306 = !{!307, !308, !309, !310, !311}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !304, file: !305, line: 42, baseType: !25, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !304, file: !305, line: 43, baseType: !7, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !304, file: !305, line: 44, baseType: !81, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !304, file: !305, line: 45, baseType: !7, size: 32, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !304, file: !305, line: 46, baseType: !25, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !72, file: !73, line: 206, baseType: !313, size: 64, offset: 1984)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGetSetDef", file: !48, line: 15, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !305, line: 11, size: 320, elements: !316)
!316 = !{!317, !318, !323, !328, !329}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !315, file: !305, line: 12, baseType: !25, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !315, file: !305, line: 13, baseType: !319, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !305, line: 8, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!46, !46, !45}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !315, file: !305, line: 14, baseType: !324, size: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !305, line: 9, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!7, !46, !46, !45}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !315, file: !305, line: 15, baseType: !25, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !315, file: !305, line: 16, baseType: !45, size: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !72, file: !73, line: 208, baseType: !70, size: 64, offset: 2048)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !72, file: !73, line: 209, baseType: !46, size: 64, offset: 2112)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !72, file: !73, line: 210, baseType: !333, size: 64, offset: 2176)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !6, line: 363, baseType: !144)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !72, file: !73, line: 211, baseType: !335, size: 64, offset: 2240)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !6, line: 364, baseType: !221)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !72, file: !73, line: 212, baseType: !81, size: 64, offset: 2304)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !72, file: !73, line: 213, baseType: !338, size: 64, offset: 2368)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !6, line: 365, baseType: !221)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !72, file: !73, line: 214, baseType: !340, size: 64, offset: 2432)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !6, line: 367, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!46, !70, !81}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !72, file: !73, line: 215, baseType: !345, size: 64, offset: 2496)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !6, line: 366, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!46, !70, !46, !46}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !72, file: !73, line: 216, baseType: !350, size: 64, offset: 2560)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !6, line: 352, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !45}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !72, file: !73, line: 217, baseType: !151, size: 64, offset: 2624)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !72, file: !73, line: 218, baseType: !46, size: 64, offset: 2688)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !72, file: !73, line: 219, baseType: !46, size: 64, offset: 2752)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !72, file: !73, line: 220, baseType: !46, size: 64, offset: 2816)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !72, file: !73, line: 221, baseType: !45, size: 64, offset: 2880)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !72, file: !73, line: 222, baseType: !46, size: 64, offset: 2944)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !72, file: !73, line: 223, baseType: !91, size: 64, offset: 3008)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !72, file: !73, line: 228, baseType: !14, size: 32, offset: 3072)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !72, file: !73, line: 230, baseType: !91, size: 64, offset: 3136)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall", scope: !72, file: !73, line: 231, baseType: !364, size: 64, offset: 3200)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "vectorcallfunc", file: !6, line: 370, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!46, !46, !368, !41, !46}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tp_watched", scope: !72, file: !73, line: 234, baseType: !371, size: 8, offset: 3264)
!371 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tp_versions_used", scope: !72, file: !73, line: 241, baseType: !65, size: 16, offset: 3280)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !374, line: 30, baseType: !7)
!374 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_int32_t.h", directory: "")
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !377, line: 15, baseType: !378)
!377 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/bytesobject.h", directory: "")
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !377, line: 5, size: 320, elements: !379)
!379 = !{!380, !381, !382}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !378, file: !377, line: 6, baseType: !76, size: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !378, file: !377, line: 7, baseType: !229, size: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !378, file: !377, line: 8, baseType: !383, size: 8, offset: 256)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 1)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunctionObject", file: !388, line: 14, baseType: !389)
!388 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/methodobject.h", directory: "")
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !388, line: 7, size: 448, elements: !390)
!390 = !{!391, !392, !393, !394, !395, !396}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !389, file: !388, line: 8, baseType: !47, size: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "m_ml", scope: !389, file: !388, line: 9, baseType: !291, size: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "m_self", scope: !389, file: !388, line: 10, baseType: !46, size: 64, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "m_module", scope: !389, file: !388, line: 11, baseType: !46, size: 64, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "m_weakreflist", scope: !389, file: !388, line: 12, baseType: !46, size: 64, offset: 320)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "vectorcall", scope: !389, file: !388, line: 13, baseType: !364, size: 64, offset: 384)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pyx_CyFunctionObject", file: !399, line: 1972, baseType: !400)
!399 = !DIFile(filename: "dataset/cases/goeq-ojva-0127/artifacts/cython-clang-llvm-o0-embed-v1/prog_a/program.c", directory: ".")
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 1938, size: 1344, elements: !401)
!401 = !{!402, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !400, file: !399, line: 1945, baseType: !403, size: 512)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCMethodObject", file: !388, line: 26, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !388, line: 23, size: 512, elements: !405)
!405 = !{!406, !407}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !404, file: !388, line: 24, baseType: !387, size: 448)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "mm_class", scope: !404, file: !388, line: 25, baseType: !70, size: 64, offset: 448)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "func_name", scope: !400, file: !399, line: 1956, baseType: !46, size: 64, offset: 512)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "func_qualname", scope: !400, file: !399, line: 1957, baseType: !46, size: 64, offset: 576)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "func_doc", scope: !400, file: !399, line: 1958, baseType: !46, size: 64, offset: 640)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "func_globals", scope: !400, file: !399, line: 1959, baseType: !46, size: 64, offset: 704)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "func_code", scope: !400, file: !399, line: 1960, baseType: !46, size: 64, offset: 768)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "func_closure", scope: !400, file: !399, line: 1961, baseType: !46, size: 64, offset: 832)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !400, file: !399, line: 1965, baseType: !46, size: 64, offset: 896)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !400, file: !399, line: 1966, baseType: !7, size: 32, offset: 960)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "defaults_tuple", scope: !400, file: !399, line: 1967, baseType: !46, size: 64, offset: 1024)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "defaults_kwdict", scope: !400, file: !399, line: 1968, baseType: !46, size: 64, offset: 1088)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "defaults_getter", scope: !400, file: !399, line: 1969, baseType: !114, size: 64, offset: 1152)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "func_annotations", scope: !400, file: !399, line: 1970, baseType: !46, size: 64, offset: 1216)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "func_is_coroutine", scope: !400, file: !399, line: 1971, baseType: !46, size: 64, offset: 1280)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !423, line: 13, baseType: !424)
!423 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/tupleobject.h", directory: "")
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !423, line: 5, size: 320, elements: !425)
!425 = !{!426, !427, !428}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !424, file: !423, line: 6, baseType: !76, size: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ob_hash", scope: !424, file: !423, line: 8, baseType: !229, size: 64, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !424, file: !423, line: 12, baseType: !429, size: 64, offset: 256)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 64, elements: !384)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictObject", file: !432, line: 33, baseType: !433)
!432 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/dictobject.h", directory: "")
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !432, line: 11, size: 384, elements: !434)
!434 = !{!435, !436, !437, !441, !445}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !433, file: !432, line: 12, baseType: !47, size: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ma_used", scope: !433, file: !432, line: 15, baseType: !81, size: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_ma_watcher_tag", scope: !433, file: !432, line: 23, baseType: !438, size: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !439, line: 31, baseType: !440)
!439 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint64_t.h", directory: "")
!440 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ma_keys", scope: !433, file: !432, line: 25, baseType: !442, size: 64, offset: 256)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictKeysObject", file: !432, line: 5, baseType: !444)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "_dictkeysobject", file: !73, line: 280, flags: DIFlagFwdDecl)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ma_values", scope: !433, file: !432, line: 32, baseType: !446, size: 64, offset: 320)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictValues", file: !432, line: 6, baseType: !448)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "_dictvalues", file: !432, line: 6, flags: DIFlagFwdDecl)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunctionWithKeywords", file: !294, line: 21, baseType: !144)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{null}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !457, line: 22, baseType: !458)
!457 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/listobject.h", directory: "")
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !457, line: 5, size: 320, elements: !459)
!459 = !{!460, !461, !462}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !458, file: !457, line: 6, baseType: !76, size: 192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !458, file: !457, line: 8, baseType: !125, size: 64, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !458, file: !457, line: 21, baseType: !81, size: 64, offset: 256)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCMethod", file: !294, line: 26, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!46, !46, !70, !368, !81, !46}
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunctionFastWithKeywords", file: !294, line: 23, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!46, !46, !368, !81, !46}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyLongObject", file: !48, line: 19, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_longobject", file: !474, line: 98, size: 256, elements: !475)
!474 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/longintrepr.h", directory: "")
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !473, file: !474, line: 99, baseType: !47, size: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "long_value", scope: !473, file: !474, line: 100, baseType: !478, size: 128, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyLongValue", file: !474, line: 96, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PyLongValue", file: !474, line: 93, size: 128, elements: !480)
!480 = !{!481, !484}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "lv_tag", scope: !479, file: !474, line: 94, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !483, line: 34, baseType: !44)
!483 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ob_digit", scope: !479, file: !474, line: 95, baseType: !485, size: 32, offset: 64)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 32, elements: !384)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "digit", file: !474, line: 43, baseType: !62)
!487 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFloatObject", file: !490, line: 8, baseType: !491)
!490 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/floatobject.h", directory: "")
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !490, line: 5, size: 192, elements: !492)
!492 = !{!493, !494}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !491, file: !490, line: 6, baseType: !47, size: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ob_fval", scope: !491, file: !490, line: 7, baseType: !487, size: 64, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !13, line: 163, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 54, size: 320, elements: !498)
!498 = !{!499, !500, !501, !502}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !497, file: !13, line: 99, baseType: !47, size: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !497, file: !13, line: 100, baseType: !81, size: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !497, file: !13, line: 101, baseType: !229, size: 64, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !497, file: !13, line: 162, baseType: !503, size: 32, offset: 256)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !497, file: !13, line: 107, size: 32, elements: !504)
!504 = !{!505, !506, !507, !508, !509}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !503, file: !13, line: 121, baseType: !14, size: 2, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !503, file: !13, line: 145, baseType: !14, size: 3, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !503, file: !13, line: 150, baseType: !14, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !503, file: !13, line: 154, baseType: !14, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "statically_allocated", scope: !503, file: !13, line: 156, baseType: !14, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !13, line: 173, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 168, size: 448, elements: !515)
!515 = !{!516, !517, !518}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !514, file: !13, line: 169, baseType: !496, size: 320)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !514, file: !13, line: 170, baseType: !81, size: 64, offset: 320)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !514, file: !13, line: 172, baseType: !101, size: 64, offset: 384)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !13, line: 184, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 176, size: 512, elements: !522)
!522 = !{!523, !524}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !521, file: !13, line: 177, baseType: !513, size: 448)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !521, file: !13, line: 183, baseType: !525, size: 64, offset: 448)
!525 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !521, file: !13, line: 178, size: 64, elements: !526)
!526 = !{!527, !528, !534, !537}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !525, file: !13, line: 179, baseType: !45, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !525, file: !13, line: 180, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !531, line: 96, baseType: !532)
!531 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/unicodeobject.h", directory: "")
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !533, line: 31, baseType: !371)
!533 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint8_t.h", directory: "")
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !525, file: !13, line: 181, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !531, line: 95, baseType: !65)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !525, file: !13, line: 182, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !531, line: 94, baseType: !62)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !530)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !536)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !539)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBaseExceptionObject", file: !548, line: 15, baseType: !549)
!548 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/pyerrors.h", directory: "")
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !548, line: 13, size: 576, elements: !550)
!550 = !{!551, !552, !553, !554, !555, !556, !557, !558}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !549, file: !548, line: 14, baseType: !47, size: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !549, file: !548, line: 14, baseType: !46, size: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !549, file: !548, line: 14, baseType: !46, size: 64, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !549, file: !548, line: 14, baseType: !46, size: 64, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", scope: !549, file: !548, line: 14, baseType: !46, size: 64, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !549, file: !548, line: 14, baseType: !46, size: 64, offset: 384)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "cause", scope: !549, file: !548, line: 14, baseType: !46, size: 64, offset: 448)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_context", scope: !549, file: !548, line: 14, baseType: !27, size: 8, offset: 512)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CodeObjectCacheEntry", file: !399, line: 2030, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 2027, size: 128, elements: !562)
!562 = !{!563, !621}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "code_object", scope: !561, file: !399, line: 2028, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CachedCodeObjectType", file: !399, line: 2025, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !48, line: 21, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyCodeObject", file: !568, line: 115, size: 1728, elements: !569)
!568 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/code.h", directory: "")
!569 = !{!570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !604, !613, !614, !617, !618, !619, !620}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !567, file: !568, line: 115, baseType: !76, size: 192)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !567, file: !568, line: 115, baseType: !46, size: 64, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !567, file: !568, line: 115, baseType: !46, size: 64, offset: 256)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "co_exceptiontable", scope: !567, file: !568, line: 115, baseType: !46, size: 64, offset: 320)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !567, file: !568, line: 115, baseType: !7, size: 32, offset: 384)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !567, file: !568, line: 115, baseType: !7, size: 32, offset: 416)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "co_posonlyargcount", scope: !567, file: !568, line: 115, baseType: !7, size: 32, offset: 448)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !567, file: !568, line: 115, baseType: !7, size: 32, offset: 480)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !567, file: !568, line: 115, baseType: !7, size: 32, offset: 512)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !567, file: !568, line: 115, baseType: !7, size: 32, offset: 544)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocalsplus", scope: !567, file: !568, line: 115, baseType: !7, size: 32, offset: 576)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "co_framesize", scope: !567, file: !568, line: 115, baseType: !7, size: 32, offset: 608)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !567, file: !568, line: 115, baseType: !7, size: 32, offset: 640)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "co_ncellvars", scope: !567, file: !568, line: 115, baseType: !7, size: 32, offset: 672)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "co_nfreevars", scope: !567, file: !568, line: 115, baseType: !7, size: 32, offset: 704)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "co_version", scope: !567, file: !568, line: 115, baseType: !62, size: 32, offset: 736)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "co_localsplusnames", scope: !567, file: !568, line: 115, baseType: !46, size: 64, offset: 768)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "co_localspluskinds", scope: !567, file: !568, line: 115, baseType: !46, size: 64, offset: 832)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !567, file: !568, line: 115, baseType: !46, size: 64, offset: 896)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !567, file: !568, line: 115, baseType: !46, size: 64, offset: 960)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "co_qualname", scope: !567, file: !568, line: 115, baseType: !46, size: 64, offset: 1024)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "co_linetable", scope: !567, file: !568, line: 115, baseType: !46, size: 64, offset: 1088)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !567, file: !568, line: 115, baseType: !46, size: 64, offset: 1152)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "co_executors", scope: !567, file: !568, line: 115, baseType: !594, size: 64, offset: 1216)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyExecutorArray", file: !568, line: 22, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !568, line: 18, size: 128, elements: !597)
!597 = !{!598, !599, !600}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !596, file: !568, line: 19, baseType: !7, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !596, file: !568, line: 20, baseType: !7, size: 32, offset: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "executors", scope: !596, file: !568, line: 21, baseType: !601, size: 64, offset: 64)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 64, elements: !384)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyExecutorObject", file: !568, line: 21, flags: DIFlagFwdDecl)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_co_cached", scope: !567, file: !568, line: 115, baseType: !605, size: 64, offset: 1280)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyCoCached", file: !568, line: 16, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !568, line: 11, size: 256, elements: !608)
!608 = !{!609, !610, !611, !612}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_co_code", scope: !607, file: !568, line: 12, baseType: !46, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_co_varnames", scope: !607, file: !568, line: 13, baseType: !46, size: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_co_cellvars", scope: !607, file: !568, line: 14, baseType: !46, size: 64, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_co_freevars", scope: !607, file: !568, line: 15, baseType: !46, size: 64, offset: 192)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_co_instrumentation_version", scope: !567, file: !568, line: 115, baseType: !482, size: 64, offset: 1344)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_co_monitoring", scope: !567, file: !568, line: 115, baseType: !615, size: 64, offset: 1408)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyCoMonitoringData", file: !568, line: 115, flags: DIFlagFwdDecl)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_co_unique_id", scope: !567, file: !568, line: 115, baseType: !81, size: 64, offset: 1472)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_co_firsttraceable", scope: !567, file: !568, line: 115, baseType: !7, size: 32, offset: 1536)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "co_extra", scope: !567, file: !568, line: 115, baseType: !45, size: 64, offset: 1600)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "co_code_adaptive", scope: !567, file: !568, line: 115, baseType: !383, size: 8, offset: 1664)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "code_line", scope: !561, file: !399, line: 2029, baseType: !7, size: 32, offset: 64)
!622 = !{!0, !623, !628, !630, !635, !665, !668, !673, !678, !683, !688, !690, !692, !694, !699, !704, !706, !712, !717, !719, !724, !762, !764, !769, !774, !779, !781, !786, !790, !795, !797, !799, !804, !809, !814, !816, !818, !820, !825, !827, !829, !831, !836, !838, !841, !846, !851, !856, !858, !863, !868, !873, !889, !892, !894, !897, !902, !904, !907, !912, !914, !919, !924, !927, !929, !931, !936, !939, !941, !943, !945, !950, !955, !957, !962, !964, !966, !971, !974, !976, !978, !981, !983, !988, !990, !992, !995, !1000, !1002, !1005, !1007, !1010, !1012, !1014, !1016, !1018, !1020, !1022, !1024, !1026, !1028, !1030, !1032, !1034, !1036, !1038, !1040, !1042, !1045, !1047, !1052, !1057, !1059, !1064, !1066, !1068, !1073, !1078, !1080, !1082, !1084, !1086, !1088, !1090, !1092, !1094, !1096, !1098, !1100, !1102, !1104, !1106, !1109, !1111, !1113, !1116, !1118, !1120, !1122, !1125, !1128, !1131, !1136, !1138, !1141, !1143, !1148, !1151, !1153, !1156, !1158, !1160, !1162, !1164, !1166, !1171, !1173, !1175}
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !399, line: 6170, type: !625, isLocal: true, isDefinition: true)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 128, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 16)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !399, line: 6177, type: !383, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2613, type: !632, isLocal: true, isDefinition: true)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 72, elements: !633)
!633 = !{!634}
!634 = !DISubrange(count: 9)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "__pyx_moduledef", scope: !2, file: !399, line: 2609, type: !637, isLocal: true, isDefinition: true)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !638, line: 107, size: 832, elements: !639)
!638 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/moduleobject.h", directory: "")
!639 = !{!640, !651, !652, !653, !654, !655, !662, !663, !664}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !637, file: !638, line: 108, baseType: !641, size: 320)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !638, line: 58, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !638, line: 39, size: 320, elements: !643)
!643 = !{!644, !645, !649, !650}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !642, file: !638, line: 40, baseType: !47, size: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !642, file: !638, line: 47, baseType: !646, size: 64, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!46}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !642, file: !638, line: 52, baseType: !81, size: 64, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !642, file: !638, line: 57, baseType: !46, size: 64, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !637, file: !638, line: 109, baseType: !25, size: 64, offset: 320)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !637, file: !638, line: 110, baseType: !25, size: 64, offset: 384)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !637, file: !638, line: 111, baseType: !81, size: 64, offset: 448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !637, file: !638, line: 112, baseType: !291, size: 64, offset: 512)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "m_slots", scope: !637, file: !638, line: 113, baseType: !656, size: 64, offset: 576)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Slot", file: !48, line: 13, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Slot", file: !638, line: 69, size: 128, elements: !659)
!659 = !{!660, !661}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !658, file: !638, line: 70, baseType: !7, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !658, file: !638, line: 71, baseType: !45, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !637, file: !638, line: 114, baseType: !271, size: 64, offset: 640)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !637, file: !638, line: 115, baseType: !151, size: 64, offset: 704)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !637, file: !638, line: 116, baseType: !350, size: 64, offset: 768)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "__pyx_methods", scope: !2, file: !399, line: 2508, type: !667, isLocal: true, isDefinition: true)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 256, elements: !384)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(name: "__pyx_moduledef_slots", scope: !2, file: !399, line: 2592, type: !670, isLocal: true, isDefinition: true)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, size: 384, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 3)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2741, type: !675, isLocal: true, isDefinition: true)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 40, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 5)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2748, type: !680, isLocal: true, isDefinition: true)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 56, elements: !681)
!681 = !{!682}
!682 = !DISubrange(count: 7)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2748, type: !685, isLocal: true, isDefinition: true)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 88, elements: !686)
!686 = !{!687}
!687 = !DISubrange(count: 11)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2749, type: !680, isLocal: true, isDefinition: true)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2749, type: !632, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2750, type: !680, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2750, type: !696, isLocal: true, isDefinition: true)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 96, elements: !697)
!697 = !{!698}
!698 = !DISubrange(count: 12)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2751, type: !701, isLocal: true, isDefinition: true)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 216, elements: !702)
!702 = !{!703}
!703 = !DISubrange(count: 27)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2751, type: !632, isLocal: true, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(name: "main_interpreter_id", scope: !708, file: !399, line: 2688, type: !55, isLocal: true, isDefinition: true)
!708 = distinct !DISubprogram(name: "__Pyx_check_single_interpreter", scope: !399, file: !399, line: 2687, type: !709, scopeLine: 2687, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !711)
!709 = !DISubroutineType(types: !710)
!710 = !{!7}
!711 = !{}
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2710, type: !714, isLocal: true, isDefinition: true)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 760, elements: !715)
!715 = !{!716}
!716 = !DISubrange(count: 95)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "__pyx_m", scope: !2, file: !399, line: 1326, type: !46, isLocal: true, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2780, type: !721, isLocal: true, isDefinition: true)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 648, elements: !722)
!722 = !{!723}
!723 = !DISubrange(count: 81)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(name: "__pyx_mstate_global", scope: !2, file: !399, line: 2258, type: !726, isLocal: true, isDefinition: true)
!726 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !727)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pyx_mstatetype", file: !399, line: 2237, baseType: !729)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 2209, size: 3200, elements: !730)
!730 = !{!731, !732, !733, !734, !735, !736, !737, !746, !747, !748, !750, !754, !755, !756}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_d", scope: !729, file: !399, line: 2210, baseType: !46, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_b", scope: !729, file: !399, line: 2211, baseType: !46, size: 64, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_cython_runtime", scope: !729, file: !399, line: 2212, baseType: !46, size: 64, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_tuple", scope: !729, file: !399, line: 2213, baseType: !46, size: 64, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_bytes", scope: !729, file: !399, line: 2214, baseType: !46, size: 64, offset: 256)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_unicode", scope: !729, file: !399, line: 2215, baseType: !46, size: 64, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_umethod_PyDict_Type_items", scope: !729, file: !399, line: 2216, baseType: !738, size: 320, offset: 384)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CachedCFunction", file: !399, line: 1869, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 1860, size: 320, elements: !740)
!740 = !{!741, !742, !743, !744, !745}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !739, file: !399, line: 1861, baseType: !46, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "method_name", scope: !739, file: !399, line: 1862, baseType: !125, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !739, file: !399, line: 1866, baseType: !298, size: 64, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !739, file: !399, line: 1867, baseType: !46, size: 64, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !739, file: !399, line: 1868, baseType: !7, size: 32, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_umethod_PyDict_Type_values", scope: !729, file: !399, line: 2217, baseType: !738, size: 320, offset: 704)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_codeobj_tab", scope: !729, file: !399, line: 2218, baseType: !429, size: 64, offset: 1024)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_string_tab", scope: !729, file: !399, line: 2219, baseType: !749, size: 1728, offset: 1088)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 1728, elements: !702)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_number_tab", scope: !729, file: !399, line: 2220, baseType: !751, size: 128, offset: 2816)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 128, elements: !752)
!752 = !{!753}
!753 = !DISubrange(count: 2)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_CommonTypesMetaclassType", scope: !729, file: !399, line: 2223, baseType: !70, size: 64, offset: 2944)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_CyFunctionType", scope: !729, file: !399, line: 2231, baseType: !70, size: 64, offset: 3008)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_code_cache", scope: !729, file: !399, line: 2234, baseType: !757, size: 128, offset: 3072)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__Pyx_CodeObjectCache", file: !399, line: 2031, size: 128, elements: !758)
!758 = !{!759, !760, !761}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !757, file: !399, line: 2032, baseType: !7, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "max_count", scope: !757, file: !399, line: 2033, baseType: !7, size: 32, offset: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !757, file: !399, line: 2034, baseType: !559, size: 64, offset: 64)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2810, type: !632, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2811, type: !766, isLocal: true, isDefinition: true)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 120, elements: !767)
!767 = !{!768}
!768 = !DISubrange(count: 15)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2812, type: !771, isLocal: true, isDefinition: true)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 104, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 13)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2928, type: !776, isLocal: true, isDefinition: true)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 112, elements: !777)
!777 = !{!778}
!778 = !DISubrange(count: 14)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "__pyx_mstate_global_static", scope: !2, file: !399, line: 2252, type: !728, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !399, line: 1336, type: !783, isLocal: true, isDefinition: true)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 440, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 55)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "__pyx_f", scope: !2, file: !399, line: 1335, type: !788, isLocal: true, isDefinition: true)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !789, size: 64, elements: !384)
!789 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(scope: null, file: !399, line: 6988, type: !792, isLocal: true, isDefinition: true)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 624, elements: !793)
!793 = !{!794}
!794 = !DISubrange(count: 78)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(scope: null, file: !399, line: 6994, type: !766, isLocal: true, isDefinition: true)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(scope: null, file: !399, line: 6994, type: !766, isLocal: true, isDefinition: true)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2992, type: !801, isLocal: true, isDefinition: true)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 2112, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 264)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(scope: null, file: !399, line: 7145, type: !806, isLocal: true, isDefinition: true)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 136, elements: !807)
!807 = !{!808}
!808 = !DISubrange(count: 17)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(scope: null, file: !399, line: 7145, type: !811, isLocal: true, isDefinition: true)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 32, elements: !812)
!812 = !{!813}
!813 = !DISubrange(count: 4)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(scope: null, file: !399, line: 7145, type: !675, isLocal: true, isDefinition: true)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(scope: null, file: !399, line: 7146, type: !685, isLocal: true, isDefinition: true)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(scope: null, file: !399, line: 7150, type: !811, isLocal: true, isDefinition: true)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(scope: null, file: !399, line: 7197, type: !822, isLocal: true, isDefinition: true)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1224, elements: !823)
!823 = !{!824}
!824 = !DISubrange(count: 153)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "__pyx_filename", scope: !2, file: !399, line: 1331, type: !25, isLocal: true, isDefinition: true)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "__pyx_lineno", scope: !2, file: !399, line: 1328, type: !7, isLocal: true, isDefinition: true)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "__pyx_clineno", scope: !2, file: !399, line: 1329, type: !7, isLocal: true, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(scope: null, file: !377, line: 25, type: !833, isLocal: true, isDefinition: true)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 144, elements: !834)
!834 = !{!835}
!835 = !DISubrange(count: 18)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(scope: null, file: !377, line: 25, type: !776, isLocal: true, isDefinition: true)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(scope: null, file: !377, line: 25, type: !840, isLocal: true, isDefinition: true)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 144, elements: !834)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(scope: null, file: !399, line: 4397, type: !843, isLocal: true, isDefinition: true)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 240, elements: !844)
!844 = !{!845}
!845 = !DISubrange(count: 30)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(scope: null, file: !399, line: 4397, type: !848, isLocal: true, isDefinition: true)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 80, elements: !849)
!849 = !{!850}
!850 = !DISubrange(count: 10)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(scope: null, file: !399, line: 4397, type: !853, isLocal: true, isDefinition: true)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 392, elements: !854)
!854 = !{!855}
!855 = !DISubrange(count: 49)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(scope: null, file: !399, line: 4297, type: !776, isLocal: true, isDefinition: true)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(scope: null, file: !399, line: 4325, type: !860, isLocal: true, isDefinition: true)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 376, elements: !861)
!861 = !{!862}
!862 = !DISubrange(count: 47)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(scope: null, file: !399, line: 4344, type: !865, isLocal: true, isDefinition: true)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 496, elements: !866)
!866 = !{!867}
!867 = !DISubrange(count: 62)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(scope: null, file: !399, line: 4433, type: !870, isLocal: true, isDefinition: true)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 296, elements: !871)
!871 = !{!872}
!872 = !DISubrange(count: 37)
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(name: "__pyx_CommonTypesMetaclass_spec", scope: !2, file: !399, line: 4432, type: !875, isLocal: true, isDefinition: true)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyType_Spec", file: !6, line: 385, baseType: !876)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 379, size: 256, elements: !877)
!877 = !{!878, !879, !880, !881, !882}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !876, file: !6, line: 380, baseType: !25, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "basicsize", scope: !876, file: !6, line: 381, baseType: !7, size: 32, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !876, file: !6, line: 382, baseType: !7, size: 32, offset: 96)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !876, file: !6, line: 383, baseType: !14, size: 32, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !876, file: !6, line: 384, baseType: !883, size: 64, offset: 192)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyType_Slot", file: !6, line: 377, baseType: !885)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 374, size: 128, elements: !886)
!886 = !{!887, !888}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !885, file: !6, line: 375, baseType: !7, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "pfunc", scope: !885, file: !6, line: 376, baseType: !45, size: 64, offset: 64)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(name: "__pyx_CommonTypesMetaclass_slots", scope: !2, file: !399, line: 4423, type: !891, isLocal: true, isDefinition: true)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !884, size: 256, elements: !752)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(scope: null, file: !399, line: 4420, type: !685, isLocal: true, isDefinition: true)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(name: "__pyx_CommonTypesMetaclass_getset", scope: !2, file: !399, line: 4419, type: !896, isLocal: true, isDefinition: true)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 640, elements: !752)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5738, type: !899, isLocal: true, isDefinition: true)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 320, elements: !900)
!900 = !{!901}
!901 = !DISubrange(count: 40)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(name: "__pyx_CyFunctionType_spec", scope: !2, file: !399, line: 5737, type: !875, isLocal: true, isDefinition: true)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(name: "__pyx_CyFunctionType_slots", scope: !2, file: !399, line: 5725, type: !906, isLocal: true, isDefinition: true)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !884, size: 1280, elements: !849)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5438, type: !909, isLocal: true, isDefinition: true)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 176, elements: !910)
!910 = !{!911}
!911 = !DISubrange(count: 22)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5534, type: !843, isLocal: true, isDefinition: true)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5534, type: !916, isLocal: true, isDefinition: true)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 160, elements: !917)
!917 = !{!918}
!918 = !DISubrange(count: 20)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5558, type: !921, isLocal: true, isDefinition: true)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 336, elements: !922)
!922 = !{!923}
!923 = !DISubrange(count: 42)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(scope: null, file: !432, line: 55, type: !926, isLocal: true, isDefinition: true)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 128, elements: !626)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(scope: null, file: !432, line: 55, type: !771, isLocal: true, isDefinition: true)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(scope: null, file: !432, line: 55, type: !806, isLocal: true, isDefinition: true)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(scope: null, file: !399, line: 4745, type: !933, isLocal: true, isDefinition: true)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 200, elements: !934)
!934 = !{!935}
!935 = !DISubrange(count: 25)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(scope: null, file: !423, line: 34, type: !938, isLocal: true, isDefinition: true)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 136, elements: !807)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(scope: null, file: !423, line: 34, type: !776, isLocal: true, isDefinition: true)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(scope: null, file: !423, line: 34, type: !840, isLocal: true, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(scope: null, file: !423, line: 35, type: !685, isLocal: true, isDefinition: true)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(scope: null, file: !423, line: 36, type: !947, isLocal: true, isDefinition: true)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 184, elements: !948)
!948 = !{!949}
!949 = !DISubrange(count: 23)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !6, line: 284, type: !952, isLocal: true, isDefinition: true)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 64, elements: !953)
!953 = !{!954}
!954 = !DISubrange(count: 8)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(scope: null, file: !6, line: 284, type: !632, isLocal: true, isDefinition: true)
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(scope: null, file: !6, line: 284, type: !959, isLocal: true, isDefinition: true)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 224, elements: !960)
!960 = !{!961}
!961 = !DISubrange(count: 28)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(scope: null, file: !6, line: 285, type: !959, isLocal: true, isDefinition: true)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(scope: null, file: !423, line: 24, type: !938, isLocal: true, isDefinition: true)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5477, type: !968, isLocal: true, isDefinition: true)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 152, elements: !969)
!969 = !{!970}
!970 = !DISubrange(count: 19)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5492, type: !973, isLocal: true, isDefinition: true)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 224, elements: !960)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5492, type: !968, isLocal: true, isDefinition: true)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5504, type: !701, isLocal: true, isDefinition: true)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5509, type: !980, isLocal: true, isDefinition: true)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 240, elements: !844)
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5513, type: !701, isLocal: true, isDefinition: true)
!983 = !DIGlobalVariableExpression(var: !984, expr: !DIExpression())
!984 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5171, type: !985, isLocal: true, isDefinition: true)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 192, elements: !986)
!986 = !{!987}
!987 = !DISubrange(count: 24)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5186, type: !696, isLocal: true, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5264, type: !685, isLocal: true, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(name: "__pyx_CyFunction_methods", scope: !2, file: !399, line: 5263, type: !994, isLocal: true, isDefinition: true)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 512, elements: !752)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5242, type: !997, isLocal: true, isDefinition: true)
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 168, elements: !998)
!998 = !{!999}
!999 = !DISubrange(count: 21)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5247, type: !968, isLocal: true, isDefinition: true)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(name: "__pyx_CyFunction_members", scope: !2, file: !399, line: 5231, type: !1004, isLocal: true, isDefinition: true)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 1280, elements: !812)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5203, type: !632, isLocal: true, isDefinition: true)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5204, type: !1009, isLocal: true, isDefinition: true)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 64, elements: !953)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5205, type: !848, isLocal: true, isDefinition: true)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5206, type: !632, isLocal: true, isDefinition: true)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5207, type: !771, isLocal: true, isDefinition: true)
