; ModuleID = 'dataset/cases/goeq-oja-0008/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c'
source_filename = "dataset/cases/goeq-oja-0008/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx14.0.0"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr }
%struct.PyModuleDef_Base = type { %struct._object, ptr, i64, ptr }
%struct._object = type { %union.anon, ptr }
%union.anon = type { i64 }
%struct.PyMethodDef = type { ptr, ptr, i32, ptr }
%struct.__pyx_mstatetype = type { ptr, ptr, ptr, ptr, ptr, ptr, [3 x ptr], [14 x ptr], %struct.__Pyx_CodeObjectCache }
%struct.__Pyx_CodeObjectCache = type { i32, i32, ptr }
%struct.anon.1 = type { i8, [3 x i8] }
%struct._typeobject = type { %struct.PyVarObject, ptr, i64, i64, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, ptr, i8, i16 }
%struct.PyVarObject = type { %struct._object, i64 }
%struct.PyStatus = type { i32, ptr, ptr, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__pyx_module_is_main_original", scope: !2, file: !406, line: 1848, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Homebrew clang version 20.1.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !28, globals: !470, splitDebugInlining: false, nameTableKind: Apple, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk", sdk: "MacOSX14.sdk")
!3 = !DIFile(filename: "dataset/cases/goeq-oja-0008/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c", directory: ".")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 695, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/object.h", directory: "")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "PYGEN_RETURN", value: 0)
!10 = !DIEnumerator(name: "PYGEN_ERROR", value: -1)
!11 = !DIEnumerator(name: "PYGEN_NEXT", value: 1)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !14, file: !13, line: 11, baseType: !23, size: 32, elements: !24)
!13 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/initconfig.h", directory: "")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 10, size: 256, elements: !15)
!15 = !{!16, !17, !21, !22}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_type", scope: !14, file: !13, line: 15, baseType: !12, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !14, file: !13, line: 16, baseType: !18, size: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "err_msg", scope: !14, file: !13, line: 17, baseType: !18, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "exitcode", scope: !14, file: !13, line: 18, baseType: !7, size: 32, offset: 192)
!23 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!24 = !{!25, !26, !27}
!25 = !DIEnumerator(name: "_PyStatus_TYPE_OK", value: 0)
!26 = !DIEnumerator(name: "_PyStatus_TYPE_ERROR", value: 1)
!27 = !DIEnumerator(name: "_PyStatus_TYPE_EXIT", value: 2)
!28 = !{!29, !35, !39, !40, !367, !7, !18, !95, !369, !380, !391, !404}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !32, line: 34, baseType: !33)
!32 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_wchar_t.h", directory: "")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wchar_t", file: !34, line: 82, baseType: !7)
!34 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/arm/_types.h", directory: "")
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !36, line: 31, baseType: !37)
!36 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !34, line: 70, baseType: !38)
!38 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !42, line: 18, baseType: !43)
!42 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pytypedefs.h", directory: "")
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !6, line: 110, size: 128, elements: !44)
!44 = !{!45, !63}
!45 = !DIDerivedType(tag: DW_TAG_member, scope: !43, file: !6, line: 122, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !43, file: !6, line: 122, size: 64, elements: !47)
!47 = !{!48, !52}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt_full", scope: !46, file: !6, line: 124, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !50, line: 30, baseType: !51)
!50 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_int64_t.h", directory: "")
!51 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, scope: !46, file: !6, line: 125, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !46, file: !6, line: 125, size: 64, elements: !54)
!54 = !{!55, !58, !62}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !53, file: !6, line: 131, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !57, line: 31, baseType: !23)
!57 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint32_t.h", directory: "")
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ob_overflow", scope: !53, file: !6, line: 132, baseType: !59, size: 16, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !60, line: 31, baseType: !61)
!60 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint16_t.h", directory: "")
!61 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ob_flags", scope: !53, file: !6, line: 133, baseType: !59, size: 16, offset: 48)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !43, file: !6, line: 144, baseType: !64, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !42, line: 20, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !67, line: 148, size: 3328, elements: !68)
!67 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/object.h", directory: "")
!68 = !{!69, !81, !82, !83, !84, !89, !90, !96, !101, !120, !122, !175, !206, !218, !224, !225, !226, !228, !230, !262, !263, !264, !273, !274, !279, !280, !282, !284, !295, !306, !324, !325, !326, !328, !330, !331, !333, !338, !343, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !364, !366}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !66, file: !67, line: 149, baseType: !70, size: 192)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !6, line: 172, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 169, size: 192, elements: !72)
!72 = !{!73, !74}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !71, file: !6, line: 170, baseType: !41, size: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !71, file: !6, line: 171, baseType: !75, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !76, line: 156, baseType: !77)
!76 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pyport.h", directory: "")
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !78, line: 31, baseType: !79)
!78 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_ssize_t.h", directory: "")
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ssize_t", file: !34, line: 97, baseType: !80)
!80 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !66, file: !67, line: 150, baseType: !18, size: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !66, file: !67, line: 151, baseType: !75, size: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !66, file: !67, line: 151, baseType: !75, size: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !66, file: !67, line: 155, baseType: !85, size: 64, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !6, line: 353, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !40}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall_offset", scope: !66, file: !67, line: 156, baseType: !75, size: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !66, file: !67, line: 157, baseType: !91, size: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !6, line: 354, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!40, !40, !95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !66, file: !67, line: 158, baseType: !97, size: 64, offset: 576)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !6, line: 356, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!7, !40, !95, !40}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_async", scope: !66, file: !67, line: 159, baseType: !102, size: 64, offset: 640)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyAsyncMethods", file: !67, line: 135, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 130, size: 256, elements: !105)
!105 = !{!106, !111, !112, !113}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "am_await", scope: !104, file: !67, line: 131, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !6, line: 336, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!40, !40}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "am_aiter", scope: !104, file: !67, line: 132, baseType: !107, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "am_anext", scope: !104, file: !67, line: 133, baseType: !107, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "am_send", scope: !104, file: !67, line: 134, baseType: !114, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "sendfunc", file: !67, line: 128, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!118, !40, !40, !119}
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySendResult", file: !6, line: 699, baseType: !5)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !66, file: !67, line: 161, baseType: !121, size: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !6, line: 358, baseType: !108)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !66, file: !67, line: 165, baseType: !123, size: 64, offset: 768)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !67, line: 106, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 61, size: 2304, elements: !126)
!126 = !{!127, !132, !133, !134, !135, !136, !141, !142, !143, !144, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !125, file: !67, line: 66, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !6, line: 337, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!40, !40, !40}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !125, file: !67, line: 67, baseType: !128, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !125, file: !67, line: 68, baseType: !128, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !125, file: !67, line: 69, baseType: !128, size: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !125, file: !67, line: 70, baseType: !128, size: 64, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !125, file: !67, line: 71, baseType: !137, size: 64, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !6, line: 338, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!40, !40, !40, !40}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !125, file: !67, line: 72, baseType: !107, size: 64, offset: 384)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !125, file: !67, line: 73, baseType: !107, size: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !125, file: !67, line: 74, baseType: !107, size: 64, offset: 512)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !125, file: !67, line: 75, baseType: !145, size: 64, offset: 576)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !6, line: 339, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!7, !40}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !125, file: !67, line: 76, baseType: !107, size: 64, offset: 640)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !125, file: !67, line: 77, baseType: !128, size: 64, offset: 704)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !125, file: !67, line: 78, baseType: !128, size: 64, offset: 768)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !125, file: !67, line: 79, baseType: !128, size: 64, offset: 832)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !125, file: !67, line: 80, baseType: !128, size: 64, offset: 896)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !125, file: !67, line: 81, baseType: !128, size: 64, offset: 960)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !125, file: !67, line: 82, baseType: !107, size: 64, offset: 1024)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !125, file: !67, line: 83, baseType: !39, size: 64, offset: 1088)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !125, file: !67, line: 84, baseType: !107, size: 64, offset: 1152)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !125, file: !67, line: 86, baseType: !128, size: 64, offset: 1216)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !125, file: !67, line: 87, baseType: !128, size: 64, offset: 1280)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !125, file: !67, line: 88, baseType: !128, size: 64, offset: 1344)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !125, file: !67, line: 89, baseType: !128, size: 64, offset: 1408)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !125, file: !67, line: 90, baseType: !137, size: 64, offset: 1472)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !125, file: !67, line: 91, baseType: !128, size: 64, offset: 1536)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !125, file: !67, line: 92, baseType: !128, size: 64, offset: 1600)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !125, file: !67, line: 93, baseType: !128, size: 64, offset: 1664)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !125, file: !67, line: 94, baseType: !128, size: 64, offset: 1728)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !125, file: !67, line: 95, baseType: !128, size: 64, offset: 1792)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !125, file: !67, line: 97, baseType: !128, size: 64, offset: 1856)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !125, file: !67, line: 98, baseType: !128, size: 64, offset: 1920)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !125, file: !67, line: 99, baseType: !128, size: 64, offset: 1984)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !125, file: !67, line: 100, baseType: !128, size: 64, offset: 2048)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !125, file: !67, line: 102, baseType: !107, size: 64, offset: 2112)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_matrix_multiply", scope: !125, file: !67, line: 104, baseType: !128, size: 64, offset: 2176)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_matrix_multiply", scope: !125, file: !67, line: 105, baseType: !128, size: 64, offset: 2240)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !66, file: !67, line: 166, baseType: !176, size: 64, offset: 832)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !67, line: 120, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 108, size: 640, elements: !179)
!179 = !{!180, !185, !186, !191, !192, !193, !198, !199, !204, !205}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !178, file: !67, line: 109, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !6, line: 340, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!75, !40}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !178, file: !67, line: 110, baseType: !128, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !178, file: !67, line: 111, baseType: !187, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !6, line: 341, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!40, !40, !75}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !178, file: !67, line: 112, baseType: !187, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !178, file: !67, line: 113, baseType: !39, size: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !178, file: !67, line: 114, baseType: !194, size: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !6, line: 343, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!7, !40, !75, !40}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !178, file: !67, line: 115, baseType: !39, size: 64, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !178, file: !67, line: 116, baseType: !200, size: 64, offset: 448)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !6, line: 347, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!7, !40, !40}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !178, file: !67, line: 118, baseType: !128, size: 64, offset: 512)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !178, file: !67, line: 119, baseType: !187, size: 64, offset: 576)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !66, file: !67, line: 167, baseType: !207, size: 64, offset: 896)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !67, line: 126, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 122, size: 192, elements: !210)
!210 = !{!211, !212, !213}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !209, file: !67, line: 123, baseType: !181, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !209, file: !67, line: 124, baseType: !128, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !209, file: !67, line: 125, baseType: !214, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !6, line: 345, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!7, !40, !40, !40}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !66, file: !67, line: 171, baseType: !219, size: 64, offset: 960)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !6, line: 359, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!223, !40}
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !76, line: 170, baseType: !75)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !66, file: !67, line: 172, baseType: !137, size: 64, offset: 1024)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !66, file: !67, line: 173, baseType: !121, size: 64, offset: 1088)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !66, file: !67, line: 174, baseType: !227, size: 64, offset: 1152)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !6, line: 355, baseType: !129)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !66, file: !67, line: 175, baseType: !229, size: 64, offset: 1216)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !6, line: 357, baseType: !215)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !66, file: !67, line: 178, baseType: !231, size: 64, offset: 1280)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !67, line: 140, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 137, size: 128, elements: !234)
!234 = !{!235, !257}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !233, file: !67, line: 138, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !237, line: 35, baseType: !238)
!237 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pybuffer.h", directory: "")
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!7, !40, !241, !7}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !237, line: 33, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !237, line: 20, size: 640, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !254, !255, !256}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !243, file: !237, line: 21, baseType: !39, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !243, file: !237, line: 22, baseType: !40, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !243, file: !237, line: 23, baseType: !75, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !243, file: !237, line: 24, baseType: !75, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !243, file: !237, line: 26, baseType: !7, size: 32, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !243, file: !237, line: 27, baseType: !7, size: 32, offset: 288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !243, file: !237, line: 28, baseType: !95, size: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !243, file: !237, line: 29, baseType: !253, size: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !243, file: !237, line: 30, baseType: !253, size: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !243, file: !237, line: 31, baseType: !253, size: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !243, file: !237, line: 32, baseType: !39, size: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !233, file: !67, line: 139, baseType: !258, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !237, line: 36, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !40, !241}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !66, file: !67, line: 181, baseType: !38, size: 64, offset: 1344)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !66, file: !67, line: 183, baseType: !18, size: 64, offset: 1408)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !66, file: !67, line: 187, baseType: !265, size: 64, offset: 1472)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !6, line: 349, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!7, !40, !269, !39}
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !6, line: 348, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!7, !40, !39}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !66, file: !67, line: 190, baseType: !145, size: 64, offset: 1536)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !66, file: !67, line: 194, baseType: !275, size: 64, offset: 1600)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !6, line: 360, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!40, !40, !40, !7}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !66, file: !67, line: 197, baseType: !75, size: 64, offset: 1664)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !66, file: !67, line: 200, baseType: !281, size: 64, offset: 1728)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !6, line: 361, baseType: !108)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !66, file: !67, line: 201, baseType: !283, size: 64, offset: 1792)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !6, line: 362, baseType: !108)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !66, file: !67, line: 204, baseType: !285, size: 64, offset: 1856)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !42, line: 14, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 68, size: 256, elements: !289)
!288 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/methodobject.h", directory: "")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 69, baseType: !18, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 70, baseType: !292, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 19, baseType: !129)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 71, baseType: !7, size: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 73, baseType: !18, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !66, file: !67, line: 205, baseType: !296, size: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !42, line: 16, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !299, line: 41, size: 320, elements: !300)
!299 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/descrobject.h", directory: "")
!300 = !{!301, !302, !303, !304, !305}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !298, file: !299, line: 42, baseType: !18, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !298, file: !299, line: 43, baseType: !7, size: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !298, file: !299, line: 44, baseType: !75, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !298, file: !299, line: 45, baseType: !7, size: 32, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !298, file: !299, line: 46, baseType: !18, size: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !66, file: !67, line: 206, baseType: !307, size: 64, offset: 1984)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGetSetDef", file: !42, line: 15, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !299, line: 11, size: 320, elements: !310)
!310 = !{!311, !312, !317, !322, !323}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !309, file: !299, line: 12, baseType: !18, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !309, file: !299, line: 13, baseType: !313, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !299, line: 8, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!40, !40, !39}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !309, file: !299, line: 14, baseType: !318, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !299, line: 9, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!7, !40, !40, !39}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !309, file: !299, line: 15, baseType: !18, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !309, file: !299, line: 16, baseType: !39, size: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !66, file: !67, line: 208, baseType: !64, size: 64, offset: 2048)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !66, file: !67, line: 209, baseType: !40, size: 64, offset: 2112)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !66, file: !67, line: 210, baseType: !327, size: 64, offset: 2176)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !6, line: 363, baseType: !138)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !66, file: !67, line: 211, baseType: !329, size: 64, offset: 2240)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !6, line: 364, baseType: !215)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !66, file: !67, line: 212, baseType: !75, size: 64, offset: 2304)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !66, file: !67, line: 213, baseType: !332, size: 64, offset: 2368)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !6, line: 365, baseType: !215)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !66, file: !67, line: 214, baseType: !334, size: 64, offset: 2432)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !6, line: 367, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!40, !64, !75}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !66, file: !67, line: 215, baseType: !339, size: 64, offset: 2496)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !6, line: 366, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!40, !64, !40, !40}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !66, file: !67, line: 216, baseType: !344, size: 64, offset: 2560)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !6, line: 352, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !39}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !66, file: !67, line: 217, baseType: !145, size: 64, offset: 2624)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !66, file: !67, line: 218, baseType: !40, size: 64, offset: 2688)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !66, file: !67, line: 219, baseType: !40, size: 64, offset: 2752)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !66, file: !67, line: 220, baseType: !40, size: 64, offset: 2816)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !66, file: !67, line: 221, baseType: !39, size: 64, offset: 2880)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !66, file: !67, line: 222, baseType: !40, size: 64, offset: 2944)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !66, file: !67, line: 223, baseType: !85, size: 64, offset: 3008)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !66, file: !67, line: 228, baseType: !23, size: 32, offset: 3072)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !66, file: !67, line: 230, baseType: !85, size: 64, offset: 3136)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall", scope: !66, file: !67, line: 231, baseType: !358, size: 64, offset: 3200)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "vectorcallfunc", file: !6, line: 370, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!40, !40, !362, !35, !40}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tp_watched", scope: !66, file: !67, line: 234, baseType: !365, size: 8, offset: 3264)
!365 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tp_versions_used", scope: !66, file: !67, line: 241, baseType: !59, size: 16, offset: 3280)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !368, line: 30, baseType: !7)
!368 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_int32_t.h", directory: "")
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !371, line: 15, baseType: !372)
!371 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/bytesobject.h", directory: "")
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !371, line: 5, size: 320, elements: !373)
!373 = !{!374, !375, !376}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !372, file: !371, line: 6, baseType: !70, size: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !372, file: !371, line: 7, baseType: !223, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !372, file: !371, line: 8, baseType: !377, size: 8, offset: 256)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 1)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunctionObject", file: !382, line: 14, baseType: !383)
!382 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/methodobject.h", directory: "")
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 7, size: 448, elements: !384)
!384 = !{!385, !386, !387, !388, !389, !390}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !383, file: !382, line: 8, baseType: !41, size: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "m_ml", scope: !383, file: !382, line: 9, baseType: !285, size: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "m_self", scope: !383, file: !382, line: 10, baseType: !40, size: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "m_module", scope: !383, file: !382, line: 11, baseType: !40, size: 64, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "m_weakreflist", scope: !383, file: !382, line: 12, baseType: !40, size: 64, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "vectorcall", scope: !383, file: !382, line: 13, baseType: !358, size: 64, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBaseExceptionObject", file: !393, line: 15, baseType: !394)
!393 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/pyerrors.h", directory: "")
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !393, line: 13, size: 576, elements: !395)
!395 = !{!396, !397, !398, !399, !400, !401, !402, !403}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !394, file: !393, line: 14, baseType: !41, size: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !394, file: !393, line: 14, baseType: !40, size: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !394, file: !393, line: 14, baseType: !40, size: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !394, file: !393, line: 14, baseType: !40, size: 64, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", scope: !394, file: !393, line: 14, baseType: !40, size: 64, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !394, file: !393, line: 14, baseType: !40, size: 64, offset: 384)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "cause", scope: !394, file: !393, line: 14, baseType: !40, size: 64, offset: 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_context", scope: !394, file: !393, line: 14, baseType: !20, size: 8, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CodeObjectCacheEntry", file: !406, line: 1682, baseType: !407)
!406 = !DIFile(filename: "dataset/cases/goeq-oja-0008/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c", directory: ".")
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !406, line: 1679, size: 128, elements: !408)
!408 = !{!409, !469}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "code_object", scope: !407, file: !406, line: 1680, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CachedCodeObjectType", file: !406, line: 1677, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !42, line: 21, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyCodeObject", file: !414, line: 115, size: 1728, elements: !415)
!414 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/code.h", directory: "")
!415 = !{!416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !450, !459, !462, !465, !466, !467, !468}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !413, file: !414, line: 115, baseType: !70, size: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !413, file: !414, line: 115, baseType: !40, size: 64, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !413, file: !414, line: 115, baseType: !40, size: 64, offset: 256)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "co_exceptiontable", scope: !413, file: !414, line: 115, baseType: !40, size: 64, offset: 320)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !413, file: !414, line: 115, baseType: !7, size: 32, offset: 384)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !413, file: !414, line: 115, baseType: !7, size: 32, offset: 416)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "co_posonlyargcount", scope: !413, file: !414, line: 115, baseType: !7, size: 32, offset: 448)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !413, file: !414, line: 115, baseType: !7, size: 32, offset: 480)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !413, file: !414, line: 115, baseType: !7, size: 32, offset: 512)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !413, file: !414, line: 115, baseType: !7, size: 32, offset: 544)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocalsplus", scope: !413, file: !414, line: 115, baseType: !7, size: 32, offset: 576)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "co_framesize", scope: !413, file: !414, line: 115, baseType: !7, size: 32, offset: 608)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !413, file: !414, line: 115, baseType: !7, size: 32, offset: 640)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "co_ncellvars", scope: !413, file: !414, line: 115, baseType: !7, size: 32, offset: 672)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "co_nfreevars", scope: !413, file: !414, line: 115, baseType: !7, size: 32, offset: 704)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "co_version", scope: !413, file: !414, line: 115, baseType: !56, size: 32, offset: 736)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "co_localsplusnames", scope: !413, file: !414, line: 115, baseType: !40, size: 64, offset: 768)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "co_localspluskinds", scope: !413, file: !414, line: 115, baseType: !40, size: 64, offset: 832)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !413, file: !414, line: 115, baseType: !40, size: 64, offset: 896)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !413, file: !414, line: 115, baseType: !40, size: 64, offset: 960)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "co_qualname", scope: !413, file: !414, line: 115, baseType: !40, size: 64, offset: 1024)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "co_linetable", scope: !413, file: !414, line: 115, baseType: !40, size: 64, offset: 1088)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !413, file: !414, line: 115, baseType: !40, size: 64, offset: 1152)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "co_executors", scope: !413, file: !414, line: 115, baseType: !440, size: 64, offset: 1216)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyExecutorArray", file: !414, line: 22, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !414, line: 18, size: 128, elements: !443)
!443 = !{!444, !445, !446}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !442, file: !414, line: 19, baseType: !7, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !442, file: !414, line: 20, baseType: !7, size: 32, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "executors", scope: !442, file: !414, line: 21, baseType: !447, size: 64, offset: 64)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 64, elements: !378)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyExecutorObject", file: !414, line: 21, flags: DIFlagFwdDecl)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_co_cached", scope: !413, file: !414, line: 115, baseType: !451, size: 64, offset: 1280)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyCoCached", file: !414, line: 16, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !414, line: 11, size: 256, elements: !454)
!454 = !{!455, !456, !457, !458}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_co_code", scope: !453, file: !414, line: 12, baseType: !40, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_co_varnames", scope: !453, file: !414, line: 13, baseType: !40, size: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_co_cellvars", scope: !453, file: !414, line: 14, baseType: !40, size: 64, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_co_freevars", scope: !453, file: !414, line: 15, baseType: !40, size: 64, offset: 192)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_co_instrumentation_version", scope: !413, file: !414, line: 115, baseType: !460, size: 64, offset: 1344)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !461, line: 34, baseType: !38)
!461 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_co_monitoring", scope: !413, file: !414, line: 115, baseType: !463, size: 64, offset: 1408)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyCoMonitoringData", file: !414, line: 115, flags: DIFlagFwdDecl)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_co_unique_id", scope: !413, file: !414, line: 115, baseType: !75, size: 64, offset: 1472)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_co_firsttraceable", scope: !413, file: !414, line: 115, baseType: !7, size: 32, offset: 1536)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "co_extra", scope: !413, file: !414, line: 115, baseType: !39, size: 64, offset: 1600)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "co_code_adaptive", scope: !413, file: !414, line: 115, baseType: !377, size: 8, offset: 1664)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "code_line", scope: !407, file: !406, line: 1681, baseType: !7, size: 32, offset: 64)
!470 = !{!0, !471, !476, !478, !483, !513, !516, !521, !526, !531, !536, !538, !540, !542, !547, !552, !554, !560, !565, !567, !572, !597, !599, !604, !609, !612, !614, !619, !623, !628, !630, !632, !637, !642, !647, !649, !651, !653, !658, !660, !662, !664, !669, !671, !674, !679, !684, !689, !694, !699, !701, !703, !705, !707, !709, !714, !716, !721}
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !406, line: 3230, type: !473, isLocal: true, isDefinition: true)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 16)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !406, line: 3237, type: !377, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !406, line: 2068, type: !480, isLocal: true, isDefinition: true)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 72, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 9)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "__pyx_moduledef", scope: !2, file: !406, line: 2064, type: !485, isLocal: true, isDefinition: true)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !486, line: 107, size: 832, elements: !487)
!486 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/moduleobject.h", directory: "")
!487 = !{!488, !499, !500, !501, !502, !503, !510, !511, !512}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !485, file: !486, line: 108, baseType: !489, size: 320)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !486, line: 58, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !486, line: 39, size: 320, elements: !491)
!491 = !{!492, !493, !497, !498}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !490, file: !486, line: 40, baseType: !41, size: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !490, file: !486, line: 47, baseType: !494, size: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!40}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !490, file: !486, line: 52, baseType: !75, size: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !490, file: !486, line: 57, baseType: !40, size: 64, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !485, file: !486, line: 109, baseType: !18, size: 64, offset: 320)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !485, file: !486, line: 110, baseType: !18, size: 64, offset: 384)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !485, file: !486, line: 111, baseType: !75, size: 64, offset: 448)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !485, file: !486, line: 112, baseType: !285, size: 64, offset: 512)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "m_slots", scope: !485, file: !486, line: 113, baseType: !504, size: 64, offset: 576)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Slot", file: !42, line: 13, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Slot", file: !486, line: 69, size: 128, elements: !507)
!507 = !{!508, !509}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !506, file: !486, line: 70, baseType: !7, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !506, file: !486, line: 71, baseType: !39, size: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !485, file: !486, line: 114, baseType: !265, size: 64, offset: 640)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !485, file: !486, line: 115, baseType: !145, size: 64, offset: 704)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !485, file: !486, line: 116, baseType: !344, size: 64, offset: 768)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "__pyx_methods", scope: !2, file: !406, line: 1963, type: !515, isLocal: true, isDefinition: true)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 256, elements: !378)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "__pyx_moduledef_slots", scope: !2, file: !406, line: 2047, type: !518, isLocal: true, isDefinition: true)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 384, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: 3)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !406, line: 2196, type: !523, isLocal: true, isDefinition: true)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 40, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 5)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !406, line: 2203, type: !528, isLocal: true, isDefinition: true)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 56, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 7)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !406, line: 2203, type: !533, isLocal: true, isDefinition: true)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 88, elements: !534)
!534 = !{!535}
!535 = !DISubrange(count: 11)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(scope: null, file: !406, line: 2204, type: !528, isLocal: true, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !406, line: 2204, type: !480, isLocal: true, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !406, line: 2205, type: !528, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !406, line: 2205, type: !544, isLocal: true, isDefinition: true)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 96, elements: !545)
!545 = !{!546}
!546 = !DISubrange(count: 12)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(scope: null, file: !406, line: 2206, type: !549, isLocal: true, isDefinition: true)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 216, elements: !550)
!550 = !{!551}
!551 = !DISubrange(count: 27)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(scope: null, file: !406, line: 2206, type: !480, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "main_interpreter_id", scope: !556, file: !406, line: 2143, type: !49, isLocal: true, isDefinition: true)
!556 = distinct !DISubprogram(name: "__Pyx_check_single_interpreter", scope: !406, file: !406, line: 2142, type: !557, scopeLine: 2142, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !559)
!557 = !DISubroutineType(types: !558)
!558 = !{!7}
!559 = !{}
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !406, line: 2165, type: !562, isLocal: true, isDefinition: true)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 760, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 95)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "__pyx_m", scope: !2, file: !406, line: 1326, type: !40, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !406, line: 2235, type: !569, isLocal: true, isDefinition: true)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 648, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 81)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "__pyx_mstate_global", scope: !2, file: !406, line: 1904, type: !574, isLocal: true, isDefinition: true)
!574 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pyx_mstatetype", file: !406, line: 1883, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !406, line: 1869, size: 1600, elements: !578)
!578 = !{!579, !580, !581, !582, !583, !584, !585, !587, !591}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_d", scope: !577, file: !406, line: 1870, baseType: !40, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_b", scope: !577, file: !406, line: 1871, baseType: !40, size: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_cython_runtime", scope: !577, file: !406, line: 1872, baseType: !40, size: 64, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_tuple", scope: !577, file: !406, line: 1873, baseType: !40, size: 64, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_bytes", scope: !577, file: !406, line: 1874, baseType: !40, size: 64, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_unicode", scope: !577, file: !406, line: 1875, baseType: !40, size: 64, offset: 320)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_tuple", scope: !577, file: !406, line: 1876, baseType: !586, size: 192, offset: 384)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 192, elements: !519)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_string_tab", scope: !577, file: !406, line: 1877, baseType: !588, size: 896, offset: 576)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 896, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 14)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_code_cache", scope: !577, file: !406, line: 1880, baseType: !592, size: 128, offset: 1472)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__Pyx_CodeObjectCache", file: !406, line: 1683, size: 128, elements: !593)
!593 = !{!594, !595, !596}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !592, file: !406, line: 1684, baseType: !7, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "max_count", scope: !592, file: !406, line: 1685, baseType: !7, size: 32, offset: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !592, file: !406, line: 1686, baseType: !404, size: 64, offset: 64)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(scope: null, file: !406, line: 2265, type: !480, isLocal: true, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !406, line: 2266, type: !601, isLocal: true, isDefinition: true)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 120, elements: !602)
!602 = !{!603}
!603 = !DISubrange(count: 15)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !406, line: 2267, type: !606, isLocal: true, isDefinition: true)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 104, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 13)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !406, line: 2370, type: !611, isLocal: true, isDefinition: true)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 112, elements: !589)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "__pyx_mstate_global_static", scope: !2, file: !406, line: 1898, type: !576, isLocal: true, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !406, line: 1336, type: !616, isLocal: true, isDefinition: true)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 432, elements: !617)
!617 = !{!618}
!618 = !DISubrange(count: 54)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "__pyx_f", scope: !2, file: !406, line: 1335, type: !621, isLocal: true, isDefinition: true)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 64, elements: !378)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !406, line: 4093, type: !625, isLocal: true, isDefinition: true)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 624, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 78)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !406, line: 4099, type: !601, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !406, line: 4099, type: !601, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !406, line: 2464, type: !634, isLocal: true, isDefinition: true)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 672, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 84)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !406, line: 4109, type: !639, isLocal: true, isDefinition: true)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 136, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 17)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !406, line: 4109, type: !644, isLocal: true, isDefinition: true)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 32, elements: !645)
!645 = !{!646}
!646 = !DISubrange(count: 4)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !406, line: 4109, type: !523, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !406, line: 4110, type: !533, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !406, line: 4114, type: !644, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(scope: null, file: !406, line: 4161, type: !655, isLocal: true, isDefinition: true)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1224, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 153)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "__pyx_filename", scope: !2, file: !406, line: 1331, type: !18, isLocal: true, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(name: "__pyx_lineno", scope: !2, file: !406, line: 1328, type: !7, isLocal: true, isDefinition: true)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "__pyx_clineno", scope: !2, file: !406, line: 1329, type: !7, isLocal: true, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !371, line: 25, type: !666, isLocal: true, isDefinition: true)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 144, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 18)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(scope: null, file: !371, line: 25, type: !611, isLocal: true, isDefinition: true)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(scope: null, file: !371, line: 25, type: !673, isLocal: true, isDefinition: true)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 144, elements: !667)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(scope: null, file: !406, line: 2697, type: !676, isLocal: true, isDefinition: true)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 200, elements: !677)
!677 = !{!678}
!678 = !DISubrange(count: 25)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !406, line: 2729, type: !681, isLocal: true, isDefinition: true)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 248, elements: !682)
!682 = !{!683}
!683 = !DISubrange(count: 31)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(scope: null, file: !406, line: 2736, type: !686, isLocal: true, isDefinition: true)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 344, elements: !687)
!687 = !{!688}
!688 = !DISubrange(count: 43)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !406, line: 2774, type: !691, isLocal: true, isDefinition: true)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 224, elements: !692)
!692 = !{!693}
!693 = !DISubrange(count: 28)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !406, line: 2774, type: !696, isLocal: true, isDefinition: true)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 80, elements: !697)
!697 = !{!698}
!698 = !DISubrange(count: 10)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !406, line: 2774, type: !549, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !406, line: 2776, type: !533, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "__pyx_builtin_input", scope: !2, file: !406, line: 1853, type: !40, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "__pyx_builtin_print", scope: !2, file: !406, line: 1852, type: !40, isLocal: true, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(scope: null, file: !406, line: 3105, type: !533, isLocal: true, isDefinition: true)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(scope: null, file: !406, line: 1330, type: !711, isLocal: true, isDefinition: true)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 944, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 118)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "__pyx_cfilenm", scope: !2, file: !406, line: 1330, type: !622, isLocal: true, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(scope: null, file: !406, line: 2599, type: !718, isLocal: true, isDefinition: true)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 192, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 24)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(scope: null, file: !406, line: 2599, type: !723, isLocal: true, isDefinition: true)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 560, elements: !724)
!724 = !{!725}
!725 = !DISubrange(count: 70)
!726 = !{i32 2, !"SDK Version", [2 x i32] [i32 14, i32 4]}
!727 = !{i32 7, !"Dwarf Version", i32 4}
!728 = !{i32 2, !"Debug Info Version", i32 3}
!729 = !{i32 1, !"wchar_size", i32 4}
!730 = !{i32 8, !"PIC Level", i32 2}
!731 = !{i32 7, !"uwtable", i32 1}
!732 = !{i32 7, !"frame-pointer", i32 1}
!733 = !{!"Homebrew clang version 20.1.8"}
!734 = distinct !DISubprogram(name: "PyInit_original", scope: !406, file: !406, line: 2107, type: !495, scopeLine: 2109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2)
!735 = !DILocation(line: 2110, column: 10, scope: !734)
!736 = !DILocation(line: 2110, column: 3, scope: !734)
!737 = distinct !DISubprogram(name: "main", scope: !406, file: !406, line: 3219, type: !738, scopeLine: 3220, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !559)
!738 = !DISubroutineType(types: !739)
!739 = !{!7, !7, !740}
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!741 = !DILocalVariable(name: "argc", arg: 1, scope: !737, file: !406, line: 3219, type: !7)
!742 = !DILocation(line: 3219, column: 10, scope: !737)
!743 = !DILocalVariable(name: "argv", arg: 2, scope: !737, file: !406, line: 3219, type: !740)
!744 = !DILocation(line: 3219, column: 23, scope: !737)
!745 = !DILocation(line: 3221, column: 10, scope: !746)
!746 = distinct !DILexicalBlock(scope: !737, file: !406, line: 3221, column: 9)
!747 = !DILocation(line: 3221, column: 9, scope: !746)
!748 = !DILocation(line: 3222, column: 16, scope: !749)
!749 = distinct !DILexicalBlock(scope: !746, file: !406, line: 3221, column: 16)
!750 = !DILocation(line: 3222, column: 9, scope: !749)
!751 = !DILocalVariable(name: "i", scope: !752, file: !406, line: 3225, type: !7)
!752 = distinct !DILexicalBlock(scope: !746, file: !406, line: 3224, column: 10)
!753 = !DILocation(line: 3225, column: 13, scope: !752)
!754 = !DILocalVariable(name: "res", scope: !752, file: !406, line: 3225, type: !7)
!755 = !DILocation(line: 3225, column: 16, scope: !752)
!756 = !DILocalVariable(name: "argv_copy", scope: !752, file: !406, line: 3226, type: !29)
!757 = !DILocation(line: 3226, column: 19, scope: !752)
!758 = !DILocation(line: 3226, column: 78, scope: !752)
!759 = !DILocation(line: 3226, column: 69, scope: !752)
!760 = !DILocation(line: 3226, column: 67, scope: !752)
!761 = !DILocation(line: 3226, column: 43, scope: !752)
!762 = !DILocalVariable(name: "argv_copy2", scope: !752, file: !406, line: 3227, type: !29)
!763 = !DILocation(line: 3227, column: 19, scope: !752)
!764 = !DILocation(line: 3227, column: 79, scope: !752)
!765 = !DILocation(line: 3227, column: 70, scope: !752)
!766 = !DILocation(line: 3227, column: 68, scope: !752)
!767 = !DILocation(line: 3227, column: 44, scope: !752)
!768 = !DILocalVariable(name: "oldloc", scope: !752, file: !406, line: 3228, type: !95)
!769 = !DILocation(line: 3228, column: 15, scope: !752)
!770 = !DILocation(line: 3228, column: 31, scope: !752)
!771 = !DILocation(line: 3228, column: 24, scope: !752)
!772 = !DILocation(line: 3229, column: 14, scope: !773)
!773 = distinct !DILexicalBlock(scope: !752, file: !406, line: 3229, column: 13)
!774 = !DILocation(line: 3229, column: 24, scope: !773)
!775 = !DILocation(line: 3229, column: 28, scope: !773)
!776 = !DILocation(line: 3229, column: 39, scope: !773)
!777 = !DILocation(line: 3229, column: 43, scope: !773)
!778 = !DILocation(line: 3230, column: 21, scope: !779)
!779 = distinct !DILexicalBlock(scope: !773, file: !406, line: 3229, column: 51)
!780 = !DILocation(line: 3230, column: 13, scope: !779)
!781 = !DILocation(line: 3231, column: 18, scope: !779)
!782 = !DILocation(line: 3231, column: 13, scope: !779)
!783 = !DILocation(line: 3232, column: 18, scope: !779)
!784 = !DILocation(line: 3232, column: 13, scope: !779)
!785 = !DILocation(line: 3233, column: 18, scope: !779)
!786 = !DILocation(line: 3233, column: 13, scope: !779)
!787 = !DILocation(line: 3234, column: 13, scope: !779)
!788 = !DILocation(line: 3236, column: 13, scope: !752)
!789 = !DILocation(line: 3237, column: 9, scope: !752)
!790 = !DILocation(line: 3238, column: 16, scope: !791)
!791 = distinct !DILexicalBlock(scope: !752, file: !406, line: 3238, column: 9)
!792 = !DILocation(line: 3238, column: 14, scope: !791)
!793 = !DILocation(line: 3238, column: 21, scope: !794)
!794 = distinct !DILexicalBlock(scope: !791, file: !406, line: 3238, column: 9)
!795 = !DILocation(line: 3238, column: 25, scope: !794)
!796 = !DILocation(line: 3238, column: 23, scope: !794)
!797 = !DILocation(line: 3238, column: 9, scope: !791)
!798 = !DILocation(line: 3239, column: 60, scope: !799)
!799 = distinct !DILexicalBlock(scope: !794, file: !406, line: 3238, column: 36)
!800 = !DILocation(line: 3239, column: 65, scope: !799)
!801 = !DILocation(line: 3239, column: 44, scope: !799)
!802 = !DILocation(line: 3239, column: 29, scope: !799)
!803 = !DILocation(line: 3239, column: 39, scope: !799)
!804 = !DILocation(line: 3239, column: 42, scope: !799)
!805 = !DILocation(line: 3239, column: 13, scope: !799)
!806 = !DILocation(line: 3239, column: 24, scope: !799)
!807 = !DILocation(line: 3239, column: 27, scope: !799)
!808 = !DILocation(line: 3240, column: 18, scope: !809)
!809 = distinct !DILexicalBlock(scope: !799, file: !406, line: 3240, column: 17)
!810 = !DILocation(line: 3240, column: 28, scope: !809)
!811 = !DILocation(line: 3240, column: 17, scope: !809)
!812 = !DILocation(line: 3240, column: 36, scope: !809)
!813 = !DILocation(line: 3240, column: 32, scope: !809)
!814 = !DILocation(line: 3241, column: 9, scope: !799)
!815 = !DILocation(line: 3238, column: 32, scope: !794)
!816 = !DILocation(line: 3238, column: 9, scope: !794)
!817 = distinct !{!817, !797, !818, !819}
!818 = !DILocation(line: 3241, column: 9, scope: !791)
!819 = !{!"llvm.loop.mustprogress"}
!820 = !DILocation(line: 3242, column: 27, scope: !752)
!821 = !DILocation(line: 3242, column: 9, scope: !752)
!822 = !DILocation(line: 3243, column: 14, scope: !752)
!823 = !DILocation(line: 3243, column: 9, scope: !752)
!824 = !DILocation(line: 3244, column: 13, scope: !825)
!825 = distinct !DILexicalBlock(scope: !752, file: !406, line: 3244, column: 13)
!826 = !DILocation(line: 3244, column: 17, scope: !825)
!827 = !DILocation(line: 3245, column: 30, scope: !825)
!828 = !DILocation(line: 3245, column: 36, scope: !825)
!829 = !DILocation(line: 3245, column: 19, scope: !825)
!830 = !DILocation(line: 3245, column: 17, scope: !825)
!831 = !DILocation(line: 3245, column: 13, scope: !825)
!832 = !DILocation(line: 3246, column: 16, scope: !833)
!833 = distinct !DILexicalBlock(scope: !752, file: !406, line: 3246, column: 9)
!834 = !DILocation(line: 3246, column: 14, scope: !833)
!835 = !DILocation(line: 3246, column: 21, scope: !836)
!836 = distinct !DILexicalBlock(scope: !833, file: !406, line: 3246, column: 9)
!837 = !DILocation(line: 3246, column: 25, scope: !836)
!838 = !DILocation(line: 3246, column: 23, scope: !836)
!839 = !DILocation(line: 3246, column: 9, scope: !833)
!840 = !DILocation(line: 3247, column: 27, scope: !841)
!841 = distinct !DILexicalBlock(scope: !836, file: !406, line: 3246, column: 36)
!842 = !DILocation(line: 3247, column: 38, scope: !841)
!843 = !DILocation(line: 3247, column: 13, scope: !841)
!844 = !DILocation(line: 3248, column: 9, scope: !841)
!845 = !DILocation(line: 3246, column: 32, scope: !836)
!846 = !DILocation(line: 3246, column: 9, scope: !836)
!847 = distinct !{!847, !839, !848, !819}
!848 = !DILocation(line: 3248, column: 9, scope: !833)
!849 = !DILocation(line: 3249, column: 14, scope: !752)
!850 = !DILocation(line: 3249, column: 9, scope: !752)
!851 = !DILocation(line: 3250, column: 14, scope: !752)
!852 = !DILocation(line: 3250, column: 9, scope: !752)
!853 = !DILocation(line: 3251, column: 16, scope: !752)
!854 = !DILocation(line: 3251, column: 9, scope: !752)
!855 = !DILocation(line: 3253, column: 1, scope: !737)
!856 = distinct !DISubprogram(name: "__Pyx_main", scope: !406, file: !406, line: 3164, type: !857, scopeLine: 3166, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !559)
!857 = !DISubroutineType(types: !858)
!858 = !{!7, !7, !29}
!859 = !DILocalVariable(name: "argc", arg: 1, scope: !856, file: !406, line: 3164, type: !7)
!860 = !DILocation(line: 3164, column: 27, scope: !856)
!861 = !DILocalVariable(name: "argv", arg: 2, scope: !856, file: !406, line: 3164, type: !29)
!862 = !DILocation(line: 3164, column: 43, scope: !856)
!863 = !DILocation(line: 3177, column: 9, scope: !864)
!864 = distinct !DILexicalBlock(scope: !856, file: !406, line: 3177, column: 9)
!865 = !DILocation(line: 3177, column: 61, scope: !864)
!866 = !DILocation(line: 3177, column: 66, scope: !864)
!867 = !DILocalVariable(name: "status", scope: !868, file: !406, line: 3179, type: !869)
!868 = distinct !DILexicalBlock(scope: !856, file: !406, line: 3178, column: 5)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyStatus", file: !13, line: 19, baseType: !14)
!870 = !DILocation(line: 3179, column: 18, scope: !868)
!871 = !DILocalVariable(name: "config", scope: !868, file: !406, line: 3180, type: !872)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyConfig", file: !13, line: 244, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyConfig", file: !13, line: 134, size: 3648, elements: !874)
!874 = !{!875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_config_init", scope: !873, file: !13, line: 135, baseType: !7, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "isolated", scope: !873, file: !13, line: 137, baseType: !7, size: 32, offset: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "use_environment", scope: !873, file: !13, line: 138, baseType: !7, size: 32, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "dev_mode", scope: !873, file: !13, line: 139, baseType: !7, size: 32, offset: 96)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "install_signal_handlers", scope: !873, file: !13, line: 140, baseType: !7, size: 32, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "use_hash_seed", scope: !873, file: !13, line: 141, baseType: !7, size: 32, offset: 160)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "hash_seed", scope: !873, file: !13, line: 142, baseType: !38, size: 64, offset: 192)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "faulthandler", scope: !873, file: !13, line: 143, baseType: !7, size: 32, offset: 256)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "tracemalloc", scope: !873, file: !13, line: 144, baseType: !7, size: 32, offset: 288)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "perf_profiling", scope: !873, file: !13, line: 145, baseType: !7, size: 32, offset: 320)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "remote_debug", scope: !873, file: !13, line: 146, baseType: !7, size: 32, offset: 352)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "import_time", scope: !873, file: !13, line: 147, baseType: !7, size: 32, offset: 384)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "code_debug_ranges", scope: !873, file: !13, line: 148, baseType: !7, size: 32, offset: 416)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "show_ref_count", scope: !873, file: !13, line: 149, baseType: !7, size: 32, offset: 448)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "dump_refs", scope: !873, file: !13, line: 150, baseType: !7, size: 32, offset: 480)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "dump_refs_file", scope: !873, file: !13, line: 151, baseType: !30, size: 64, offset: 512)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_stats", scope: !873, file: !13, line: 152, baseType: !7, size: 32, offset: 576)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "filesystem_encoding", scope: !873, file: !13, line: 153, baseType: !30, size: 64, offset: 640)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "filesystem_errors", scope: !873, file: !13, line: 154, baseType: !30, size: 64, offset: 704)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "pycache_prefix", scope: !873, file: !13, line: 155, baseType: !30, size: 64, offset: 768)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "parse_argv", scope: !873, file: !13, line: 156, baseType: !7, size: 32, offset: 832)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "orig_argv", scope: !873, file: !13, line: 157, baseType: !897, size: 128, offset: 896)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyWideStringList", file: !13, line: 36, baseType: !898)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 31, size: 128, elements: !899)
!899 = !{!900, !901}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !898, file: !13, line: 34, baseType: !75, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !898, file: !13, line: 35, baseType: !29, size: 64, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !873, file: !13, line: 158, baseType: !897, size: 128, offset: 1024)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "xoptions", scope: !873, file: !13, line: 159, baseType: !897, size: 128, offset: 1152)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "warnoptions", scope: !873, file: !13, line: 160, baseType: !897, size: 128, offset: 1280)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "site_import", scope: !873, file: !13, line: 161, baseType: !7, size: 32, offset: 1408)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_warning", scope: !873, file: !13, line: 162, baseType: !7, size: 32, offset: 1440)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "warn_default_encoding", scope: !873, file: !13, line: 163, baseType: !7, size: 32, offset: 1472)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "inspect", scope: !873, file: !13, line: 164, baseType: !7, size: 32, offset: 1504)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !873, file: !13, line: 165, baseType: !7, size: 32, offset: 1536)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "optimization_level", scope: !873, file: !13, line: 166, baseType: !7, size: 32, offset: 1568)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "parser_debug", scope: !873, file: !13, line: 167, baseType: !7, size: 32, offset: 1600)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "write_bytecode", scope: !873, file: !13, line: 168, baseType: !7, size: 32, offset: 1632)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !873, file: !13, line: 169, baseType: !7, size: 32, offset: 1664)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !873, file: !13, line: 170, baseType: !7, size: 32, offset: 1696)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "user_site_directory", scope: !873, file: !13, line: 171, baseType: !7, size: 32, offset: 1728)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "configure_c_stdio", scope: !873, file: !13, line: 172, baseType: !7, size: 32, offset: 1760)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "buffered_stdio", scope: !873, file: !13, line: 173, baseType: !7, size: 32, offset: 1792)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "stdio_encoding", scope: !873, file: !13, line: 174, baseType: !30, size: 64, offset: 1856)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "stdio_errors", scope: !873, file: !13, line: 175, baseType: !30, size: 64, offset: 1920)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "check_hash_pycs_mode", scope: !873, file: !13, line: 179, baseType: !30, size: 64, offset: 1984)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "use_frozen_modules", scope: !873, file: !13, line: 180, baseType: !7, size: 32, offset: 2048)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "safe_path", scope: !873, file: !13, line: 181, baseType: !7, size: 32, offset: 2080)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "int_max_str_digits", scope: !873, file: !13, line: 182, baseType: !7, size: 32, offset: 2112)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "thread_inherit_context", scope: !873, file: !13, line: 183, baseType: !7, size: 32, offset: 2144)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "context_aware_warnings", scope: !873, file: !13, line: 184, baseType: !7, size: 32, offset: 2176)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "use_system_logger", scope: !873, file: !13, line: 186, baseType: !7, size: 32, offset: 2208)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_count", scope: !873, file: !13, line: 189, baseType: !7, size: 32, offset: 2240)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "pathconfig_warnings", scope: !873, file: !13, line: 196, baseType: !7, size: 32, offset: 2272)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "program_name", scope: !873, file: !13, line: 197, baseType: !30, size: 64, offset: 2304)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "pythonpath_env", scope: !873, file: !13, line: 198, baseType: !30, size: 64, offset: 2368)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "home", scope: !873, file: !13, line: 199, baseType: !30, size: 64, offset: 2432)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "platlibdir", scope: !873, file: !13, line: 200, baseType: !30, size: 64, offset: 2496)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "module_search_paths_set", scope: !873, file: !13, line: 203, baseType: !7, size: 32, offset: 2560)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "module_search_paths", scope: !873, file: !13, line: 204, baseType: !897, size: 128, offset: 2624)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "stdlib_dir", scope: !873, file: !13, line: 205, baseType: !30, size: 64, offset: 2752)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "executable", scope: !873, file: !13, line: 206, baseType: !30, size: 64, offset: 2816)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "base_executable", scope: !873, file: !13, line: 207, baseType: !30, size: 64, offset: 2880)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !873, file: !13, line: 208, baseType: !30, size: 64, offset: 2944)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "base_prefix", scope: !873, file: !13, line: 209, baseType: !30, size: 64, offset: 3008)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "exec_prefix", scope: !873, file: !13, line: 210, baseType: !30, size: 64, offset: 3072)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "base_exec_prefix", scope: !873, file: !13, line: 211, baseType: !30, size: 64, offset: 3136)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "skip_source_first_line", scope: !873, file: !13, line: 214, baseType: !7, size: 32, offset: 3200)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "run_command", scope: !873, file: !13, line: 215, baseType: !30, size: 64, offset: 3264)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "run_module", scope: !873, file: !13, line: 216, baseType: !30, size: 64, offset: 3328)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "run_filename", scope: !873, file: !13, line: 217, baseType: !30, size: 64, offset: 3392)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "sys_path_0", scope: !873, file: !13, line: 220, baseType: !30, size: 64, offset: 3456)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "_install_importlib", scope: !873, file: !13, line: 226, baseType: !7, size: 32, offset: 3520)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_init_main", scope: !873, file: !13, line: 229, baseType: !7, size: 32, offset: 3552)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "_is_python_build", scope: !873, file: !13, line: 232, baseType: !7, size: 32, offset: 3584)
!950 = !DILocation(line: 3180, column: 18, scope: !868)
!951 = !DILocation(line: 3181, column: 9, scope: !868)
!952 = !DILocation(line: 3182, column: 16, scope: !868)
!953 = !DILocation(line: 3182, column: 27, scope: !868)
!954 = !DILocation(line: 3183, column: 13, scope: !955)
!955 = distinct !DILexicalBlock(scope: !868, file: !406, line: 3183, column: 13)
!956 = !DILocation(line: 3183, column: 18, scope: !955)
!957 = !DILocation(line: 3183, column: 21, scope: !955)
!958 = !DILocation(line: 3184, column: 58, scope: !959)
!959 = distinct !DILexicalBlock(scope: !955, file: !406, line: 3183, column: 27)
!960 = !DILocation(line: 3184, column: 72, scope: !959)
!961 = !DILocation(line: 3184, column: 22, scope: !959)
!962 = !DILocation(line: 3185, column: 17, scope: !963)
!963 = distinct !DILexicalBlock(scope: !959, file: !406, line: 3185, column: 17)
!964 = !DILocation(line: 3186, column: 17, scope: !965)
!965 = distinct !DILexicalBlock(scope: !963, file: !406, line: 3185, column: 45)
!966 = !DILocation(line: 3187, column: 17, scope: !965)
!967 = !DILocation(line: 3189, column: 48, scope: !959)
!968 = !DILocation(line: 3189, column: 54, scope: !959)
!969 = !DILocation(line: 3189, column: 22, scope: !959)
!970 = !DILocation(line: 3190, column: 17, scope: !971)
!971 = distinct !DILexicalBlock(scope: !959, file: !406, line: 3190, column: 17)
!972 = !DILocation(line: 3191, column: 17, scope: !973)
!973 = distinct !DILexicalBlock(scope: !971, file: !406, line: 3190, column: 45)
!974 = !DILocation(line: 3192, column: 17, scope: !973)
!975 = !DILocation(line: 3194, column: 9, scope: !959)
!976 = !DILocation(line: 3195, column: 18, scope: !868)
!977 = !DILocation(line: 3196, column: 13, scope: !978)
!978 = distinct !DILexicalBlock(scope: !868, file: !406, line: 3196, column: 13)
!979 = !DILocation(line: 3197, column: 13, scope: !980)
!980 = distinct !DILexicalBlock(scope: !978, file: !406, line: 3196, column: 41)
!981 = !DILocation(line: 3198, column: 13, scope: !980)
!982 = !DILocation(line: 3200, column: 9, scope: !868)
!983 = !DILocalVariable(name: "m", scope: !984, file: !406, line: 3203, type: !40)
!984 = distinct !DILexicalBlock(scope: !856, file: !406, line: 3202, column: 5)
!985 = !DILocation(line: 3203, column: 17, scope: !984)
!986 = !DILocation(line: 3204, column: 37, scope: !984)
!987 = !DILocation(line: 3205, column: 11, scope: !984)
!988 = !DILocation(line: 3205, column: 9, scope: !984)
!989 = !DILocation(line: 3206, column: 12, scope: !990)
!990 = distinct !DILexicalBlock(scope: !984, file: !406, line: 3206, column: 11)
!991 = !DILocation(line: 3206, column: 14, scope: !990)
!992 = !DILocation(line: 3206, column: 17, scope: !990)
!993 = !DILocation(line: 3207, column: 11, scope: !994)
!994 = distinct !DILexicalBlock(scope: !990, file: !406, line: 3206, column: 35)
!995 = !DILocation(line: 3208, column: 11, scope: !994)
!996 = !DILocation(line: 3210, column: 7, scope: !984)
!997 = !DILocation(line: 3212, column: 9, scope: !998)
!998 = distinct !DILexicalBlock(scope: !856, file: !406, line: 3212, column: 9)
!999 = !DILocation(line: 3212, column: 25, scope: !998)
!1000 = !DILocation(line: 3213, column: 9, scope: !998)
!1001 = !DILocation(line: 3214, column: 5, scope: !856)
!1002 = !DILocation(line: 3215, column: 1, scope: !856)
!1003 = distinct !DISubprogram(name: "__pyx_pymod_create", scope: !406, file: !406, line: 2187, type: !1004, scopeLine: 2187, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !559)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!40, !40, !1006}
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef", file: !42, line: 12, baseType: !485)
!1008 = !DILocalVariable(name: "spec", arg: 1, scope: !1003, file: !406, line: 2187, type: !40)
!1009 = !DILocation(line: 2187, column: 65, scope: !1003)
!1010 = !DILocalVariable(name: "def", arg: 2, scope: !1003, file: !406, line: 2187, type: !1006)
!1011 = !DILocation(line: 2187, column: 84, scope: !1003)
!1012 = !DILocalVariable(name: "module", scope: !1003, file: !406, line: 2188, type: !40)
!1013 = !DILocation(line: 2188, column: 15, scope: !1003)
!1014 = !DILocalVariable(name: "moddict", scope: !1003, file: !406, line: 2188, type: !40)
!1015 = !DILocation(line: 2188, column: 31, scope: !1003)
!1016 = !DILocalVariable(name: "modname", scope: !1003, file: !406, line: 2188, type: !40)
!1017 = !DILocation(line: 2188, column: 41, scope: !1003)
!1018 = !DILocation(line: 2189, column: 5, scope: !1003)
!1019 = !DILocation(line: 2191, column: 9, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !1003, file: !406, line: 2191, column: 9)
!1021 = !DILocation(line: 2192, column: 9, scope: !1020)
!1022 = !DILocation(line: 2194, column: 9, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1003, file: !406, line: 2194, column: 9)
!1024 = !DILocation(line: 2195, column: 29, scope: !1023)
!1025 = !DILocation(line: 2195, column: 16, scope: !1023)
!1026 = !DILocation(line: 2195, column: 9, scope: !1023)
!1027 = !DILocation(line: 2196, column: 38, scope: !1003)
!1028 = !DILocation(line: 2196, column: 15, scope: !1003)
!1029 = !DILocation(line: 2196, column: 13, scope: !1003)
!1030 = !DILocation(line: 2197, column: 9, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1003, file: !406, line: 2197, column: 9)
!1032 = !DILocation(line: 2197, column: 29, scope: !1031)
!1033 = !DILocation(line: 2198, column: 33, scope: !1003)
!1034 = !DILocation(line: 2198, column: 14, scope: !1003)
!1035 = !DILocation(line: 2198, column: 12, scope: !1003)
!1036 = !DILocation(line: 2199, column: 5, scope: !1003)
!1037 = !DILocalVariable(name: "op", arg: 1, scope: !1038, file: !1039, line: 411, type: !40)
!1038 = distinct !DISubprogram(name: "Py_DECREF", scope: !1039, file: !1039, line: 411, type: !87, scopeLine: 412, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !559)
!1039 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/refcount.h", directory: "")
!1040 = !DILocation(line: 411, column: 57, scope: !1038, inlinedAt: !1041)
!1041 = distinct !DILocation(line: 2199, column: 5, scope: !1003)
!1042 = !DILocation(line: 415, column: 9, scope: !1043, inlinedAt: !1041)
!1043 = distinct !DILexicalBlock(scope: !1038, file: !1039, line: 415, column: 9)
!1044 = !DILocalVariable(name: "op", arg: 1, scope: !1045, file: !1039, line: 125, type: !40)
!1045 = distinct !DISubprogram(name: "_Py_IsImmortal", scope: !1039, file: !1039, line: 125, type: !147, scopeLine: 126, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !559)
!1046 = !DILocation(line: 125, column: 61, scope: !1045, inlinedAt: !1047)
!1047 = distinct !DILocation(line: 415, column: 9, scope: !1043, inlinedAt: !1041)
!1048 = !DILocation(line: 131, column: 12, scope: !1045, inlinedAt: !1047)
!1049 = !DILocation(line: 131, column: 48, scope: !1045, inlinedAt: !1047)
!1050 = !DILocation(line: 417, column: 9, scope: !1051, inlinedAt: !1041)
!1051 = distinct !DILexicalBlock(scope: !1043, file: !1039, line: 415, column: 29)
!1052 = !DILocation(line: 420, column: 11, scope: !1053, inlinedAt: !1041)
!1053 = distinct !DILexicalBlock(scope: !1038, file: !1039, line: 420, column: 9)
!1054 = !DILocation(line: 420, column: 9, scope: !1053, inlinedAt: !1041)
!1055 = !DILocation(line: 420, column: 25, scope: !1053, inlinedAt: !1041)
!1056 = !DILocation(line: 421, column: 21, scope: !1057, inlinedAt: !1041)
!1057 = distinct !DILexicalBlock(scope: !1053, file: !1039, line: 420, column: 31)
!1058 = !DILocation(line: 421, column: 9, scope: !1057, inlinedAt: !1041)
!1059 = !DILocation(line: 422, column: 5, scope: !1057, inlinedAt: !1041)
!1060 = !DILocation(line: 2200, column: 9, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1003, file: !406, line: 2200, column: 9)
!1062 = !DILocation(line: 2200, column: 28, scope: !1061)
!1063 = !DILocation(line: 2201, column: 32, scope: !1003)
!1064 = !DILocation(line: 2201, column: 15, scope: !1003)
!1065 = !DILocation(line: 2201, column: 13, scope: !1003)
!1066 = !DILocation(line: 2202, column: 9, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1003, file: !406, line: 2202, column: 9)
!1068 = !DILocation(line: 2202, column: 29, scope: !1067)
!1069 = !DILocation(line: 2203, column: 9, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1003, file: !406, line: 2203, column: 9)
!1071 = !DILocation(line: 2203, column: 92, scope: !1070)
!1072 = !DILocation(line: 2204, column: 9, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1003, file: !406, line: 2204, column: 9)
!1074 = !DILocation(line: 2204, column: 90, scope: !1073)
