; ModuleID = 'dataset/cases/goeq-ojva-0090/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c'
source_filename = "dataset/cases/goeq-ojva-0090/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx14.0.0"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr }
%struct.PyModuleDef_Base = type { %struct._object, ptr, i64, ptr }
%struct._object = type { %union.anon, ptr }
%union.anon = type { i64 }
%struct.PyMethodDef = type { ptr, ptr, i32, ptr }
%struct.__pyx_mstatetype = type { ptr, ptr, ptr, ptr, ptr, ptr, [17 x ptr], [1 x ptr], %struct.__Pyx_CodeObjectCache }
%struct.__Pyx_CodeObjectCache = type { i32, i32, ptr }
%struct._typeobject = type { %struct.PyVarObject, ptr, i64, i64, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, ptr, i8, i16 }
%struct.PyVarObject = type { %struct._object, i64 }
%struct.anon.1 = type { i8, [3 x i8] }
%struct._longobject = type { %struct._object, %struct._PyLongValue }
%struct._PyLongValue = type { i64, [1 x i32] }
%struct.PyStatus = type { i32, ptr, ptr, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__pyx_module_is_main_original", scope: !2, file: !464, line: 1906, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Homebrew clang version 20.1.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !28, globals: !526, splitDebugInlining: false, nameTableKind: Apple, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk", sdk: "MacOSX14.sdk")
!3 = !DIFile(filename: "dataset/cases/goeq-ojva-0090/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c", directory: ".")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 695, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/object.h", directory: "")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "PYGEN_RETURN", value: 0)
!10 = !DIEnumerator(name: "PYGEN_ERROR", value: -1)
!11 = !DIEnumerator(name: "PYGEN_NEXT", value: 1)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !14, file: !13, line: 11, baseType: !23, size: 32, elements: !24)
!13 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/initconfig.h", directory: "")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 10, size: 256, elements: !15)
!15 = !{!16, !17, !21, !22}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_type", scope: !14, file: !13, line: 15, baseType: !12, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !14, file: !13, line: 16, baseType: !18, size: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "err_msg", scope: !14, file: !13, line: 17, baseType: !18, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "exitcode", scope: !14, file: !13, line: 18, baseType: !7, size: 32, offset: 192)
!23 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!24 = !{!25, !26, !27}
!25 = !DIEnumerator(name: "_PyStatus_TYPE_OK", value: 0)
!26 = !DIEnumerator(name: "_PyStatus_TYPE_ERROR", value: 1)
!27 = !DIEnumerator(name: "_PyStatus_TYPE_EXIT", value: 2)
!28 = !{!29, !35, !39, !40, !367, !7, !18, !95, !369, !380, !391, !75, !407, !38, !422, !423, !424, !64, !431, !440, !441, !449, !462}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !32, line: 34, baseType: !33)
!32 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_wchar_t.h", directory: "")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wchar_t", file: !34, line: 82, baseType: !7)
!34 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/arm/_types.h", directory: "")
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !36, line: 31, baseType: !37)
!36 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !34, line: 70, baseType: !38)
!38 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !42, line: 18, baseType: !43)
!42 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pytypedefs.h", directory: "")
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !6, line: 110, size: 128, elements: !44)
!44 = !{!45, !63}
!45 = !DIDerivedType(tag: DW_TAG_member, scope: !43, file: !6, line: 122, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !43, file: !6, line: 122, size: 64, elements: !47)
!47 = !{!48, !52}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt_full", scope: !46, file: !6, line: 124, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !50, line: 30, baseType: !51)
!50 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_int64_t.h", directory: "")
!51 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, scope: !46, file: !6, line: 125, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !46, file: !6, line: 125, size: 64, elements: !54)
!54 = !{!55, !58, !62}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !53, file: !6, line: 131, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !57, line: 31, baseType: !23)
!57 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint32_t.h", directory: "")
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ob_overflow", scope: !53, file: !6, line: 132, baseType: !59, size: 16, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !60, line: 31, baseType: !61)
!60 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint16_t.h", directory: "")
!61 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ob_flags", scope: !53, file: !6, line: 133, baseType: !59, size: 16, offset: 48)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !43, file: !6, line: 144, baseType: !64, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !42, line: 20, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !67, line: 148, size: 3328, elements: !68)
!67 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/object.h", directory: "")
!68 = !{!69, !81, !82, !83, !84, !89, !90, !96, !101, !120, !122, !175, !206, !218, !224, !225, !226, !228, !230, !262, !263, !264, !273, !274, !279, !280, !282, !284, !295, !306, !324, !325, !326, !328, !330, !331, !333, !338, !343, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !364, !366}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !66, file: !67, line: 149, baseType: !70, size: 192)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !6, line: 172, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 169, size: 192, elements: !72)
!72 = !{!73, !74}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !71, file: !6, line: 170, baseType: !41, size: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !71, file: !6, line: 171, baseType: !75, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !76, line: 156, baseType: !77)
!76 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pyport.h", directory: "")
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !78, line: 31, baseType: !79)
!78 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_ssize_t.h", directory: "")
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ssize_t", file: !34, line: 97, baseType: !80)
!80 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !66, file: !67, line: 150, baseType: !18, size: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !66, file: !67, line: 151, baseType: !75, size: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !66, file: !67, line: 151, baseType: !75, size: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !66, file: !67, line: 155, baseType: !85, size: 64, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !6, line: 353, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !40}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall_offset", scope: !66, file: !67, line: 156, baseType: !75, size: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !66, file: !67, line: 157, baseType: !91, size: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !6, line: 354, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!40, !40, !95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !66, file: !67, line: 158, baseType: !97, size: 64, offset: 576)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !6, line: 356, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!7, !40, !95, !40}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_async", scope: !66, file: !67, line: 159, baseType: !102, size: 64, offset: 640)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyAsyncMethods", file: !67, line: 135, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 130, size: 256, elements: !105)
!105 = !{!106, !111, !112, !113}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "am_await", scope: !104, file: !67, line: 131, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !6, line: 336, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!40, !40}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "am_aiter", scope: !104, file: !67, line: 132, baseType: !107, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "am_anext", scope: !104, file: !67, line: 133, baseType: !107, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "am_send", scope: !104, file: !67, line: 134, baseType: !114, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "sendfunc", file: !67, line: 128, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!118, !40, !40, !119}
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySendResult", file: !6, line: 699, baseType: !5)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !66, file: !67, line: 161, baseType: !121, size: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !6, line: 358, baseType: !108)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !66, file: !67, line: 165, baseType: !123, size: 64, offset: 768)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !67, line: 106, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 61, size: 2304, elements: !126)
!126 = !{!127, !132, !133, !134, !135, !136, !141, !142, !143, !144, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !125, file: !67, line: 66, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !6, line: 337, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!40, !40, !40}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !125, file: !67, line: 67, baseType: !128, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !125, file: !67, line: 68, baseType: !128, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !125, file: !67, line: 69, baseType: !128, size: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !125, file: !67, line: 70, baseType: !128, size: 64, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !125, file: !67, line: 71, baseType: !137, size: 64, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !6, line: 338, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!40, !40, !40, !40}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !125, file: !67, line: 72, baseType: !107, size: 64, offset: 384)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !125, file: !67, line: 73, baseType: !107, size: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !125, file: !67, line: 74, baseType: !107, size: 64, offset: 512)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !125, file: !67, line: 75, baseType: !145, size: 64, offset: 576)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !6, line: 339, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!7, !40}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !125, file: !67, line: 76, baseType: !107, size: 64, offset: 640)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !125, file: !67, line: 77, baseType: !128, size: 64, offset: 704)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !125, file: !67, line: 78, baseType: !128, size: 64, offset: 768)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !125, file: !67, line: 79, baseType: !128, size: 64, offset: 832)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !125, file: !67, line: 80, baseType: !128, size: 64, offset: 896)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !125, file: !67, line: 81, baseType: !128, size: 64, offset: 960)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !125, file: !67, line: 82, baseType: !107, size: 64, offset: 1024)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !125, file: !67, line: 83, baseType: !39, size: 64, offset: 1088)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !125, file: !67, line: 84, baseType: !107, size: 64, offset: 1152)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !125, file: !67, line: 86, baseType: !128, size: 64, offset: 1216)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !125, file: !67, line: 87, baseType: !128, size: 64, offset: 1280)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !125, file: !67, line: 88, baseType: !128, size: 64, offset: 1344)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !125, file: !67, line: 89, baseType: !128, size: 64, offset: 1408)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !125, file: !67, line: 90, baseType: !137, size: 64, offset: 1472)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !125, file: !67, line: 91, baseType: !128, size: 64, offset: 1536)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !125, file: !67, line: 92, baseType: !128, size: 64, offset: 1600)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !125, file: !67, line: 93, baseType: !128, size: 64, offset: 1664)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !125, file: !67, line: 94, baseType: !128, size: 64, offset: 1728)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !125, file: !67, line: 95, baseType: !128, size: 64, offset: 1792)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !125, file: !67, line: 97, baseType: !128, size: 64, offset: 1856)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !125, file: !67, line: 98, baseType: !128, size: 64, offset: 1920)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !125, file: !67, line: 99, baseType: !128, size: 64, offset: 1984)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !125, file: !67, line: 100, baseType: !128, size: 64, offset: 2048)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !125, file: !67, line: 102, baseType: !107, size: 64, offset: 2112)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_matrix_multiply", scope: !125, file: !67, line: 104, baseType: !128, size: 64, offset: 2176)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_matrix_multiply", scope: !125, file: !67, line: 105, baseType: !128, size: 64, offset: 2240)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !66, file: !67, line: 166, baseType: !176, size: 64, offset: 832)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !67, line: 120, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 108, size: 640, elements: !179)
!179 = !{!180, !185, !186, !191, !192, !193, !198, !199, !204, !205}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !178, file: !67, line: 109, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !6, line: 340, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!75, !40}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !178, file: !67, line: 110, baseType: !128, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !178, file: !67, line: 111, baseType: !187, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !6, line: 341, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!40, !40, !75}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !178, file: !67, line: 112, baseType: !187, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !178, file: !67, line: 113, baseType: !39, size: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !178, file: !67, line: 114, baseType: !194, size: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !6, line: 343, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!7, !40, !75, !40}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !178, file: !67, line: 115, baseType: !39, size: 64, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !178, file: !67, line: 116, baseType: !200, size: 64, offset: 448)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !6, line: 347, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!7, !40, !40}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !178, file: !67, line: 118, baseType: !128, size: 64, offset: 512)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !178, file: !67, line: 119, baseType: !187, size: 64, offset: 576)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !66, file: !67, line: 167, baseType: !207, size: 64, offset: 896)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !67, line: 126, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 122, size: 192, elements: !210)
!210 = !{!211, !212, !213}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !209, file: !67, line: 123, baseType: !181, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !209, file: !67, line: 124, baseType: !128, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !209, file: !67, line: 125, baseType: !214, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !6, line: 345, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!7, !40, !40, !40}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !66, file: !67, line: 171, baseType: !219, size: 64, offset: 960)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !6, line: 359, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!223, !40}
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !76, line: 170, baseType: !75)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !66, file: !67, line: 172, baseType: !137, size: 64, offset: 1024)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !66, file: !67, line: 173, baseType: !121, size: 64, offset: 1088)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !66, file: !67, line: 174, baseType: !227, size: 64, offset: 1152)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !6, line: 355, baseType: !129)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !66, file: !67, line: 175, baseType: !229, size: 64, offset: 1216)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !6, line: 357, baseType: !215)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !66, file: !67, line: 178, baseType: !231, size: 64, offset: 1280)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !67, line: 140, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 137, size: 128, elements: !234)
!234 = !{!235, !257}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !233, file: !67, line: 138, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !237, line: 35, baseType: !238)
!237 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pybuffer.h", directory: "")
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!7, !40, !241, !7}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !237, line: 33, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !237, line: 20, size: 640, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !254, !255, !256}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !243, file: !237, line: 21, baseType: !39, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !243, file: !237, line: 22, baseType: !40, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !243, file: !237, line: 23, baseType: !75, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !243, file: !237, line: 24, baseType: !75, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !243, file: !237, line: 26, baseType: !7, size: 32, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !243, file: !237, line: 27, baseType: !7, size: 32, offset: 288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !243, file: !237, line: 28, baseType: !95, size: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !243, file: !237, line: 29, baseType: !253, size: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !243, file: !237, line: 30, baseType: !253, size: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !243, file: !237, line: 31, baseType: !253, size: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !243, file: !237, line: 32, baseType: !39, size: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !233, file: !67, line: 139, baseType: !258, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !237, line: 36, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !40, !241}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !66, file: !67, line: 181, baseType: !38, size: 64, offset: 1344)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !66, file: !67, line: 183, baseType: !18, size: 64, offset: 1408)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !66, file: !67, line: 187, baseType: !265, size: 64, offset: 1472)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !6, line: 349, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!7, !40, !269, !39}
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !6, line: 348, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!7, !40, !39}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !66, file: !67, line: 190, baseType: !145, size: 64, offset: 1536)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !66, file: !67, line: 194, baseType: !275, size: 64, offset: 1600)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !6, line: 360, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!40, !40, !40, !7}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !66, file: !67, line: 197, baseType: !75, size: 64, offset: 1664)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !66, file: !67, line: 200, baseType: !281, size: 64, offset: 1728)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !6, line: 361, baseType: !108)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !66, file: !67, line: 201, baseType: !283, size: 64, offset: 1792)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !6, line: 362, baseType: !108)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !66, file: !67, line: 204, baseType: !285, size: 64, offset: 1856)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !42, line: 14, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 68, size: 256, elements: !289)
!288 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/methodobject.h", directory: "")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 69, baseType: !18, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 70, baseType: !292, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 19, baseType: !129)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 71, baseType: !7, size: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 73, baseType: !18, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !66, file: !67, line: 205, baseType: !296, size: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !42, line: 16, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !299, line: 41, size: 320, elements: !300)
!299 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/descrobject.h", directory: "")
!300 = !{!301, !302, !303, !304, !305}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !298, file: !299, line: 42, baseType: !18, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !298, file: !299, line: 43, baseType: !7, size: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !298, file: !299, line: 44, baseType: !75, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !298, file: !299, line: 45, baseType: !7, size: 32, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !298, file: !299, line: 46, baseType: !18, size: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !66, file: !67, line: 206, baseType: !307, size: 64, offset: 1984)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGetSetDef", file: !42, line: 15, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !299, line: 11, size: 320, elements: !310)
!310 = !{!311, !312, !317, !322, !323}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !309, file: !299, line: 12, baseType: !18, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !309, file: !299, line: 13, baseType: !313, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !299, line: 8, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!40, !40, !39}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !309, file: !299, line: 14, baseType: !318, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !299, line: 9, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!7, !40, !40, !39}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !309, file: !299, line: 15, baseType: !18, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !309, file: !299, line: 16, baseType: !39, size: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !66, file: !67, line: 208, baseType: !64, size: 64, offset: 2048)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !66, file: !67, line: 209, baseType: !40, size: 64, offset: 2112)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !66, file: !67, line: 210, baseType: !327, size: 64, offset: 2176)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !6, line: 363, baseType: !138)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !66, file: !67, line: 211, baseType: !329, size: 64, offset: 2240)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !6, line: 364, baseType: !215)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !66, file: !67, line: 212, baseType: !75, size: 64, offset: 2304)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !66, file: !67, line: 213, baseType: !332, size: 64, offset: 2368)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !6, line: 365, baseType: !215)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !66, file: !67, line: 214, baseType: !334, size: 64, offset: 2432)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !6, line: 367, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!40, !64, !75}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !66, file: !67, line: 215, baseType: !339, size: 64, offset: 2496)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !6, line: 366, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!40, !64, !40, !40}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !66, file: !67, line: 216, baseType: !344, size: 64, offset: 2560)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !6, line: 352, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !39}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !66, file: !67, line: 217, baseType: !145, size: 64, offset: 2624)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !66, file: !67, line: 218, baseType: !40, size: 64, offset: 2688)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !66, file: !67, line: 219, baseType: !40, size: 64, offset: 2752)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !66, file: !67, line: 220, baseType: !40, size: 64, offset: 2816)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !66, file: !67, line: 221, baseType: !39, size: 64, offset: 2880)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !66, file: !67, line: 222, baseType: !40, size: 64, offset: 2944)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !66, file: !67, line: 223, baseType: !85, size: 64, offset: 3008)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !66, file: !67, line: 228, baseType: !23, size: 32, offset: 3072)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !66, file: !67, line: 230, baseType: !85, size: 64, offset: 3136)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall", scope: !66, file: !67, line: 231, baseType: !358, size: 64, offset: 3200)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "vectorcallfunc", file: !6, line: 370, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!40, !40, !362, !35, !40}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tp_watched", scope: !66, file: !67, line: 234, baseType: !365, size: 8, offset: 3264)
!365 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tp_versions_used", scope: !66, file: !67, line: 241, baseType: !59, size: 16, offset: 3280)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !368, line: 30, baseType: !7)
!368 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_int32_t.h", directory: "")
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !371, line: 15, baseType: !372)
!371 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/bytesobject.h", directory: "")
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !371, line: 5, size: 320, elements: !373)
!373 = !{!374, !375, !376}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !372, file: !371, line: 6, baseType: !70, size: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !372, file: !371, line: 7, baseType: !223, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !372, file: !371, line: 8, baseType: !377, size: 8, offset: 256)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 1)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunctionObject", file: !382, line: 14, baseType: !383)
!382 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/methodobject.h", directory: "")
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 7, size: 448, elements: !384)
!384 = !{!385, !386, !387, !388, !389, !390}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !383, file: !382, line: 8, baseType: !41, size: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "m_ml", scope: !383, file: !382, line: 9, baseType: !285, size: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "m_self", scope: !383, file: !382, line: 10, baseType: !40, size: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "m_module", scope: !383, file: !382, line: 11, baseType: !40, size: 64, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "m_weakreflist", scope: !383, file: !382, line: 12, baseType: !40, size: 64, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "vectorcall", scope: !383, file: !382, line: 13, baseType: !358, size: 64, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !393, line: 163, baseType: !394)
!393 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/unicodeobject.h", directory: "")
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !393, line: 54, size: 320, elements: !395)
!395 = !{!396, !397, !398, !399}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !394, file: !393, line: 99, baseType: !41, size: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !394, file: !393, line: 100, baseType: !75, size: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !394, file: !393, line: 101, baseType: !223, size: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !394, file: !393, line: 162, baseType: !400, size: 32, offset: 256)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !394, file: !393, line: 107, size: 32, elements: !401)
!401 = !{!402, !403, !404, !405, !406}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !400, file: !393, line: 121, baseType: !23, size: 2, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !400, file: !393, line: 145, baseType: !23, size: 3, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !400, file: !393, line: 150, baseType: !23, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !400, file: !393, line: 154, baseType: !23, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "statically_allocated", scope: !400, file: !393, line: 156, baseType: !23, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyLongObject", file: !42, line: 19, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_longobject", file: !410, line: 98, size: 256, elements: !411)
!410 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/longintrepr.h", directory: "")
!411 = !{!412, !413}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !409, file: !410, line: 99, baseType: !41, size: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "long_value", scope: !409, file: !410, line: 100, baseType: !414, size: 128, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyLongValue", file: !410, line: 96, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PyLongValue", file: !410, line: 93, size: 128, elements: !416)
!416 = !{!417, !420}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "lv_tag", scope: !415, file: !410, line: 94, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !419, line: 34, baseType: !38)
!419 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ob_digit", scope: !415, file: !410, line: 95, baseType: !421, size: 32, offset: 64)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, size: 32, elements: !378)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "digit", file: !410, line: 43, baseType: !56)
!423 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFloatObject", file: !426, line: 8, baseType: !427)
!426 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/floatobject.h", directory: "")
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !426, line: 5, size: 192, elements: !428)
!428 = !{!429, !430}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !427, file: !426, line: 6, baseType: !41, size: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ob_fval", scope: !427, file: !426, line: 7, baseType: !423, size: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !433, line: 13, baseType: !434)
!433 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/tupleobject.h", directory: "")
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !433, line: 5, size: 320, elements: !435)
!435 = !{!436, !437, !438}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !434, file: !433, line: 6, baseType: !70, size: 192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ob_hash", scope: !434, file: !433, line: 8, baseType: !223, size: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !434, file: !433, line: 12, baseType: !439, size: 64, offset: 256)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 64, elements: !378)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !443, line: 22, baseType: !444)
!443 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/listobject.h", directory: "")
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !443, line: 5, size: 320, elements: !445)
!445 = !{!446, !447, !448}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !444, file: !443, line: 6, baseType: !70, size: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !444, file: !443, line: 8, baseType: !119, size: 64, offset: 192)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !444, file: !443, line: 21, baseType: !75, size: 64, offset: 256)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBaseExceptionObject", file: !451, line: 15, baseType: !452)
!451 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/pyerrors.h", directory: "")
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !451, line: 13, size: 576, elements: !453)
!453 = !{!454, !455, !456, !457, !458, !459, !460, !461}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !452, file: !451, line: 14, baseType: !41, size: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !452, file: !451, line: 14, baseType: !40, size: 64, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !452, file: !451, line: 14, baseType: !40, size: 64, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !452, file: !451, line: 14, baseType: !40, size: 64, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", scope: !452, file: !451, line: 14, baseType: !40, size: 64, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !452, file: !451, line: 14, baseType: !40, size: 64, offset: 384)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "cause", scope: !452, file: !451, line: 14, baseType: !40, size: 64, offset: 448)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_context", scope: !452, file: !451, line: 14, baseType: !20, size: 8, offset: 512)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CodeObjectCacheEntry", file: !464, line: 1739, baseType: !465)
!464 = !DIFile(filename: "dataset/cases/goeq-ojva-0090/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c", directory: ".")
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !464, line: 1736, size: 128, elements: !466)
!466 = !{!467, !525}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "code_object", scope: !465, file: !464, line: 1737, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CachedCodeObjectType", file: !464, line: 1734, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !42, line: 21, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyCodeObject", file: !472, line: 115, size: 1728, elements: !473)
!472 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/code.h", directory: "")
!473 = !{!474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !508, !517, !518, !521, !522, !523, !524}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !471, file: !472, line: 115, baseType: !70, size: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !471, file: !472, line: 115, baseType: !40, size: 64, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !471, file: !472, line: 115, baseType: !40, size: 64, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "co_exceptiontable", scope: !471, file: !472, line: 115, baseType: !40, size: 64, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !471, file: !472, line: 115, baseType: !7, size: 32, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !471, file: !472, line: 115, baseType: !7, size: 32, offset: 416)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "co_posonlyargcount", scope: !471, file: !472, line: 115, baseType: !7, size: 32, offset: 448)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !471, file: !472, line: 115, baseType: !7, size: 32, offset: 480)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !471, file: !472, line: 115, baseType: !7, size: 32, offset: 512)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !471, file: !472, line: 115, baseType: !7, size: 32, offset: 544)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocalsplus", scope: !471, file: !472, line: 115, baseType: !7, size: 32, offset: 576)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "co_framesize", scope: !471, file: !472, line: 115, baseType: !7, size: 32, offset: 608)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !471, file: !472, line: 115, baseType: !7, size: 32, offset: 640)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "co_ncellvars", scope: !471, file: !472, line: 115, baseType: !7, size: 32, offset: 672)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "co_nfreevars", scope: !471, file: !472, line: 115, baseType: !7, size: 32, offset: 704)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "co_version", scope: !471, file: !472, line: 115, baseType: !56, size: 32, offset: 736)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "co_localsplusnames", scope: !471, file: !472, line: 115, baseType: !40, size: 64, offset: 768)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "co_localspluskinds", scope: !471, file: !472, line: 115, baseType: !40, size: 64, offset: 832)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !471, file: !472, line: 115, baseType: !40, size: 64, offset: 896)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !471, file: !472, line: 115, baseType: !40, size: 64, offset: 960)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "co_qualname", scope: !471, file: !472, line: 115, baseType: !40, size: 64, offset: 1024)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "co_linetable", scope: !471, file: !472, line: 115, baseType: !40, size: 64, offset: 1088)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !471, file: !472, line: 115, baseType: !40, size: 64, offset: 1152)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "co_executors", scope: !471, file: !472, line: 115, baseType: !498, size: 64, offset: 1216)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyExecutorArray", file: !472, line: 22, baseType: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !472, line: 18, size: 128, elements: !501)
!501 = !{!502, !503, !504}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !500, file: !472, line: 19, baseType: !7, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !500, file: !472, line: 20, baseType: !7, size: 32, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "executors", scope: !500, file: !472, line: 21, baseType: !505, size: 64, offset: 64)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 64, elements: !378)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyExecutorObject", file: !472, line: 21, flags: DIFlagFwdDecl)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_co_cached", scope: !471, file: !472, line: 115, baseType: !509, size: 64, offset: 1280)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyCoCached", file: !472, line: 16, baseType: !511)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !472, line: 11, size: 256, elements: !512)
!512 = !{!513, !514, !515, !516}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_co_code", scope: !511, file: !472, line: 12, baseType: !40, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_co_varnames", scope: !511, file: !472, line: 13, baseType: !40, size: 64, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_co_cellvars", scope: !511, file: !472, line: 14, baseType: !40, size: 64, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_co_freevars", scope: !511, file: !472, line: 15, baseType: !40, size: 64, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_co_instrumentation_version", scope: !471, file: !472, line: 115, baseType: !418, size: 64, offset: 1344)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_co_monitoring", scope: !471, file: !472, line: 115, baseType: !519, size: 64, offset: 1408)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyCoMonitoringData", file: !472, line: 115, flags: DIFlagFwdDecl)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_co_unique_id", scope: !471, file: !472, line: 115, baseType: !75, size: 64, offset: 1472)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_co_firsttraceable", scope: !471, file: !472, line: 115, baseType: !7, size: 32, offset: 1536)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "co_extra", scope: !471, file: !472, line: 115, baseType: !39, size: 64, offset: 1600)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "co_code_adaptive", scope: !471, file: !472, line: 115, baseType: !377, size: 8, offset: 1664)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "code_line", scope: !465, file: !464, line: 1738, baseType: !7, size: 32, offset: 64)
!526 = !{!0, !527, !532, !534, !539, !569, !572, !577, !582, !587, !592, !594, !596, !598, !603, !608, !610, !616, !621, !623, !628, !652, !654, !659, !664, !669, !671, !676, !680, !685, !687, !689, !694, !697, !702, !704, !706, !708, !713, !715, !717, !719, !724, !726, !729, !734, !739, !744, !749, !754, !756, !758, !760, !762, !764, !766, !771, !776, !779, !781, !783, !788, !790, !793, !795, !798, !803, !808, !813, !815, !817, !819, !822, !827, !829, !831, !833, !835, !837, !842, !844, !849}
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !464, line: 3558, type: !529, isLocal: true, isDefinition: true)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, elements: !530)
!530 = !{!531}
!531 = !DISubrange(count: 16)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !464, line: 3565, type: !377, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(scope: null, file: !464, line: 2135, type: !536, isLocal: true, isDefinition: true)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 72, elements: !537)
!537 = !{!538}
!538 = !DISubrange(count: 9)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "__pyx_moduledef", scope: !2, file: !464, line: 2131, type: !541, isLocal: true, isDefinition: true)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !542, line: 107, size: 832, elements: !543)
!542 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/moduleobject.h", directory: "")
!543 = !{!544, !555, !556, !557, !558, !559, !566, !567, !568}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !541, file: !542, line: 108, baseType: !545, size: 320)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !542, line: 58, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !542, line: 39, size: 320, elements: !547)
!547 = !{!548, !549, !553, !554}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !546, file: !542, line: 40, baseType: !41, size: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !546, file: !542, line: 47, baseType: !550, size: 64, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!40}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !546, file: !542, line: 52, baseType: !75, size: 64, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !546, file: !542, line: 57, baseType: !40, size: 64, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !541, file: !542, line: 109, baseType: !18, size: 64, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !541, file: !542, line: 110, baseType: !18, size: 64, offset: 384)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !541, file: !542, line: 111, baseType: !75, size: 64, offset: 448)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !541, file: !542, line: 112, baseType: !285, size: 64, offset: 512)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "m_slots", scope: !541, file: !542, line: 113, baseType: !560, size: 64, offset: 576)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Slot", file: !42, line: 13, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Slot", file: !542, line: 69, size: 128, elements: !563)
!563 = !{!564, !565}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !562, file: !542, line: 70, baseType: !7, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !562, file: !542, line: 71, baseType: !39, size: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !541, file: !542, line: 114, baseType: !265, size: 64, offset: 640)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !541, file: !542, line: 115, baseType: !145, size: 64, offset: 704)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !541, file: !542, line: 116, baseType: !344, size: 64, offset: 768)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "__pyx_methods", scope: !2, file: !464, line: 2029, type: !571, isLocal: true, isDefinition: true)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 256, elements: !378)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "__pyx_moduledef_slots", scope: !2, file: !464, line: 2114, type: !574, isLocal: true, isDefinition: true)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 384, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 3)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !464, line: 2263, type: !579, isLocal: true, isDefinition: true)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 40, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 5)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(scope: null, file: !464, line: 2270, type: !584, isLocal: true, isDefinition: true)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 56, elements: !585)
!585 = !{!586}
!586 = !DISubrange(count: 7)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !464, line: 2270, type: !589, isLocal: true, isDefinition: true)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 88, elements: !590)
!590 = !{!591}
!591 = !DISubrange(count: 11)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(scope: null, file: !464, line: 2271, type: !584, isLocal: true, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !464, line: 2271, type: !536, isLocal: true, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !464, line: 2272, type: !584, isLocal: true, isDefinition: true)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !464, line: 2272, type: !600, isLocal: true, isDefinition: true)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 96, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 12)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !464, line: 2273, type: !605, isLocal: true, isDefinition: true)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 216, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 27)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !464, line: 2273, type: !536, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "main_interpreter_id", scope: !612, file: !464, line: 2210, type: !49, isLocal: true, isDefinition: true)
!612 = distinct !DISubprogram(name: "__Pyx_check_single_interpreter", scope: !464, file: !464, line: 2209, type: !613, scopeLine: 2209, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !615)
!613 = !DISubroutineType(types: !614)
!614 = !{!7}
!615 = !{}
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !464, line: 2232, type: !618, isLocal: true, isDefinition: true)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 760, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 95)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "__pyx_m", scope: !2, file: !464, line: 1326, type: !40, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !464, line: 2310, type: !625, isLocal: true, isDefinition: true)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 648, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 81)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "__pyx_mstate_global", scope: !2, file: !464, line: 1966, type: !630, isLocal: true, isDefinition: true)
!630 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pyx_mstatetype", file: !464, line: 1945, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !464, line: 1931, size: 1664, elements: !634)
!634 = !{!635, !636, !637, !638, !639, !640, !641, !645, !646}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_d", scope: !633, file: !464, line: 1932, baseType: !40, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_b", scope: !633, file: !464, line: 1933, baseType: !40, size: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_cython_runtime", scope: !633, file: !464, line: 1934, baseType: !40, size: 64, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_tuple", scope: !633, file: !464, line: 1935, baseType: !40, size: 64, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_bytes", scope: !633, file: !464, line: 1936, baseType: !40, size: 64, offset: 256)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_unicode", scope: !633, file: !464, line: 1937, baseType: !40, size: 64, offset: 320)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_string_tab", scope: !633, file: !464, line: 1938, baseType: !642, size: 1088, offset: 384)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 1088, elements: !643)
!643 = !{!644}
!644 = !DISubrange(count: 17)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_number_tab", scope: !633, file: !464, line: 1939, baseType: !439, size: 64, offset: 1472)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_code_cache", scope: !633, file: !464, line: 1942, baseType: !647, size: 128, offset: 1536)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__Pyx_CodeObjectCache", file: !464, line: 1740, size: 128, elements: !648)
!648 = !{!649, !650, !651}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !647, file: !464, line: 1741, baseType: !7, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "max_count", scope: !647, file: !464, line: 1742, baseType: !7, size: 32, offset: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !647, file: !464, line: 1743, baseType: !462, size: 64, offset: 64)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !464, line: 2340, type: !536, isLocal: true, isDefinition: true)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(scope: null, file: !464, line: 2341, type: !656, isLocal: true, isDefinition: true)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 120, elements: !657)
!657 = !{!658}
!658 = !DISubrange(count: 15)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !464, line: 2342, type: !661, isLocal: true, isDefinition: true)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 104, elements: !662)
!662 = !{!663}
!663 = !DISubrange(count: 13)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !464, line: 2592, type: !666, isLocal: true, isDefinition: true)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 112, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 14)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "__pyx_mstate_global_static", scope: !2, file: !464, line: 1960, type: !632, isLocal: true, isDefinition: true)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(scope: null, file: !464, line: 1336, type: !673, isLocal: true, isDefinition: true)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 440, elements: !674)
!674 = !{!675}
!675 = !DISubrange(count: 55)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "__pyx_f", scope: !2, file: !464, line: 1335, type: !678, isLocal: true, isDefinition: true)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !679, size: 64, elements: !378)
!679 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !464, line: 4421, type: !682, isLocal: true, isDefinition: true)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 624, elements: !683)
!683 = !{!684}
!684 = !DISubrange(count: 78)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !464, line: 4427, type: !656, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !464, line: 4427, type: !656, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !464, line: 2655, type: !691, isLocal: true, isDefinition: true)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 672, elements: !692)
!692 = !{!693}
!693 = !DISubrange(count: 84)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !464, line: 4437, type: !696, isLocal: true, isDefinition: true)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 136, elements: !643)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !464, line: 4437, type: !699, isLocal: true, isDefinition: true)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 32, elements: !700)
!700 = !{!701}
!701 = !DISubrange(count: 4)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(scope: null, file: !464, line: 4437, type: !579, isLocal: true, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !464, line: 4438, type: !589, isLocal: true, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !464, line: 4442, type: !699, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !464, line: 4489, type: !710, isLocal: true, isDefinition: true)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1224, elements: !711)
!711 = !{!712}
!712 = !DISubrange(count: 153)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "__pyx_filename", scope: !2, file: !464, line: 1331, type: !18, isLocal: true, isDefinition: true)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "__pyx_lineno", scope: !2, file: !464, line: 1328, type: !7, isLocal: true, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "__pyx_clineno", scope: !2, file: !464, line: 1329, type: !7, isLocal: true, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(scope: null, file: !371, line: 25, type: !721, isLocal: true, isDefinition: true)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 144, elements: !722)
!722 = !{!723}
!723 = !DISubrange(count: 18)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !371, line: 25, type: !666, isLocal: true, isDefinition: true)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(scope: null, file: !371, line: 25, type: !728, isLocal: true, isDefinition: true)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 144, elements: !722)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !464, line: 2915, type: !731, isLocal: true, isDefinition: true)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 200, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 25)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !464, line: 2947, type: !736, isLocal: true, isDefinition: true)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 248, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 31)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !464, line: 2954, type: !741, isLocal: true, isDefinition: true)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 344, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 43)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !464, line: 2992, type: !746, isLocal: true, isDefinition: true)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 224, elements: !747)
!747 = !{!748}
!748 = !DISubrange(count: 28)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !464, line: 2992, type: !751, isLocal: true, isDefinition: true)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 80, elements: !752)
!752 = !{!753}
!753 = !DISubrange(count: 10)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !464, line: 2992, type: !605, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !464, line: 2994, type: !589, isLocal: true, isDefinition: true)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(name: "__pyx_builtin_input", scope: !2, file: !464, line: 1910, type: !40, isLocal: true, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(scope: null, file: !426, line: 16, type: !721, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !426, line: 16, type: !666, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !426, line: 16, type: !728, isLocal: true, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(scope: null, file: !464, line: 4279, type: !768, isLocal: true, isDefinition: true)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 160, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 20)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(scope: null, file: !464, line: 4279, type: !773, isLocal: true, isDefinition: true)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 152, elements: !774)
!774 = !{!775}
!775 = !DISubrange(count: 19)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(scope: null, file: !433, line: 24, type: !778, isLocal: true, isDefinition: true)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 136, elements: !643)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !433, line: 24, type: !666, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !433, line: 24, type: !728, isLocal: true, isDefinition: true)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(scope: null, file: !6, line: 284, type: !785, isLocal: true, isDefinition: true)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 64, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 8)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !6, line: 284, type: !536, isLocal: true, isDefinition: true)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(scope: null, file: !6, line: 284, type: !792, isLocal: true, isDefinition: true)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 224, elements: !747)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(scope: null, file: !6, line: 285, type: !792, isLocal: true, isDefinition: true)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(scope: null, file: !464, line: 4264, type: !797, isLocal: true, isDefinition: true)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 128, elements: !530)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(scope: null, file: !464, line: 4296, type: !800, isLocal: true, isDefinition: true)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 312, elements: !801)
!801 = !{!802}
!802 = !DISubrange(count: 39)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(scope: null, file: !464, line: 4296, type: !805, isLocal: true, isDefinition: true)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 264, elements: !806)
!806 = !{!807}
!807 = !DISubrange(count: 33)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(scope: null, file: !464, line: 4299, type: !810, isLocal: true, isDefinition: true)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 168, elements: !811)
!811 = !{!812}
!812 = !DISubrange(count: 21)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "__pyx_7genexpr__pyx_v_8original_A", scope: !2, file: !464, line: 1901, type: !40, isLocal: true, isDefinition: true)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(name: "__pyx_builtin_map", scope: !2, file: !464, line: 1915, type: !40, isLocal: true, isDefinition: true)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "__pyx_builtin_sum", scope: !2, file: !464, line: 1914, type: !40, isLocal: true, isDefinition: true)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(scope: null, file: !6, line: 308, type: !821, isLocal: true, isDefinition: true)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 96, elements: !601)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(scope: null, file: !6, line: 308, type: !824, isLocal: true, isDefinition: true)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 352, elements: !825)
!825 = !{!826}
!826 = !DISubrange(count: 44)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(scope: null, file: !6, line: 309, type: !824, isLocal: true, isDefinition: true)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "__pyx_builtin_max", scope: !2, file: !464, line: 1912, type: !40, isLocal: true, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "__pyx_builtin_min", scope: !2, file: !464, line: 1913, type: !40, isLocal: true, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "__pyx_builtin_print", scope: !2, file: !464, line: 1911, type: !40, isLocal: true, isDefinition: true)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(scope: null, file: !464, line: 3433, type: !589, isLocal: true, isDefinition: true)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(scope: null, file: !464, line: 1330, type: !839, isLocal: true, isDefinition: true)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 952, elements: !840)
!840 = !{!841}
!841 = !DISubrange(count: 119)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "__pyx_cfilenm", scope: !2, file: !464, line: 1330, type: !679, isLocal: true, isDefinition: true)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(scope: null, file: !464, line: 2817, type: !846, isLocal: true, isDefinition: true)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 192, elements: !847)
!847 = !{!848}
!848 = !DISubrange(count: 24)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(scope: null, file: !464, line: 2817, type: !851, isLocal: true, isDefinition: true)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 560, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 70)
!854 = !{i32 2, !"SDK Version", [2 x i32] [i32 14, i32 4]}
!855 = !{i32 7, !"Dwarf Version", i32 4}
!856 = !{i32 2, !"Debug Info Version", i32 3}
!857 = !{i32 1, !"wchar_size", i32 4}
!858 = !{i32 8, !"PIC Level", i32 2}
!859 = !{i32 7, !"uwtable", i32 1}
!860 = !{i32 7, !"frame-pointer", i32 1}
!861 = !{!"Homebrew clang version 20.1.8"}
!862 = distinct !DISubprogram(name: "PyInit_original", scope: !464, file: !464, line: 2174, type: !551, scopeLine: 2176, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2)
!863 = !DILocation(line: 2177, column: 10, scope: !862)
!864 = !DILocation(line: 2177, column: 3, scope: !862)
!865 = distinct !DISubprogram(name: "main", scope: !464, file: !464, line: 3547, type: !866, scopeLine: 3548, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !615)
!866 = !DISubroutineType(types: !867)
!867 = !{!7, !7, !868}
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!869 = !DILocalVariable(name: "argc", arg: 1, scope: !865, file: !464, line: 3547, type: !7)
!870 = !DILocation(line: 3547, column: 10, scope: !865)
!871 = !DILocalVariable(name: "argv", arg: 2, scope: !865, file: !464, line: 3547, type: !868)
!872 = !DILocation(line: 3547, column: 23, scope: !865)
!873 = !DILocation(line: 3549, column: 10, scope: !874)
!874 = distinct !DILexicalBlock(scope: !865, file: !464, line: 3549, column: 9)
!875 = !DILocation(line: 3549, column: 9, scope: !874)
!876 = !DILocation(line: 3550, column: 16, scope: !877)
!877 = distinct !DILexicalBlock(scope: !874, file: !464, line: 3549, column: 16)
!878 = !DILocation(line: 3550, column: 9, scope: !877)
!879 = !DILocalVariable(name: "i", scope: !880, file: !464, line: 3553, type: !7)
!880 = distinct !DILexicalBlock(scope: !874, file: !464, line: 3552, column: 10)
!881 = !DILocation(line: 3553, column: 13, scope: !880)
!882 = !DILocalVariable(name: "res", scope: !880, file: !464, line: 3553, type: !7)
!883 = !DILocation(line: 3553, column: 16, scope: !880)
!884 = !DILocalVariable(name: "argv_copy", scope: !880, file: !464, line: 3554, type: !29)
!885 = !DILocation(line: 3554, column: 19, scope: !880)
!886 = !DILocation(line: 3554, column: 78, scope: !880)
!887 = !DILocation(line: 3554, column: 69, scope: !880)
!888 = !DILocation(line: 3554, column: 67, scope: !880)
!889 = !DILocation(line: 3554, column: 43, scope: !880)
!890 = !DILocalVariable(name: "argv_copy2", scope: !880, file: !464, line: 3555, type: !29)
!891 = !DILocation(line: 3555, column: 19, scope: !880)
!892 = !DILocation(line: 3555, column: 79, scope: !880)
!893 = !DILocation(line: 3555, column: 70, scope: !880)
!894 = !DILocation(line: 3555, column: 68, scope: !880)
!895 = !DILocation(line: 3555, column: 44, scope: !880)
!896 = !DILocalVariable(name: "oldloc", scope: !880, file: !464, line: 3556, type: !95)
!897 = !DILocation(line: 3556, column: 15, scope: !880)
!898 = !DILocation(line: 3556, column: 31, scope: !880)
!899 = !DILocation(line: 3556, column: 24, scope: !880)
!900 = !DILocation(line: 3557, column: 14, scope: !901)
!901 = distinct !DILexicalBlock(scope: !880, file: !464, line: 3557, column: 13)
!902 = !DILocation(line: 3557, column: 24, scope: !901)
!903 = !DILocation(line: 3557, column: 28, scope: !901)
!904 = !DILocation(line: 3557, column: 39, scope: !901)
!905 = !DILocation(line: 3557, column: 43, scope: !901)
!906 = !DILocation(line: 3558, column: 21, scope: !907)
!907 = distinct !DILexicalBlock(scope: !901, file: !464, line: 3557, column: 51)
!908 = !DILocation(line: 3558, column: 13, scope: !907)
!909 = !DILocation(line: 3559, column: 18, scope: !907)
!910 = !DILocation(line: 3559, column: 13, scope: !907)
!911 = !DILocation(line: 3560, column: 18, scope: !907)
!912 = !DILocation(line: 3560, column: 13, scope: !907)
!913 = !DILocation(line: 3561, column: 18, scope: !907)
!914 = !DILocation(line: 3561, column: 13, scope: !907)
!915 = !DILocation(line: 3562, column: 13, scope: !907)
!916 = !DILocation(line: 3564, column: 13, scope: !880)
!917 = !DILocation(line: 3565, column: 9, scope: !880)
!918 = !DILocation(line: 3566, column: 16, scope: !919)
!919 = distinct !DILexicalBlock(scope: !880, file: !464, line: 3566, column: 9)
!920 = !DILocation(line: 3566, column: 14, scope: !919)
!921 = !DILocation(line: 3566, column: 21, scope: !922)
!922 = distinct !DILexicalBlock(scope: !919, file: !464, line: 3566, column: 9)
!923 = !DILocation(line: 3566, column: 25, scope: !922)
!924 = !DILocation(line: 3566, column: 23, scope: !922)
!925 = !DILocation(line: 3566, column: 9, scope: !919)
!926 = !DILocation(line: 3567, column: 60, scope: !927)
!927 = distinct !DILexicalBlock(scope: !922, file: !464, line: 3566, column: 36)
!928 = !DILocation(line: 3567, column: 65, scope: !927)
!929 = !DILocation(line: 3567, column: 44, scope: !927)
!930 = !DILocation(line: 3567, column: 29, scope: !927)
!931 = !DILocation(line: 3567, column: 39, scope: !927)
!932 = !DILocation(line: 3567, column: 42, scope: !927)
!933 = !DILocation(line: 3567, column: 13, scope: !927)
!934 = !DILocation(line: 3567, column: 24, scope: !927)
!935 = !DILocation(line: 3567, column: 27, scope: !927)
!936 = !DILocation(line: 3568, column: 18, scope: !937)
!937 = distinct !DILexicalBlock(scope: !927, file: !464, line: 3568, column: 17)
!938 = !DILocation(line: 3568, column: 28, scope: !937)
!939 = !DILocation(line: 3568, column: 17, scope: !937)
!940 = !DILocation(line: 3568, column: 36, scope: !937)
!941 = !DILocation(line: 3568, column: 32, scope: !937)
!942 = !DILocation(line: 3569, column: 9, scope: !927)
!943 = !DILocation(line: 3566, column: 32, scope: !922)
!944 = !DILocation(line: 3566, column: 9, scope: !922)
!945 = distinct !{!945, !925, !946, !947}
!946 = !DILocation(line: 3569, column: 9, scope: !919)
!947 = !{!"llvm.loop.mustprogress"}
!948 = !DILocation(line: 3570, column: 27, scope: !880)
!949 = !DILocation(line: 3570, column: 9, scope: !880)
!950 = !DILocation(line: 3571, column: 14, scope: !880)
!951 = !DILocation(line: 3571, column: 9, scope: !880)
!952 = !DILocation(line: 3572, column: 13, scope: !953)
!953 = distinct !DILexicalBlock(scope: !880, file: !464, line: 3572, column: 13)
!954 = !DILocation(line: 3572, column: 17, scope: !953)
!955 = !DILocation(line: 3573, column: 30, scope: !953)
!956 = !DILocation(line: 3573, column: 36, scope: !953)
!957 = !DILocation(line: 3573, column: 19, scope: !953)
!958 = !DILocation(line: 3573, column: 17, scope: !953)
!959 = !DILocation(line: 3573, column: 13, scope: !953)
!960 = !DILocation(line: 3574, column: 16, scope: !961)
!961 = distinct !DILexicalBlock(scope: !880, file: !464, line: 3574, column: 9)
!962 = !DILocation(line: 3574, column: 14, scope: !961)
!963 = !DILocation(line: 3574, column: 21, scope: !964)
!964 = distinct !DILexicalBlock(scope: !961, file: !464, line: 3574, column: 9)
!965 = !DILocation(line: 3574, column: 25, scope: !964)
!966 = !DILocation(line: 3574, column: 23, scope: !964)
!967 = !DILocation(line: 3574, column: 9, scope: !961)
!968 = !DILocation(line: 3575, column: 27, scope: !969)
!969 = distinct !DILexicalBlock(scope: !964, file: !464, line: 3574, column: 36)
!970 = !DILocation(line: 3575, column: 38, scope: !969)
!971 = !DILocation(line: 3575, column: 13, scope: !969)
!972 = !DILocation(line: 3576, column: 9, scope: !969)
!973 = !DILocation(line: 3574, column: 32, scope: !964)
!974 = !DILocation(line: 3574, column: 9, scope: !964)
!975 = distinct !{!975, !967, !976, !947}
!976 = !DILocation(line: 3576, column: 9, scope: !961)
!977 = !DILocation(line: 3577, column: 14, scope: !880)
!978 = !DILocation(line: 3577, column: 9, scope: !880)
!979 = !DILocation(line: 3578, column: 14, scope: !880)
!980 = !DILocation(line: 3578, column: 9, scope: !880)
!981 = !DILocation(line: 3579, column: 16, scope: !880)
!982 = !DILocation(line: 3579, column: 9, scope: !880)
!983 = !DILocation(line: 3581, column: 1, scope: !865)
!984 = distinct !DISubprogram(name: "__Pyx_main", scope: !464, file: !464, line: 3492, type: !985, scopeLine: 3494, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !615)
!985 = !DISubroutineType(types: !986)
!986 = !{!7, !7, !29}
!987 = !DILocalVariable(name: "argc", arg: 1, scope: !984, file: !464, line: 3492, type: !7)
!988 = !DILocation(line: 3492, column: 27, scope: !984)
!989 = !DILocalVariable(name: "argv", arg: 2, scope: !984, file: !464, line: 3492, type: !29)
!990 = !DILocation(line: 3492, column: 43, scope: !984)
!991 = !DILocation(line: 3505, column: 9, scope: !992)
!992 = distinct !DILexicalBlock(scope: !984, file: !464, line: 3505, column: 9)
!993 = !DILocation(line: 3505, column: 61, scope: !992)
!994 = !DILocation(line: 3505, column: 66, scope: !992)
!995 = !DILocalVariable(name: "status", scope: !996, file: !464, line: 3507, type: !997)
!996 = distinct !DILexicalBlock(scope: !984, file: !464, line: 3506, column: 5)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyStatus", file: !13, line: 19, baseType: !14)
!998 = !DILocation(line: 3507, column: 18, scope: !996)
!999 = !DILocalVariable(name: "config", scope: !996, file: !464, line: 3508, type: !1000)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyConfig", file: !13, line: 244, baseType: !1001)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyConfig", file: !13, line: 134, size: 3648, elements: !1002)
!1002 = !{!1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_config_init", scope: !1001, file: !13, line: 135, baseType: !7, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "isolated", scope: !1001, file: !13, line: 137, baseType: !7, size: 32, offset: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "use_environment", scope: !1001, file: !13, line: 138, baseType: !7, size: 32, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "dev_mode", scope: !1001, file: !13, line: 139, baseType: !7, size: 32, offset: 96)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "install_signal_handlers", scope: !1001, file: !13, line: 140, baseType: !7, size: 32, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "use_hash_seed", scope: !1001, file: !13, line: 141, baseType: !7, size: 32, offset: 160)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "hash_seed", scope: !1001, file: !13, line: 142, baseType: !38, size: 64, offset: 192)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "faulthandler", scope: !1001, file: !13, line: 143, baseType: !7, size: 32, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "tracemalloc", scope: !1001, file: !13, line: 144, baseType: !7, size: 32, offset: 288)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "perf_profiling", scope: !1001, file: !13, line: 145, baseType: !7, size: 32, offset: 320)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "remote_debug", scope: !1001, file: !13, line: 146, baseType: !7, size: 32, offset: 352)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "import_time", scope: !1001, file: !13, line: 147, baseType: !7, size: 32, offset: 384)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "code_debug_ranges", scope: !1001, file: !13, line: 148, baseType: !7, size: 32, offset: 416)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "show_ref_count", scope: !1001, file: !13, line: 149, baseType: !7, size: 32, offset: 448)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "dump_refs", scope: !1001, file: !13, line: 150, baseType: !7, size: 32, offset: 480)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "dump_refs_file", scope: !1001, file: !13, line: 151, baseType: !30, size: 64, offset: 512)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_stats", scope: !1001, file: !13, line: 152, baseType: !7, size: 32, offset: 576)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "filesystem_encoding", scope: !1001, file: !13, line: 153, baseType: !30, size: 64, offset: 640)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "filesystem_errors", scope: !1001, file: !13, line: 154, baseType: !30, size: 64, offset: 704)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "pycache_prefix", scope: !1001, file: !13, line: 155, baseType: !30, size: 64, offset: 768)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "parse_argv", scope: !1001, file: !13, line: 156, baseType: !7, size: 32, offset: 832)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "orig_argv", scope: !1001, file: !13, line: 157, baseType: !1025, size: 128, offset: 896)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyWideStringList", file: !13, line: 36, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 31, size: 128, elements: !1027)
!1027 = !{!1028, !1029}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1026, file: !13, line: 34, baseType: !75, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !1026, file: !13, line: 35, baseType: !29, size: 64, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !1001, file: !13, line: 158, baseType: !1025, size: 128, offset: 1024)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "xoptions", scope: !1001, file: !13, line: 159, baseType: !1025, size: 128, offset: 1152)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "warnoptions", scope: !1001, file: !13, line: 160, baseType: !1025, size: 128, offset: 1280)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "site_import", scope: !1001, file: !13, line: 161, baseType: !7, size: 32, offset: 1408)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_warning", scope: !1001, file: !13, line: 162, baseType: !7, size: 32, offset: 1440)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "warn_default_encoding", scope: !1001, file: !13, line: 163, baseType: !7, size: 32, offset: 1472)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "inspect", scope: !1001, file: !13, line: 164, baseType: !7, size: 32, offset: 1504)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !1001, file: !13, line: 165, baseType: !7, size: 32, offset: 1536)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "optimization_level", scope: !1001, file: !13, line: 166, baseType: !7, size: 32, offset: 1568)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "parser_debug", scope: !1001, file: !13, line: 167, baseType: !7, size: 32, offset: 1600)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "write_bytecode", scope: !1001, file: !13, line: 168, baseType: !7, size: 32, offset: 1632)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !1001, file: !13, line: 169, baseType: !7, size: 32, offset: 1664)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !1001, file: !13, line: 170, baseType: !7, size: 32, offset: 1696)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "user_site_directory", scope: !1001, file: !13, line: 171, baseType: !7, size: 32, offset: 1728)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "configure_c_stdio", scope: !1001, file: !13, line: 172, baseType: !7, size: 32, offset: 1760)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "buffered_stdio", scope: !1001, file: !13, line: 173, baseType: !7, size: 32, offset: 1792)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "stdio_encoding", scope: !1001, file: !13, line: 174, baseType: !30, size: 64, offset: 1856)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "stdio_errors", scope: !1001, file: !13, line: 175, baseType: !30, size: 64, offset: 1920)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "check_hash_pycs_mode", scope: !1001, file: !13, line: 179, baseType: !30, size: 64, offset: 1984)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "use_frozen_modules", scope: !1001, file: !13, line: 180, baseType: !7, size: 32, offset: 2048)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "safe_path", scope: !1001, file: !13, line: 181, baseType: !7, size: 32, offset: 2080)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "int_max_str_digits", scope: !1001, file: !13, line: 182, baseType: !7, size: 32, offset: 2112)
