; ModuleID = 'dataset/cases/goeq-ojva-0075/artifacts/cython-clang-llvm-o0-embed-v1/prog_a/program.c'
source_filename = "dataset/cases/goeq-ojva-0075/artifacts/cython-clang-llvm-o0-embed-v1/prog_a/program.c"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx14.0.0"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr }
%struct.PyModuleDef_Base = type { %struct._object, ptr, i64, ptr }
%struct._object = type { %union.anon, ptr }
%union.anon = type { i64 }
%struct.PyMethodDef = type { ptr, ptr, i32, ptr }
%struct.__pyx_mstatetype = type { ptr, ptr, ptr, ptr, ptr, ptr, [1 x ptr], [19 x ptr], [3 x ptr], %struct.__Pyx_CodeObjectCache }
%struct.__Pyx_CodeObjectCache = type { i32, i32, ptr }
%struct._typeobject = type { %struct.PyVarObject, ptr, i64, i64, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, ptr, i8, i16 }
%struct.PyVarObject = type { %struct._object, i64 }
%struct.anon.1 = type { i8, [3 x i8] }
%struct._longobject = type { %struct._object, %struct._PyLongValue }
%struct._PyLongValue = type { i64, [1 x i32] }
%struct.PyStatus = type { i32, ptr, ptr, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__pyx_module_is_main_original", scope: !2, file: !13, line: 1972, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Homebrew clang version 20.1.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !35, globals: !532, splitDebugInlining: false, nameTableKind: Apple, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk", sdk: "MacOSX14.sdk")
!3 = !DIFile(filename: "dataset/cases/goeq-ojva-0075/artifacts/cython-clang-llvm-o0-embed-v1/prog_a/program.c", directory: ".")
!4 = !{!5, !12, !20}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 695, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/object.h", directory: "")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "PYGEN_RETURN", value: 0)
!10 = !DIEnumerator(name: "PYGEN_ERROR", value: -1)
!11 = !DIEnumerator(name: "PYGEN_NEXT", value: 1)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__Pyx_ReferenceSharing", file: !13, line: 876, baseType: !14, size: 32, elements: !15)
!13 = !DIFile(filename: "dataset/cases/goeq-ojva-0075/artifacts/cython-clang-llvm-o0-embed-v1/prog_a/program.c", directory: ".")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "__Pyx_ReferenceSharing_DefinitelyUnique", value: 0)
!17 = !DIEnumerator(name: "__Pyx_ReferenceSharing_OwnStrongReference", value: 1)
!18 = !DIEnumerator(name: "__Pyx_ReferenceSharing_FunctionArgument", value: 2)
!19 = !DIEnumerator(name: "__Pyx_ReferenceSharing_SharedReference", value: 3)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !22, file: !21, line: 11, baseType: !14, size: 32, elements: !31)
!21 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/initconfig.h", directory: "")
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 10, size: 256, elements: !23)
!23 = !{!24, !25, !29, !30}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_type", scope: !22, file: !21, line: 15, baseType: !20, size: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !22, file: !21, line: 16, baseType: !26, size: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "err_msg", scope: !22, file: !21, line: 17, baseType: !26, size: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "exitcode", scope: !22, file: !21, line: 18, baseType: !7, size: 32, offset: 192)
!31 = !{!32, !33, !34}
!32 = !DIEnumerator(name: "_PyStatus_TYPE_OK", value: 0)
!33 = !DIEnumerator(name: "_PyStatus_TYPE_ERROR", value: 1)
!34 = !DIEnumerator(name: "_PyStatus_TYPE_EXIT", value: 2)
!35 = !{!36, !42, !46, !47, !374, !376, !387, !82, !7, !26, !102, !395, !404, !415, !416, !429, !445, !45, !460, !461, !462, !87, !71, !469}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !39, line: 34, baseType: !40)
!39 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_wchar_t.h", directory: "")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wchar_t", file: !41, line: 82, baseType: !7)
!41 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/arm/_types.h", directory: "")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !43, line: 31, baseType: !44)
!43 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !41, line: 70, baseType: !45)
!45 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !49, line: 18, baseType: !50)
!49 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pytypedefs.h", directory: "")
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !6, line: 110, size: 128, elements: !51)
!51 = !{!52, !70}
!52 = !DIDerivedType(tag: DW_TAG_member, scope: !50, file: !6, line: 122, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !50, file: !6, line: 122, size: 64, elements: !54)
!54 = !{!55, !59}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt_full", scope: !53, file: !6, line: 124, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !57, line: 30, baseType: !58)
!57 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_int64_t.h", directory: "")
!58 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, scope: !53, file: !6, line: 125, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !53, file: !6, line: 125, size: 64, elements: !61)
!61 = !{!62, !65, !69}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !60, file: !6, line: 131, baseType: !63, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !64, line: 31, baseType: !14)
!64 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint32_t.h", directory: "")
!65 = !DIDerivedType(tag: DW_TAG_member, name: "ob_overflow", scope: !60, file: !6, line: 132, baseType: !66, size: 16, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !67, line: 31, baseType: !68)
!67 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint16_t.h", directory: "")
!68 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ob_flags", scope: !60, file: !6, line: 133, baseType: !66, size: 16, offset: 48)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !50, file: !6, line: 144, baseType: !71, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !49, line: 20, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !74, line: 148, size: 3328, elements: !75)
!74 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/object.h", directory: "")
!75 = !{!76, !88, !89, !90, !91, !96, !97, !103, !108, !127, !129, !182, !213, !225, !231, !232, !233, !235, !237, !269, !270, !271, !280, !281, !286, !287, !289, !291, !302, !313, !331, !332, !333, !335, !337, !338, !340, !345, !350, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !371, !373}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !73, file: !74, line: 149, baseType: !77, size: 192)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !6, line: 172, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 169, size: 192, elements: !79)
!79 = !{!80, !81}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !78, file: !6, line: 170, baseType: !48, size: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !78, file: !6, line: 171, baseType: !82, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !83, line: 156, baseType: !84)
!83 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pyport.h", directory: "")
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !85, line: 31, baseType: !86)
!85 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_ssize_t.h", directory: "")
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ssize_t", file: !41, line: 97, baseType: !87)
!87 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !73, file: !74, line: 150, baseType: !26, size: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !73, file: !74, line: 151, baseType: !82, size: 64, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !73, file: !74, line: 151, baseType: !82, size: 64, offset: 320)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !73, file: !74, line: 155, baseType: !92, size: 64, offset: 384)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !6, line: 353, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !47}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall_offset", scope: !73, file: !74, line: 156, baseType: !82, size: 64, offset: 448)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !73, file: !74, line: 157, baseType: !98, size: 64, offset: 512)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !6, line: 354, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!47, !47, !102}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !73, file: !74, line: 158, baseType: !104, size: 64, offset: 576)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !6, line: 356, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!7, !47, !102, !47}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_async", scope: !73, file: !74, line: 159, baseType: !109, size: 64, offset: 640)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyAsyncMethods", file: !74, line: 135, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !74, line: 130, size: 256, elements: !112)
!112 = !{!113, !118, !119, !120}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "am_await", scope: !111, file: !74, line: 131, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !6, line: 336, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!47, !47}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "am_aiter", scope: !111, file: !74, line: 132, baseType: !114, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "am_anext", scope: !111, file: !74, line: 133, baseType: !114, size: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "am_send", scope: !111, file: !74, line: 134, baseType: !121, size: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "sendfunc", file: !74, line: 128, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!125, !47, !47, !126}
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySendResult", file: !6, line: 699, baseType: !5)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !73, file: !74, line: 161, baseType: !128, size: 64, offset: 704)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !6, line: 358, baseType: !115)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !73, file: !74, line: 165, baseType: !130, size: 64, offset: 768)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !74, line: 106, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !74, line: 61, size: 2304, elements: !133)
!133 = !{!134, !139, !140, !141, !142, !143, !148, !149, !150, !151, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !132, file: !74, line: 66, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !6, line: 337, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!47, !47, !47}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !132, file: !74, line: 67, baseType: !135, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !132, file: !74, line: 68, baseType: !135, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !132, file: !74, line: 69, baseType: !135, size: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !132, file: !74, line: 70, baseType: !135, size: 64, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !132, file: !74, line: 71, baseType: !144, size: 64, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !6, line: 338, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!47, !47, !47, !47}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !132, file: !74, line: 72, baseType: !114, size: 64, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !132, file: !74, line: 73, baseType: !114, size: 64, offset: 448)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !132, file: !74, line: 74, baseType: !114, size: 64, offset: 512)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !132, file: !74, line: 75, baseType: !152, size: 64, offset: 576)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !6, line: 339, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!7, !47}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !132, file: !74, line: 76, baseType: !114, size: 64, offset: 640)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !132, file: !74, line: 77, baseType: !135, size: 64, offset: 704)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !132, file: !74, line: 78, baseType: !135, size: 64, offset: 768)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !132, file: !74, line: 79, baseType: !135, size: 64, offset: 832)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !132, file: !74, line: 80, baseType: !135, size: 64, offset: 896)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !132, file: !74, line: 81, baseType: !135, size: 64, offset: 960)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !132, file: !74, line: 82, baseType: !114, size: 64, offset: 1024)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !132, file: !74, line: 83, baseType: !46, size: 64, offset: 1088)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !132, file: !74, line: 84, baseType: !114, size: 64, offset: 1152)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !132, file: !74, line: 86, baseType: !135, size: 64, offset: 1216)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !132, file: !74, line: 87, baseType: !135, size: 64, offset: 1280)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !132, file: !74, line: 88, baseType: !135, size: 64, offset: 1344)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !132, file: !74, line: 89, baseType: !135, size: 64, offset: 1408)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !132, file: !74, line: 90, baseType: !144, size: 64, offset: 1472)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !132, file: !74, line: 91, baseType: !135, size: 64, offset: 1536)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !132, file: !74, line: 92, baseType: !135, size: 64, offset: 1600)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !132, file: !74, line: 93, baseType: !135, size: 64, offset: 1664)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !132, file: !74, line: 94, baseType: !135, size: 64, offset: 1728)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !132, file: !74, line: 95, baseType: !135, size: 64, offset: 1792)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !132, file: !74, line: 97, baseType: !135, size: 64, offset: 1856)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !132, file: !74, line: 98, baseType: !135, size: 64, offset: 1920)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !132, file: !74, line: 99, baseType: !135, size: 64, offset: 1984)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !132, file: !74, line: 100, baseType: !135, size: 64, offset: 2048)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !132, file: !74, line: 102, baseType: !114, size: 64, offset: 2112)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_matrix_multiply", scope: !132, file: !74, line: 104, baseType: !135, size: 64, offset: 2176)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_matrix_multiply", scope: !132, file: !74, line: 105, baseType: !135, size: 64, offset: 2240)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !73, file: !74, line: 166, baseType: !183, size: 64, offset: 832)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !74, line: 120, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !74, line: 108, size: 640, elements: !186)
!186 = !{!187, !192, !193, !198, !199, !200, !205, !206, !211, !212}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !185, file: !74, line: 109, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !6, line: 340, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!82, !47}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !185, file: !74, line: 110, baseType: !135, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !185, file: !74, line: 111, baseType: !194, size: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !6, line: 341, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!47, !47, !82}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !185, file: !74, line: 112, baseType: !194, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !185, file: !74, line: 113, baseType: !46, size: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !185, file: !74, line: 114, baseType: !201, size: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !6, line: 343, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!7, !47, !82, !47}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !185, file: !74, line: 115, baseType: !46, size: 64, offset: 384)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !185, file: !74, line: 116, baseType: !207, size: 64, offset: 448)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !6, line: 347, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!7, !47, !47}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !185, file: !74, line: 118, baseType: !135, size: 64, offset: 512)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !185, file: !74, line: 119, baseType: !194, size: 64, offset: 576)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !73, file: !74, line: 167, baseType: !214, size: 64, offset: 896)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !74, line: 126, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !74, line: 122, size: 192, elements: !217)
!217 = !{!218, !219, !220}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !216, file: !74, line: 123, baseType: !188, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !216, file: !74, line: 124, baseType: !135, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !216, file: !74, line: 125, baseType: !221, size: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !6, line: 345, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!7, !47, !47, !47}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !73, file: !74, line: 171, baseType: !226, size: 64, offset: 960)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !6, line: 359, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!230, !47}
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !83, line: 170, baseType: !82)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !73, file: !74, line: 172, baseType: !144, size: 64, offset: 1024)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !73, file: !74, line: 173, baseType: !128, size: 64, offset: 1088)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !73, file: !74, line: 174, baseType: !234, size: 64, offset: 1152)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !6, line: 355, baseType: !136)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !73, file: !74, line: 175, baseType: !236, size: 64, offset: 1216)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !6, line: 357, baseType: !222)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !73, file: !74, line: 178, baseType: !238, size: 64, offset: 1280)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !74, line: 140, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !74, line: 137, size: 128, elements: !241)
!241 = !{!242, !264}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !240, file: !74, line: 138, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !244, line: 35, baseType: !245)
!244 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pybuffer.h", directory: "")
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!7, !47, !248, !7}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !244, line: 33, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !244, line: 20, size: 640, elements: !251)
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259, !261, !262, !263}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !250, file: !244, line: 21, baseType: !46, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !250, file: !244, line: 22, baseType: !47, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !250, file: !244, line: 23, baseType: !82, size: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !250, file: !244, line: 24, baseType: !82, size: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !250, file: !244, line: 26, baseType: !7, size: 32, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !250, file: !244, line: 27, baseType: !7, size: 32, offset: 288)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !250, file: !244, line: 28, baseType: !102, size: 64, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !250, file: !244, line: 29, baseType: !260, size: 64, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !250, file: !244, line: 30, baseType: !260, size: 64, offset: 448)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !250, file: !244, line: 31, baseType: !260, size: 64, offset: 512)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !250, file: !244, line: 32, baseType: !46, size: 64, offset: 576)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !240, file: !74, line: 139, baseType: !265, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !244, line: 36, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !47, !248}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !73, file: !74, line: 181, baseType: !45, size: 64, offset: 1344)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !73, file: !74, line: 183, baseType: !26, size: 64, offset: 1408)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !73, file: !74, line: 187, baseType: !272, size: 64, offset: 1472)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !6, line: 349, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!7, !47, !276, !46}
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !6, line: 348, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!7, !47, !46}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !73, file: !74, line: 190, baseType: !152, size: 64, offset: 1536)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !73, file: !74, line: 194, baseType: !282, size: 64, offset: 1600)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !6, line: 360, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!47, !47, !47, !7}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !73, file: !74, line: 197, baseType: !82, size: 64, offset: 1664)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !73, file: !74, line: 200, baseType: !288, size: 64, offset: 1728)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !6, line: 361, baseType: !115)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !73, file: !74, line: 201, baseType: !290, size: 64, offset: 1792)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !6, line: 362, baseType: !115)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !73, file: !74, line: 204, baseType: !292, size: 64, offset: 1856)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !49, line: 14, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !295, line: 68, size: 256, elements: !296)
!295 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/methodobject.h", directory: "")
!296 = !{!297, !298, !300, !301}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !294, file: !295, line: 69, baseType: !26, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !294, file: !295, line: 70, baseType: !299, size: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !295, line: 19, baseType: !136)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !294, file: !295, line: 71, baseType: !7, size: 32, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !294, file: !295, line: 73, baseType: !26, size: 64, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !73, file: !74, line: 205, baseType: !303, size: 64, offset: 1920)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !49, line: 16, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !306, line: 41, size: 320, elements: !307)
!306 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/descrobject.h", directory: "")
!307 = !{!308, !309, !310, !311, !312}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !305, file: !306, line: 42, baseType: !26, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !305, file: !306, line: 43, baseType: !7, size: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !305, file: !306, line: 44, baseType: !82, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !305, file: !306, line: 45, baseType: !7, size: 32, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !305, file: !306, line: 46, baseType: !26, size: 64, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !73, file: !74, line: 206, baseType: !314, size: 64, offset: 1984)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGetSetDef", file: !49, line: 15, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !306, line: 11, size: 320, elements: !317)
!317 = !{!318, !319, !324, !329, !330}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !316, file: !306, line: 12, baseType: !26, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !316, file: !306, line: 13, baseType: !320, size: 64, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !306, line: 8, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!47, !47, !46}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !316, file: !306, line: 14, baseType: !325, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !306, line: 9, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!7, !47, !47, !46}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !316, file: !306, line: 15, baseType: !26, size: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !316, file: !306, line: 16, baseType: !46, size: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !73, file: !74, line: 208, baseType: !71, size: 64, offset: 2048)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !73, file: !74, line: 209, baseType: !47, size: 64, offset: 2112)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !73, file: !74, line: 210, baseType: !334, size: 64, offset: 2176)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !6, line: 363, baseType: !145)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !73, file: !74, line: 211, baseType: !336, size: 64, offset: 2240)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !6, line: 364, baseType: !222)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !73, file: !74, line: 212, baseType: !82, size: 64, offset: 2304)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !73, file: !74, line: 213, baseType: !339, size: 64, offset: 2368)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !6, line: 365, baseType: !222)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !73, file: !74, line: 214, baseType: !341, size: 64, offset: 2432)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !6, line: 367, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!47, !71, !82}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !73, file: !74, line: 215, baseType: !346, size: 64, offset: 2496)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !6, line: 366, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!47, !71, !47, !47}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !73, file: !74, line: 216, baseType: !351, size: 64, offset: 2560)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !6, line: 352, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !46}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !73, file: !74, line: 217, baseType: !152, size: 64, offset: 2624)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !73, file: !74, line: 218, baseType: !47, size: 64, offset: 2688)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !73, file: !74, line: 219, baseType: !47, size: 64, offset: 2752)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !73, file: !74, line: 220, baseType: !47, size: 64, offset: 2816)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !73, file: !74, line: 221, baseType: !46, size: 64, offset: 2880)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !73, file: !74, line: 222, baseType: !47, size: 64, offset: 2944)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !73, file: !74, line: 223, baseType: !92, size: 64, offset: 3008)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !73, file: !74, line: 228, baseType: !14, size: 32, offset: 3072)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !73, file: !74, line: 230, baseType: !92, size: 64, offset: 3136)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall", scope: !73, file: !74, line: 231, baseType: !365, size: 64, offset: 3200)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "vectorcallfunc", file: !6, line: 370, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!47, !47, !369, !42, !47}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tp_watched", scope: !73, file: !74, line: 234, baseType: !372, size: 8, offset: 3264)
!372 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tp_versions_used", scope: !73, file: !74, line: 241, baseType: !66, size: 16, offset: 3280)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !375, line: 30, baseType: !7)
!375 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_int32_t.h", directory: "")
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !378, line: 13, baseType: !379)
!378 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/tupleobject.h", directory: "")
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 5, size: 320, elements: !380)
!380 = !{!381, !382, !383}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !379, file: !378, line: 6, baseType: !77, size: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ob_hash", scope: !379, file: !378, line: 8, baseType: !230, size: 64, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !379, file: !378, line: 12, baseType: !384, size: 64, offset: 256)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 64, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 1)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !389, line: 22, baseType: !390)
!389 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/listobject.h", directory: "")
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !389, line: 5, size: 320, elements: !391)
!391 = !{!392, !393, !394}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !390, file: !389, line: 6, baseType: !77, size: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !390, file: !389, line: 8, baseType: !126, size: 64, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !390, file: !389, line: 21, baseType: !82, size: 64, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !397, line: 15, baseType: !398)
!397 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/bytesobject.h", directory: "")
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !397, line: 5, size: 320, elements: !399)
!399 = !{!400, !401, !402}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !398, file: !397, line: 6, baseType: !77, size: 192)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !398, file: !397, line: 7, baseType: !230, size: 64, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !398, file: !397, line: 8, baseType: !403, size: 8, offset: 256)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8, elements: !385)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunctionObject", file: !406, line: 14, baseType: !407)
!406 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/methodobject.h", directory: "")
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !406, line: 7, size: 448, elements: !408)
!408 = !{!409, !410, !411, !412, !413, !414}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !407, file: !406, line: 8, baseType: !48, size: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "m_ml", scope: !407, file: !406, line: 9, baseType: !292, size: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "m_self", scope: !407, file: !406, line: 10, baseType: !47, size: 64, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "m_module", scope: !407, file: !406, line: 11, baseType: !47, size: 64, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "m_weakreflist", scope: !407, file: !406, line: 12, baseType: !47, size: 64, offset: 320)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "vectorcall", scope: !407, file: !406, line: 13, baseType: !365, size: 64, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBaseExceptionObject", file: !418, line: 15, baseType: !419)
!418 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/pyerrors.h", directory: "")
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !418, line: 13, size: 576, elements: !420)
!420 = !{!421, !422, !423, !424, !425, !426, !427, !428}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !419, file: !418, line: 14, baseType: !48, size: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !419, file: !418, line: 14, baseType: !47, size: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !419, file: !418, line: 14, baseType: !47, size: 64, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !419, file: !418, line: 14, baseType: !47, size: 64, offset: 256)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", scope: !419, file: !418, line: 14, baseType: !47, size: 64, offset: 320)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !419, file: !418, line: 14, baseType: !47, size: 64, offset: 384)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "cause", scope: !419, file: !418, line: 14, baseType: !47, size: 64, offset: 448)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_context", scope: !419, file: !418, line: 14, baseType: !28, size: 8, offset: 512)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !431, line: 163, baseType: !432)
!431 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/unicodeobject.h", directory: "")
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !431, line: 54, size: 320, elements: !433)
!433 = !{!434, !435, !436, !437}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !432, file: !431, line: 99, baseType: !48, size: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !432, file: !431, line: 100, baseType: !82, size: 64, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !432, file: !431, line: 101, baseType: !230, size: 64, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !432, file: !431, line: 162, baseType: !438, size: 32, offset: 256)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !432, file: !431, line: 107, size: 32, elements: !439)
!439 = !{!440, !441, !442, !443, !444}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !438, file: !431, line: 121, baseType: !14, size: 2, flags: DIFlagBitField, extraData: i64 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !438, file: !431, line: 145, baseType: !14, size: 3, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !438, file: !431, line: 150, baseType: !14, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !438, file: !431, line: 154, baseType: !14, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "statically_allocated", scope: !438, file: !431, line: 156, baseType: !14, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyLongObject", file: !49, line: 19, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_longobject", file: !448, line: 98, size: 256, elements: !449)
!448 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/longintrepr.h", directory: "")
!449 = !{!450, !451}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !447, file: !448, line: 99, baseType: !48, size: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "long_value", scope: !447, file: !448, line: 100, baseType: !452, size: 128, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyLongValue", file: !448, line: 96, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PyLongValue", file: !448, line: 93, size: 128, elements: !454)
!454 = !{!455, !458}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "lv_tag", scope: !453, file: !448, line: 94, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !457, line: 34, baseType: !45)
!457 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ob_digit", scope: !453, file: !448, line: 95, baseType: !459, size: 32, offset: 64)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 32, elements: !385)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "digit", file: !448, line: 43, baseType: !63)
!461 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFloatObject", file: !464, line: 8, baseType: !465)
!464 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/floatobject.h", directory: "")
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !464, line: 5, size: 192, elements: !466)
!466 = !{!467, !468}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !465, file: !464, line: 6, baseType: !48, size: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ob_fval", scope: !465, file: !464, line: 7, baseType: !461, size: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CodeObjectCacheEntry", file: !13, line: 1805, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1802, size: 128, elements: !472)
!472 = !{!473, !531}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "code_object", scope: !471, file: !13, line: 1803, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CachedCodeObjectType", file: !13, line: 1800, baseType: !476)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !49, line: 21, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyCodeObject", file: !478, line: 115, size: 1728, elements: !479)
!478 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/code.h", directory: "")
!479 = !{!480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !514, !523, !524, !527, !528, !529, !530}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !477, file: !478, line: 115, baseType: !77, size: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !477, file: !478, line: 115, baseType: !47, size: 64, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !477, file: !478, line: 115, baseType: !47, size: 64, offset: 256)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "co_exceptiontable", scope: !477, file: !478, line: 115, baseType: !47, size: 64, offset: 320)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !477, file: !478, line: 115, baseType: !7, size: 32, offset: 384)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !477, file: !478, line: 115, baseType: !7, size: 32, offset: 416)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "co_posonlyargcount", scope: !477, file: !478, line: 115, baseType: !7, size: 32, offset: 448)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !477, file: !478, line: 115, baseType: !7, size: 32, offset: 480)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !477, file: !478, line: 115, baseType: !7, size: 32, offset: 512)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !477, file: !478, line: 115, baseType: !7, size: 32, offset: 544)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocalsplus", scope: !477, file: !478, line: 115, baseType: !7, size: 32, offset: 576)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "co_framesize", scope: !477, file: !478, line: 115, baseType: !7, size: 32, offset: 608)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !477, file: !478, line: 115, baseType: !7, size: 32, offset: 640)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "co_ncellvars", scope: !477, file: !478, line: 115, baseType: !7, size: 32, offset: 672)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "co_nfreevars", scope: !477, file: !478, line: 115, baseType: !7, size: 32, offset: 704)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "co_version", scope: !477, file: !478, line: 115, baseType: !63, size: 32, offset: 736)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "co_localsplusnames", scope: !477, file: !478, line: 115, baseType: !47, size: 64, offset: 768)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "co_localspluskinds", scope: !477, file: !478, line: 115, baseType: !47, size: 64, offset: 832)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !477, file: !478, line: 115, baseType: !47, size: 64, offset: 896)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !477, file: !478, line: 115, baseType: !47, size: 64, offset: 960)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "co_qualname", scope: !477, file: !478, line: 115, baseType: !47, size: 64, offset: 1024)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "co_linetable", scope: !477, file: !478, line: 115, baseType: !47, size: 64, offset: 1088)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !477, file: !478, line: 115, baseType: !47, size: 64, offset: 1152)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "co_executors", scope: !477, file: !478, line: 115, baseType: !504, size: 64, offset: 1216)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyExecutorArray", file: !478, line: 22, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !478, line: 18, size: 128, elements: !507)
!507 = !{!508, !509, !510}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !506, file: !478, line: 19, baseType: !7, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !506, file: !478, line: 20, baseType: !7, size: 32, offset: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "executors", scope: !506, file: !478, line: 21, baseType: !511, size: 64, offset: 64)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 64, elements: !385)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyExecutorObject", file: !478, line: 21, flags: DIFlagFwdDecl)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_co_cached", scope: !477, file: !478, line: 115, baseType: !515, size: 64, offset: 1280)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyCoCached", file: !478, line: 16, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !478, line: 11, size: 256, elements: !518)
!518 = !{!519, !520, !521, !522}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_co_code", scope: !517, file: !478, line: 12, baseType: !47, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_co_varnames", scope: !517, file: !478, line: 13, baseType: !47, size: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_co_cellvars", scope: !517, file: !478, line: 14, baseType: !47, size: 64, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_co_freevars", scope: !517, file: !478, line: 15, baseType: !47, size: 64, offset: 192)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_co_instrumentation_version", scope: !477, file: !478, line: 115, baseType: !456, size: 64, offset: 1344)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_co_monitoring", scope: !477, file: !478, line: 115, baseType: !525, size: 64, offset: 1408)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyCoMonitoringData", file: !478, line: 115, flags: DIFlagFwdDecl)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_co_unique_id", scope: !477, file: !478, line: 115, baseType: !82, size: 64, offset: 1472)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_co_firsttraceable", scope: !477, file: !478, line: 115, baseType: !7, size: 32, offset: 1536)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "co_extra", scope: !477, file: !478, line: 115, baseType: !46, size: 64, offset: 1600)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "co_code_adaptive", scope: !477, file: !478, line: 115, baseType: !403, size: 8, offset: 1664)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "code_line", scope: !471, file: !13, line: 1804, baseType: !7, size: 32, offset: 64)
!532 = !{!0, !533, !538, !540, !545, !575, !578, !583, !588, !593, !598, !600, !602, !604, !609, !614, !616, !622, !627, !629, !634, !660, !662, !667, !672, !677, !682, !687, !692, !697, !699, !704, !708, !713, !715, !717, !722, !727, !732, !734, !736, !738, !743, !745, !747, !749, !754, !756, !759, !764, !769, !774, !779, !781, !783, !785, !787, !792, !794, !797, !799, !804, !809, !814, !817, !822, !824, !826, !828, !833, !836, !839, !841, !843, !846, !849, !854, !859, !861, !864, !869, !871, !876, !878, !880, !885, !888, !893, !898, !900, !905, !907, !909, !911, !913, !915, !917, !919, !924}
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(scope: null, file: !13, line: 4331, type: !535, isLocal: true, isDefinition: true)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 128, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 16)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !13, line: 4338, type: !403, isLocal: true, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !13, line: 2205, type: !542, isLocal: true, isDefinition: true)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 72, elements: !543)
!543 = !{!544}
!544 = !DISubrange(count: 9)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "__pyx_moduledef", scope: !2, file: !13, line: 2201, type: !547, isLocal: true, isDefinition: true)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !548, line: 107, size: 832, elements: !549)
!548 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/moduleobject.h", directory: "")
!549 = !{!550, !561, !562, !563, !564, !565, !572, !573, !574}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !547, file: !548, line: 108, baseType: !551, size: 320)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !548, line: 58, baseType: !552)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !548, line: 39, size: 320, elements: !553)
!553 = !{!554, !555, !559, !560}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !552, file: !548, line: 40, baseType: !48, size: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !552, file: !548, line: 47, baseType: !556, size: 64, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{!47}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !552, file: !548, line: 52, baseType: !82, size: 64, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !552, file: !548, line: 57, baseType: !47, size: 64, offset: 256)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !547, file: !548, line: 109, baseType: !26, size: 64, offset: 320)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !547, file: !548, line: 110, baseType: !26, size: 64, offset: 384)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !547, file: !548, line: 111, baseType: !82, size: 64, offset: 448)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !547, file: !548, line: 112, baseType: !292, size: 64, offset: 512)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "m_slots", scope: !547, file: !548, line: 113, baseType: !566, size: 64, offset: 576)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Slot", file: !49, line: 13, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Slot", file: !548, line: 69, size: 128, elements: !569)
!569 = !{!570, !571}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !568, file: !548, line: 70, baseType: !7, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !568, file: !548, line: 71, baseType: !46, size: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !547, file: !548, line: 114, baseType: !272, size: 64, offset: 640)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !547, file: !548, line: 115, baseType: !152, size: 64, offset: 704)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !547, file: !548, line: 116, baseType: !351, size: 64, offset: 768)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "__pyx_methods", scope: !2, file: !13, line: 2099, type: !577, isLocal: true, isDefinition: true)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 256, elements: !385)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "__pyx_moduledef_slots", scope: !2, file: !13, line: 2184, type: !580, isLocal: true, isDefinition: true)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 384, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 3)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !13, line: 2333, type: !585, isLocal: true, isDefinition: true)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 40, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 5)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !13, line: 2340, type: !590, isLocal: true, isDefinition: true)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 56, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 7)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !13, line: 2340, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 88, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 11)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !13, line: 2341, type: !590, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !13, line: 2341, type: !542, isLocal: true, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(scope: null, file: !13, line: 2342, type: !590, isLocal: true, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !13, line: 2342, type: !606, isLocal: true, isDefinition: true)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 96, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 12)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !13, line: 2343, type: !611, isLocal: true, isDefinition: true)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 216, elements: !612)
!612 = !{!613}
!613 = !DISubrange(count: 27)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !13, line: 2343, type: !542, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "main_interpreter_id", scope: !618, file: !13, line: 2280, type: !56, isLocal: true, isDefinition: true)
!618 = distinct !DISubprogram(name: "__Pyx_check_single_interpreter", scope: !13, file: !13, line: 2279, type: !619, scopeLine: 2279, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !621)
!619 = !DISubroutineType(types: !620)
!620 = !{!7}
!621 = !{}
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !13, line: 2302, type: !624, isLocal: true, isDefinition: true)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 760, elements: !625)
!625 = !{!626}
!626 = !DISubrange(count: 95)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "__pyx_m", scope: !2, file: !13, line: 1326, type: !47, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !13, line: 2379, type: !631, isLocal: true, isDefinition: true)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 648, elements: !632)
!632 = !{!633}
!633 = !DISubrange(count: 81)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "__pyx_mstate_global", scope: !2, file: !13, line: 2030, type: !636, isLocal: true, isDefinition: true)
!636 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !637)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pyx_mstatetype", file: !13, line: 2009, baseType: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1994, size: 1984, elements: !640)
!640 = !{!641, !642, !643, !644, !645, !646, !647, !648, !652, !654}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_d", scope: !639, file: !13, line: 1995, baseType: !47, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_b", scope: !639, file: !13, line: 1996, baseType: !47, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_cython_runtime", scope: !639, file: !13, line: 1997, baseType: !47, size: 64, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_tuple", scope: !639, file: !13, line: 1998, baseType: !47, size: 64, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_bytes", scope: !639, file: !13, line: 1999, baseType: !47, size: 64, offset: 256)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_unicode", scope: !639, file: !13, line: 2000, baseType: !47, size: 64, offset: 320)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_slice", scope: !639, file: !13, line: 2001, baseType: !384, size: 64, offset: 384)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_string_tab", scope: !639, file: !13, line: 2002, baseType: !649, size: 1216, offset: 448)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 1216, elements: !650)
!650 = !{!651}
!651 = !DISubrange(count: 19)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_number_tab", scope: !639, file: !13, line: 2003, baseType: !653, size: 192, offset: 1664)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 192, elements: !581)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_code_cache", scope: !639, file: !13, line: 2006, baseType: !655, size: 128, offset: 1856)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__Pyx_CodeObjectCache", file: !13, line: 1806, size: 128, elements: !656)
!656 = !{!657, !658, !659}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !655, file: !13, line: 1807, baseType: !7, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "max_count", scope: !655, file: !13, line: 1808, baseType: !7, size: 32, offset: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !655, file: !13, line: 1809, baseType: !469, size: 64, offset: 64)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !13, line: 2409, type: !542, isLocal: true, isDefinition: true)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !13, line: 2410, type: !664, isLocal: true, isDefinition: true)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 120, elements: !665)
!665 = !{!666}
!666 = !DISubrange(count: 15)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(scope: null, file: !13, line: 2411, type: !669, isLocal: true, isDefinition: true)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 104, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 13)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(scope: null, file: !13, line: 2511, type: !674, isLocal: true, isDefinition: true)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 208, elements: !675)
!675 = !{!676}
!676 = !DISubrange(count: 26)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !13, line: 2511, type: !679, isLocal: true, isDefinition: true)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 80, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 10)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !13, line: 2511, type: !684, isLocal: true, isDefinition: true)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 192, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 24)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !13, line: 2516, type: !689, isLocal: true, isDefinition: true)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 184, elements: !690)
!690 = !{!691}
!691 = !DISubrange(count: 23)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !13, line: 2878, type: !694, isLocal: true, isDefinition: true)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 112, elements: !695)
!695 = !{!696}
!696 = !DISubrange(count: 14)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "__pyx_mstate_global_static", scope: !2, file: !13, line: 2024, type: !638, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !13, line: 1336, type: !701, isLocal: true, isDefinition: true)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 440, elements: !702)
!702 = !{!703}
!703 = !DISubrange(count: 55)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(name: "__pyx_f", scope: !2, file: !13, line: 1335, type: !706, isLocal: true, isDefinition: true)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 64, elements: !385)
!707 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !13, line: 5194, type: !710, isLocal: true, isDefinition: true)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 624, elements: !711)
!711 = !{!712}
!712 = !DISubrange(count: 78)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(scope: null, file: !13, line: 5200, type: !664, isLocal: true, isDefinition: true)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(scope: null, file: !13, line: 5200, type: !664, isLocal: true, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(scope: null, file: !13, line: 2971, type: !719, isLocal: true, isDefinition: true)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 720, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 90)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !13, line: 5210, type: !724, isLocal: true, isDefinition: true)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 136, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 17)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(scope: null, file: !13, line: 5210, type: !729, isLocal: true, isDefinition: true)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 32, elements: !730)
!730 = !{!731}
!731 = !DISubrange(count: 4)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !13, line: 5210, type: !585, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !13, line: 5211, type: !595, isLocal: true, isDefinition: true)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(scope: null, file: !13, line: 5215, type: !729, isLocal: true, isDefinition: true)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !13, line: 5262, type: !740, isLocal: true, isDefinition: true)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 1224, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 153)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "__pyx_filename", scope: !2, file: !13, line: 1331, type: !26, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "__pyx_lineno", scope: !2, file: !13, line: 1328, type: !7, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "__pyx_clineno", scope: !2, file: !13, line: 1329, type: !7, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !397, line: 25, type: !751, isLocal: true, isDefinition: true)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 144, elements: !752)
!752 = !{!753}
!753 = !DISubrange(count: 18)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !397, line: 25, type: !694, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !397, line: 25, type: !758, isLocal: true, isDefinition: true)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 144, elements: !752)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !13, line: 3231, type: !761, isLocal: true, isDefinition: true)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 200, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 25)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !13, line: 3263, type: !766, isLocal: true, isDefinition: true)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 248, elements: !767)
!767 = !{!768}
!768 = !DISubrange(count: 31)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(scope: null, file: !13, line: 3270, type: !771, isLocal: true, isDefinition: true)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 344, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 43)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !13, line: 3308, type: !776, isLocal: true, isDefinition: true)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 224, elements: !777)
!777 = !{!778}
!778 = !DISubrange(count: 28)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !13, line: 3308, type: !611, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !13, line: 3310, type: !595, isLocal: true, isDefinition: true)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "__pyx_builtin_input", scope: !2, file: !13, line: 1977, type: !47, isLocal: true, isDefinition: true)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "__pyx_builtin_map", scope: !2, file: !13, line: 1976, type: !47, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(scope: null, file: !6, line: 284, type: !789, isLocal: true, isDefinition: true)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 64, elements: !790)
!790 = !{!791}
!791 = !DISubrange(count: 8)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(scope: null, file: !6, line: 284, type: !542, isLocal: true, isDefinition: true)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(scope: null, file: !6, line: 284, type: !796, isLocal: true, isDefinition: true)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 224, elements: !777)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(scope: null, file: !6, line: 285, type: !796, isLocal: true, isDefinition: true)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(scope: null, file: !13, line: 3369, type: !801, isLocal: true, isDefinition: true)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 328, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 41)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(scope: null, file: !13, line: 3375, type: !806, isLocal: true, isDefinition: true)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 312, elements: !807)
!807 = !{!808}
!808 = !DISubrange(count: 39)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(scope: null, file: !13, line: 3376, type: !811, isLocal: true, isDefinition: true)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 16, elements: !812)
!812 = !{!813}
!813 = !DISubrange(count: 2)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(scope: null, file: !13, line: 3133, type: !816, isLocal: true, isDefinition: true)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 192, elements: !685)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(scope: null, file: !13, line: 3133, type: !819, isLocal: true, isDefinition: true)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 560, elements: !820)
!820 = !{!821}
!821 = !DISubrange(count: 70)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(scope: null, file: !464, line: 16, type: !751, isLocal: true, isDefinition: true)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(scope: null, file: !464, line: 16, type: !694, isLocal: true, isDefinition: true)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(scope: null, file: !464, line: 16, type: !758, isLocal: true, isDefinition: true)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(scope: null, file: !13, line: 5052, type: !830, isLocal: true, isDefinition: true)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 160, elements: !831)
!831 = !{!832}
!832 = !DISubrange(count: 20)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(scope: null, file: !13, line: 5052, type: !835, isLocal: true, isDefinition: true)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 152, elements: !650)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(scope: null, file: !378, line: 24, type: !838, isLocal: true, isDefinition: true)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 136, elements: !725)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(scope: null, file: !378, line: 24, type: !694, isLocal: true, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(scope: null, file: !378, line: 24, type: !758, isLocal: true, isDefinition: true)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(scope: null, file: !13, line: 5037, type: !845, isLocal: true, isDefinition: true)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 128, elements: !536)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(scope: null, file: !13, line: 5069, type: !848, isLocal: true, isDefinition: true)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 312, elements: !807)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(scope: null, file: !13, line: 5069, type: !851, isLocal: true, isDefinition: true)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 264, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 33)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(scope: null, file: !13, line: 5072, type: !856, isLocal: true, isDefinition: true)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 168, elements: !857)
!857 = !{!858}
!858 = !DISubrange(count: 21)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(name: "__pyx_7genexpr__pyx_v_8original_A", scope: !2, file: !13, line: 1967, type: !47, isLocal: true, isDefinition: true)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(scope: null, file: !6, line: 308, type: !863, isLocal: true, isDefinition: true)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 96, elements: !607)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(scope: null, file: !6, line: 308, type: !866, isLocal: true, isDefinition: true)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 352, elements: !867)
!867 = !{!868}
!868 = !DISubrange(count: 44)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(scope: null, file: !6, line: 309, type: !866, isLocal: true, isDefinition: true)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(scope: null, file: !13, line: 3748, type: !873, isLocal: true, isDefinition: true)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 384, elements: !874)
!874 = !{!875}
!875 = !DISubrange(count: 48)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(scope: null, file: !448, line: 123, type: !751, isLocal: true, isDefinition: true)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(scope: null, file: !448, line: 123, type: !694, isLocal: true, isDefinition: true)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(scope: null, file: !448, line: 123, type: !882, isLocal: true, isDefinition: true)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 520, elements: !883)
!883 = !{!884}
!884 = !DISubrange(count: 65)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(scope: null, file: !448, line: 133, type: !887, isLocal: true, isDefinition: true)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 168, elements: !857)
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(scope: null, file: !448, line: 134, type: !890, isLocal: true, isDefinition: true)
!890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 240, elements: !891)
!891 = !{!892}
!892 = !DISubrange(count: 30)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(scope: null, file: !13, line: 3767, type: !895, isLocal: true, isDefinition: true)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 296, elements: !896)
!896 = !{!897}
!897 = !DISubrange(count: 37)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(scope: null, file: !13, line: 3940, type: !766, isLocal: true, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(scope: null, file: !13, line: 3682, type: !902, isLocal: true, isDefinition: true)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 176, elements: !903)
!903 = !{!904}
!904 = !DISubrange(count: 22)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(scope: null, file: !13, line: 3682, type: !535, isLocal: true, isDefinition: true)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(scope: null, file: !13, line: 3689, type: !724, isLocal: true, isDefinition: true)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !389, line: 31, type: !845, isLocal: true, isDefinition: true)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(scope: null, file: !389, line: 31, type: !669, isLocal: true, isDefinition: true)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(scope: null, file: !389, line: 31, type: !724, isLocal: true, isDefinition: true)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(name: "__pyx_builtin_print", scope: !2, file: !13, line: 1978, type: !47, isLocal: true, isDefinition: true)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(scope: null, file: !13, line: 4206, type: !595, isLocal: true, isDefinition: true)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(scope: null, file: !13, line: 1330, type: !921, isLocal: true, isDefinition: true)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 952, elements: !922)
!922 = !{!923}
!923 = !DISubrange(count: 119)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(name: "__pyx_cfilenm", scope: !2, file: !13, line: 1330, type: !707, isLocal: true, isDefinition: true)
!926 = !{i32 2, !"SDK Version", [2 x i32] [i32 14, i32 4]}
!927 = !{i32 7, !"Dwarf Version", i32 4}
!928 = !{i32 2, !"Debug Info Version", i32 3}
!929 = !{i32 1, !"wchar_size", i32 4}
!930 = !{i32 8, !"PIC Level", i32 2}
!931 = !{i32 7, !"uwtable", i32 1}
!932 = !{i32 7, !"frame-pointer", i32 1}
!933 = !{!"Homebrew clang version 20.1.8"}
!934 = distinct !DISubprogram(name: "PyInit_original", scope: !13, file: !13, line: 2244, type: !557, scopeLine: 2246, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2)
!935 = !DILocation(line: 2247, column: 10, scope: !934)
!936 = !DILocation(line: 2247, column: 3, scope: !934)
!937 = distinct !DISubprogram(name: "main", scope: !13, file: !13, line: 4320, type: !938, scopeLine: 4321, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !621)
!938 = !DISubroutineType(types: !939)
!939 = !{!7, !7, !940}
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!941 = !DILocalVariable(name: "argc", arg: 1, scope: !937, file: !13, line: 4320, type: !7)
!942 = !DILocation(line: 4320, column: 10, scope: !937)
!943 = !DILocalVariable(name: "argv", arg: 2, scope: !937, file: !13, line: 4320, type: !940)
!944 = !DILocation(line: 4320, column: 23, scope: !937)
!945 = !DILocation(line: 4322, column: 10, scope: !946)
!946 = distinct !DILexicalBlock(scope: !937, file: !13, line: 4322, column: 9)
!947 = !DILocation(line: 4322, column: 9, scope: !946)
!948 = !DILocation(line: 4323, column: 16, scope: !949)
!949 = distinct !DILexicalBlock(scope: !946, file: !13, line: 4322, column: 16)
!950 = !DILocation(line: 4323, column: 9, scope: !949)
!951 = !DILocalVariable(name: "i", scope: !952, file: !13, line: 4326, type: !7)
!952 = distinct !DILexicalBlock(scope: !946, file: !13, line: 4325, column: 10)
!953 = !DILocation(line: 4326, column: 13, scope: !952)
!954 = !DILocalVariable(name: "res", scope: !952, file: !13, line: 4326, type: !7)
!955 = !DILocation(line: 4326, column: 16, scope: !952)
!956 = !DILocalVariable(name: "argv_copy", scope: !952, file: !13, line: 4327, type: !36)
!957 = !DILocation(line: 4327, column: 19, scope: !952)
!958 = !DILocation(line: 4327, column: 78, scope: !952)
!959 = !DILocation(line: 4327, column: 69, scope: !952)
!960 = !DILocation(line: 4327, column: 67, scope: !952)
!961 = !DILocation(line: 4327, column: 43, scope: !952)
!962 = !DILocalVariable(name: "argv_copy2", scope: !952, file: !13, line: 4328, type: !36)
!963 = !DILocation(line: 4328, column: 19, scope: !952)
!964 = !DILocation(line: 4328, column: 79, scope: !952)
!965 = !DILocation(line: 4328, column: 70, scope: !952)
!966 = !DILocation(line: 4328, column: 68, scope: !952)
!967 = !DILocation(line: 4328, column: 44, scope: !952)
!968 = !DILocalVariable(name: "oldloc", scope: !952, file: !13, line: 4329, type: !102)
!969 = !DILocation(line: 4329, column: 15, scope: !952)
!970 = !DILocation(line: 4329, column: 31, scope: !952)
!971 = !DILocation(line: 4329, column: 24, scope: !952)
!972 = !DILocation(line: 4330, column: 14, scope: !973)
!973 = distinct !DILexicalBlock(scope: !952, file: !13, line: 4330, column: 13)
!974 = !DILocation(line: 4330, column: 24, scope: !973)
!975 = !DILocation(line: 4330, column: 28, scope: !973)
!976 = !DILocation(line: 4330, column: 39, scope: !973)
!977 = !DILocation(line: 4330, column: 43, scope: !973)
!978 = !DILocation(line: 4331, column: 21, scope: !979)
!979 = distinct !DILexicalBlock(scope: !973, file: !13, line: 4330, column: 51)
!980 = !DILocation(line: 4331, column: 13, scope: !979)
!981 = !DILocation(line: 4332, column: 18, scope: !979)
!982 = !DILocation(line: 4332, column: 13, scope: !979)
!983 = !DILocation(line: 4333, column: 18, scope: !979)
!984 = !DILocation(line: 4333, column: 13, scope: !979)
!985 = !DILocation(line: 4334, column: 18, scope: !979)
!986 = !DILocation(line: 4334, column: 13, scope: !979)
!987 = !DILocation(line: 4335, column: 13, scope: !979)
!988 = !DILocation(line: 4337, column: 13, scope: !952)
!989 = !DILocation(line: 4338, column: 9, scope: !952)
!990 = !DILocation(line: 4339, column: 16, scope: !991)
!991 = distinct !DILexicalBlock(scope: !952, file: !13, line: 4339, column: 9)
!992 = !DILocation(line: 4339, column: 14, scope: !991)
!993 = !DILocation(line: 4339, column: 21, scope: !994)
!994 = distinct !DILexicalBlock(scope: !991, file: !13, line: 4339, column: 9)
!995 = !DILocation(line: 4339, column: 25, scope: !994)
!996 = !DILocation(line: 4339, column: 23, scope: !994)
!997 = !DILocation(line: 4339, column: 9, scope: !991)
!998 = !DILocation(line: 4340, column: 60, scope: !999)
!999 = distinct !DILexicalBlock(scope: !994, file: !13, line: 4339, column: 36)
!1000 = !DILocation(line: 4340, column: 65, scope: !999)
!1001 = !DILocation(line: 4340, column: 44, scope: !999)
!1002 = !DILocation(line: 4340, column: 29, scope: !999)
!1003 = !DILocation(line: 4340, column: 39, scope: !999)
!1004 = !DILocation(line: 4340, column: 42, scope: !999)
!1005 = !DILocation(line: 4340, column: 13, scope: !999)
!1006 = !DILocation(line: 4340, column: 24, scope: !999)
!1007 = !DILocation(line: 4340, column: 27, scope: !999)
!1008 = !DILocation(line: 4341, column: 18, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !999, file: !13, line: 4341, column: 17)
!1010 = !DILocation(line: 4341, column: 28, scope: !1009)
!1011 = !DILocation(line: 4341, column: 17, scope: !1009)
!1012 = !DILocation(line: 4341, column: 36, scope: !1009)
!1013 = !DILocation(line: 4341, column: 32, scope: !1009)
!1014 = !DILocation(line: 4342, column: 9, scope: !999)
!1015 = !DILocation(line: 4339, column: 32, scope: !994)
!1016 = !DILocation(line: 4339, column: 9, scope: !994)
!1017 = distinct !{!1017, !997, !1018, !1019}
!1018 = !DILocation(line: 4342, column: 9, scope: !991)
!1019 = !{!"llvm.loop.mustprogress"}
!1020 = !DILocation(line: 4343, column: 27, scope: !952)
!1021 = !DILocation(line: 4343, column: 9, scope: !952)
!1022 = !DILocation(line: 4344, column: 14, scope: !952)
!1023 = !DILocation(line: 4344, column: 9, scope: !952)
!1024 = !DILocation(line: 4345, column: 13, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !952, file: !13, line: 4345, column: 13)
!1026 = !DILocation(line: 4345, column: 17, scope: !1025)
!1027 = !DILocation(line: 4346, column: 30, scope: !1025)
!1028 = !DILocation(line: 4346, column: 36, scope: !1025)
!1029 = !DILocation(line: 4346, column: 19, scope: !1025)
!1030 = !DILocation(line: 4346, column: 17, scope: !1025)
!1031 = !DILocation(line: 4346, column: 13, scope: !1025)
!1032 = !DILocation(line: 4347, column: 16, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !952, file: !13, line: 4347, column: 9)
!1034 = !DILocation(line: 4347, column: 14, scope: !1033)
!1035 = !DILocation(line: 4347, column: 21, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1033, file: !13, line: 4347, column: 9)
!1037 = !DILocation(line: 4347, column: 25, scope: !1036)
!1038 = !DILocation(line: 4347, column: 23, scope: !1036)
!1039 = !DILocation(line: 4347, column: 9, scope: !1033)
!1040 = !DILocation(line: 4348, column: 27, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1036, file: !13, line: 4347, column: 36)
!1042 = !DILocation(line: 4348, column: 38, scope: !1041)
!1043 = !DILocation(line: 4348, column: 13, scope: !1041)
!1044 = !DILocation(line: 4349, column: 9, scope: !1041)
!1045 = !DILocation(line: 4347, column: 32, scope: !1036)
!1046 = !DILocation(line: 4347, column: 9, scope: !1036)
!1047 = distinct !{!1047, !1039, !1048, !1019}
!1048 = !DILocation(line: 4349, column: 9, scope: !1033)
!1049 = !DILocation(line: 4350, column: 14, scope: !952)
!1050 = !DILocation(line: 4350, column: 9, scope: !952)
!1051 = !DILocation(line: 4351, column: 14, scope: !952)
!1052 = !DILocation(line: 4351, column: 9, scope: !952)
!1053 = !DILocation(line: 4352, column: 16, scope: !952)
!1054 = !DILocation(line: 4352, column: 9, scope: !952)
!1055 = !DILocation(line: 4354, column: 1, scope: !937)
!1056 = distinct !DISubprogram(name: "__Pyx_main", scope: !13, file: !13, line: 4265, type: !1057, scopeLine: 4267, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !621)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!7, !7, !36}
!1059 = !DILocalVariable(name: "argc", arg: 1, scope: !1056, file: !13, line: 4265, type: !7)
!1060 = !DILocation(line: 4265, column: 27, scope: !1056)
!1061 = !DILocalVariable(name: "argv", arg: 2, scope: !1056, file: !13, line: 4265, type: !36)
!1062 = !DILocation(line: 4265, column: 43, scope: !1056)
!1063 = !DILocation(line: 4278, column: 9, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1056, file: !13, line: 4278, column: 9)
!1065 = !DILocation(line: 4278, column: 61, scope: !1064)
!1066 = !DILocation(line: 4278, column: 66, scope: !1064)
!1067 = !DILocalVariable(name: "status", scope: !1068, file: !13, line: 4280, type: !1069)
!1068 = distinct !DILexicalBlock(scope: !1056, file: !13, line: 4279, column: 5)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyStatus", file: !21, line: 19, baseType: !22)
!1070 = !DILocation(line: 4280, column: 18, scope: !1068)
!1071 = !DILocalVariable(name: "config", scope: !1068, file: !13, line: 4281, type: !1072)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyConfig", file: !21, line: 244, baseType: !1073)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyConfig", file: !21, line: 134, size: 3648, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "_config_init", scope: !1073, file: !21, line: 135, baseType: !7, size: 32)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "isolated", scope: !1073, file: !21, line: 137, baseType: !7, size: 32, offset: 32)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "use_environment", scope: !1073, file: !21, line: 138, baseType: !7, size: 32, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "dev_mode", scope: !1073, file: !21, line: 139, baseType: !7, size: 32, offset: 96)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "install_signal_handlers", scope: !1073, file: !21, line: 140, baseType: !7, size: 32, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "use_hash_seed", scope: !1073, file: !21, line: 141, baseType: !7, size: 32, offset: 160)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "hash_seed", scope: !1073, file: !21, line: 142, baseType: !45, size: 64, offset: 192)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "faulthandler", scope: !1073, file: !21, line: 143, baseType: !7, size: 32, offset: 256)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "tracemalloc", scope: !1073, file: !21, line: 144, baseType: !7, size: 32, offset: 288)
