; ModuleID = 'dataset/cases/goeq-ojva-0009/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c'
source_filename = "dataset/cases/goeq-ojva-0009/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx14.0.0"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr }
%struct.PyModuleDef_Base = type { %struct._object, ptr, i64, ptr }
%struct._object = type { %union.anon, ptr }
%union.anon = type { i64 }
%struct.PyMethodDef = type { ptr, ptr, i32, ptr }
%struct.__pyx_mstatetype = type { ptr, ptr, ptr, ptr, ptr, ptr, [3 x ptr], [18 x ptr], %struct.__Pyx_CodeObjectCache }
%struct.__Pyx_CodeObjectCache = type { i32, i32, ptr }
%struct.anon.1 = type { i8, [3 x i8] }
%struct._typeobject = type { %struct.PyVarObject, ptr, i64, i64, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, ptr, i8, i16 }
%struct.PyVarObject = type { %struct._object, i64 }
%struct.PyStatus = type { i32, ptr, ptr, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__pyx_module_is_main_original", scope: !2, file: !422, line: 1869, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Homebrew clang version 20.1.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !28, globals: !486, splitDebugInlining: false, nameTableKind: Apple, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk", sdk: "MacOSX14.sdk")
!3 = !DIFile(filename: "dataset/cases/goeq-ojva-0009/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c", directory: ".")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 695, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/object.h", directory: "")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "PYGEN_RETURN", value: 0)
!10 = !DIEnumerator(name: "PYGEN_ERROR", value: -1)
!11 = !DIEnumerator(name: "PYGEN_NEXT", value: 1)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !14, file: !13, line: 11, baseType: !23, size: 32, elements: !24)
!13 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/initconfig.h", directory: "")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 10, size: 256, elements: !15)
!15 = !{!16, !17, !21, !22}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_type", scope: !14, file: !13, line: 15, baseType: !12, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !14, file: !13, line: 16, baseType: !18, size: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "err_msg", scope: !14, file: !13, line: 17, baseType: !18, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "exitcode", scope: !14, file: !13, line: 18, baseType: !7, size: 32, offset: 192)
!23 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!24 = !{!25, !26, !27}
!25 = !DIEnumerator(name: "_PyStatus_TYPE_OK", value: 0)
!26 = !DIEnumerator(name: "_PyStatus_TYPE_ERROR", value: 1)
!27 = !DIEnumerator(name: "_PyStatus_TYPE_EXIT", value: 2)
!28 = !{!29, !35, !39, !40, !367, !7, !18, !95, !369, !380, !391, !407, !420}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !32, line: 34, baseType: !33)
!32 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_wchar_t.h", directory: "")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wchar_t", file: !34, line: 82, baseType: !7)
!34 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/arm/_types.h", directory: "")
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !36, line: 31, baseType: !37)
!36 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !34, line: 70, baseType: !38)
!38 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !42, line: 18, baseType: !43)
!42 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pytypedefs.h", directory: "")
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !6, line: 110, size: 128, elements: !44)
!44 = !{!45, !63}
!45 = !DIDerivedType(tag: DW_TAG_member, scope: !43, file: !6, line: 122, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !43, file: !6, line: 122, size: 64, elements: !47)
!47 = !{!48, !52}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt_full", scope: !46, file: !6, line: 124, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !50, line: 30, baseType: !51)
!50 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_int64_t.h", directory: "")
!51 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, scope: !46, file: !6, line: 125, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !46, file: !6, line: 125, size: 64, elements: !54)
!54 = !{!55, !58, !62}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !53, file: !6, line: 131, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !57, line: 31, baseType: !23)
!57 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint32_t.h", directory: "")
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ob_overflow", scope: !53, file: !6, line: 132, baseType: !59, size: 16, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !60, line: 31, baseType: !61)
!60 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint16_t.h", directory: "")
!61 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ob_flags", scope: !53, file: !6, line: 133, baseType: !59, size: 16, offset: 48)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !43, file: !6, line: 144, baseType: !64, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !42, line: 20, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !67, line: 148, size: 3328, elements: !68)
!67 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/object.h", directory: "")
!68 = !{!69, !81, !82, !83, !84, !89, !90, !96, !101, !120, !122, !175, !206, !218, !224, !225, !226, !228, !230, !262, !263, !264, !273, !274, !279, !280, !282, !284, !295, !306, !324, !325, !326, !328, !330, !331, !333, !338, !343, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !364, !366}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !66, file: !67, line: 149, baseType: !70, size: 192)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !6, line: 172, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 169, size: 192, elements: !72)
!72 = !{!73, !74}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !71, file: !6, line: 170, baseType: !41, size: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !71, file: !6, line: 171, baseType: !75, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !76, line: 156, baseType: !77)
!76 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pyport.h", directory: "")
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !78, line: 31, baseType: !79)
!78 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_ssize_t.h", directory: "")
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ssize_t", file: !34, line: 97, baseType: !80)
!80 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !66, file: !67, line: 150, baseType: !18, size: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !66, file: !67, line: 151, baseType: !75, size: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !66, file: !67, line: 151, baseType: !75, size: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !66, file: !67, line: 155, baseType: !85, size: 64, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !6, line: 353, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !40}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall_offset", scope: !66, file: !67, line: 156, baseType: !75, size: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !66, file: !67, line: 157, baseType: !91, size: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !6, line: 354, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!40, !40, !95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !66, file: !67, line: 158, baseType: !97, size: 64, offset: 576)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !6, line: 356, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!7, !40, !95, !40}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_async", scope: !66, file: !67, line: 159, baseType: !102, size: 64, offset: 640)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyAsyncMethods", file: !67, line: 135, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 130, size: 256, elements: !105)
!105 = !{!106, !111, !112, !113}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "am_await", scope: !104, file: !67, line: 131, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !6, line: 336, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!40, !40}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "am_aiter", scope: !104, file: !67, line: 132, baseType: !107, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "am_anext", scope: !104, file: !67, line: 133, baseType: !107, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "am_send", scope: !104, file: !67, line: 134, baseType: !114, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "sendfunc", file: !67, line: 128, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!118, !40, !40, !119}
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySendResult", file: !6, line: 699, baseType: !5)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !66, file: !67, line: 161, baseType: !121, size: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !6, line: 358, baseType: !108)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !66, file: !67, line: 165, baseType: !123, size: 64, offset: 768)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !67, line: 106, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 61, size: 2304, elements: !126)
!126 = !{!127, !132, !133, !134, !135, !136, !141, !142, !143, !144, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !125, file: !67, line: 66, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !6, line: 337, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!40, !40, !40}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !125, file: !67, line: 67, baseType: !128, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !125, file: !67, line: 68, baseType: !128, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !125, file: !67, line: 69, baseType: !128, size: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !125, file: !67, line: 70, baseType: !128, size: 64, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !125, file: !67, line: 71, baseType: !137, size: 64, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !6, line: 338, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!40, !40, !40, !40}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !125, file: !67, line: 72, baseType: !107, size: 64, offset: 384)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !125, file: !67, line: 73, baseType: !107, size: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !125, file: !67, line: 74, baseType: !107, size: 64, offset: 512)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !125, file: !67, line: 75, baseType: !145, size: 64, offset: 576)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !6, line: 339, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!7, !40}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !125, file: !67, line: 76, baseType: !107, size: 64, offset: 640)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !125, file: !67, line: 77, baseType: !128, size: 64, offset: 704)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !125, file: !67, line: 78, baseType: !128, size: 64, offset: 768)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !125, file: !67, line: 79, baseType: !128, size: 64, offset: 832)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !125, file: !67, line: 80, baseType: !128, size: 64, offset: 896)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !125, file: !67, line: 81, baseType: !128, size: 64, offset: 960)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !125, file: !67, line: 82, baseType: !107, size: 64, offset: 1024)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !125, file: !67, line: 83, baseType: !39, size: 64, offset: 1088)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !125, file: !67, line: 84, baseType: !107, size: 64, offset: 1152)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !125, file: !67, line: 86, baseType: !128, size: 64, offset: 1216)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !125, file: !67, line: 87, baseType: !128, size: 64, offset: 1280)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !125, file: !67, line: 88, baseType: !128, size: 64, offset: 1344)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !125, file: !67, line: 89, baseType: !128, size: 64, offset: 1408)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !125, file: !67, line: 90, baseType: !137, size: 64, offset: 1472)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !125, file: !67, line: 91, baseType: !128, size: 64, offset: 1536)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !125, file: !67, line: 92, baseType: !128, size: 64, offset: 1600)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !125, file: !67, line: 93, baseType: !128, size: 64, offset: 1664)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !125, file: !67, line: 94, baseType: !128, size: 64, offset: 1728)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !125, file: !67, line: 95, baseType: !128, size: 64, offset: 1792)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !125, file: !67, line: 97, baseType: !128, size: 64, offset: 1856)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !125, file: !67, line: 98, baseType: !128, size: 64, offset: 1920)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !125, file: !67, line: 99, baseType: !128, size: 64, offset: 1984)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !125, file: !67, line: 100, baseType: !128, size: 64, offset: 2048)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !125, file: !67, line: 102, baseType: !107, size: 64, offset: 2112)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_matrix_multiply", scope: !125, file: !67, line: 104, baseType: !128, size: 64, offset: 2176)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_matrix_multiply", scope: !125, file: !67, line: 105, baseType: !128, size: 64, offset: 2240)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !66, file: !67, line: 166, baseType: !176, size: 64, offset: 832)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !67, line: 120, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 108, size: 640, elements: !179)
!179 = !{!180, !185, !186, !191, !192, !193, !198, !199, !204, !205}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !178, file: !67, line: 109, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !6, line: 340, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!75, !40}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !178, file: !67, line: 110, baseType: !128, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !178, file: !67, line: 111, baseType: !187, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !6, line: 341, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!40, !40, !75}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !178, file: !67, line: 112, baseType: !187, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !178, file: !67, line: 113, baseType: !39, size: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !178, file: !67, line: 114, baseType: !194, size: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !6, line: 343, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!7, !40, !75, !40}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !178, file: !67, line: 115, baseType: !39, size: 64, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !178, file: !67, line: 116, baseType: !200, size: 64, offset: 448)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !6, line: 347, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!7, !40, !40}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !178, file: !67, line: 118, baseType: !128, size: 64, offset: 512)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !178, file: !67, line: 119, baseType: !187, size: 64, offset: 576)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !66, file: !67, line: 167, baseType: !207, size: 64, offset: 896)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !67, line: 126, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 122, size: 192, elements: !210)
!210 = !{!211, !212, !213}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !209, file: !67, line: 123, baseType: !181, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !209, file: !67, line: 124, baseType: !128, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !209, file: !67, line: 125, baseType: !214, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !6, line: 345, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!7, !40, !40, !40}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !66, file: !67, line: 171, baseType: !219, size: 64, offset: 960)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !6, line: 359, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!223, !40}
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !76, line: 170, baseType: !75)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !66, file: !67, line: 172, baseType: !137, size: 64, offset: 1024)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !66, file: !67, line: 173, baseType: !121, size: 64, offset: 1088)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !66, file: !67, line: 174, baseType: !227, size: 64, offset: 1152)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !6, line: 355, baseType: !129)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !66, file: !67, line: 175, baseType: !229, size: 64, offset: 1216)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !6, line: 357, baseType: !215)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !66, file: !67, line: 178, baseType: !231, size: 64, offset: 1280)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !67, line: 140, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 137, size: 128, elements: !234)
!234 = !{!235, !257}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !233, file: !67, line: 138, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !237, line: 35, baseType: !238)
!237 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pybuffer.h", directory: "")
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!7, !40, !241, !7}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !237, line: 33, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !237, line: 20, size: 640, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !254, !255, !256}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !243, file: !237, line: 21, baseType: !39, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !243, file: !237, line: 22, baseType: !40, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !243, file: !237, line: 23, baseType: !75, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !243, file: !237, line: 24, baseType: !75, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !243, file: !237, line: 26, baseType: !7, size: 32, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !243, file: !237, line: 27, baseType: !7, size: 32, offset: 288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !243, file: !237, line: 28, baseType: !95, size: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !243, file: !237, line: 29, baseType: !253, size: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !243, file: !237, line: 30, baseType: !253, size: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !243, file: !237, line: 31, baseType: !253, size: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !243, file: !237, line: 32, baseType: !39, size: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !233, file: !67, line: 139, baseType: !258, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !237, line: 36, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !40, !241}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !66, file: !67, line: 181, baseType: !38, size: 64, offset: 1344)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !66, file: !67, line: 183, baseType: !18, size: 64, offset: 1408)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !66, file: !67, line: 187, baseType: !265, size: 64, offset: 1472)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !6, line: 349, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!7, !40, !269, !39}
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !6, line: 348, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!7, !40, !39}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !66, file: !67, line: 190, baseType: !145, size: 64, offset: 1536)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !66, file: !67, line: 194, baseType: !275, size: 64, offset: 1600)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !6, line: 360, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!40, !40, !40, !7}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !66, file: !67, line: 197, baseType: !75, size: 64, offset: 1664)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !66, file: !67, line: 200, baseType: !281, size: 64, offset: 1728)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !6, line: 361, baseType: !108)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !66, file: !67, line: 201, baseType: !283, size: 64, offset: 1792)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !6, line: 362, baseType: !108)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !66, file: !67, line: 204, baseType: !285, size: 64, offset: 1856)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !42, line: 14, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 68, size: 256, elements: !289)
!288 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/methodobject.h", directory: "")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 69, baseType: !18, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 70, baseType: !292, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 19, baseType: !129)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 71, baseType: !7, size: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 73, baseType: !18, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !66, file: !67, line: 205, baseType: !296, size: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !42, line: 16, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !299, line: 41, size: 320, elements: !300)
!299 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/descrobject.h", directory: "")
!300 = !{!301, !302, !303, !304, !305}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !298, file: !299, line: 42, baseType: !18, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !298, file: !299, line: 43, baseType: !7, size: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !298, file: !299, line: 44, baseType: !75, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !298, file: !299, line: 45, baseType: !7, size: 32, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !298, file: !299, line: 46, baseType: !18, size: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !66, file: !67, line: 206, baseType: !307, size: 64, offset: 1984)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGetSetDef", file: !42, line: 15, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !299, line: 11, size: 320, elements: !310)
!310 = !{!311, !312, !317, !322, !323}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !309, file: !299, line: 12, baseType: !18, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !309, file: !299, line: 13, baseType: !313, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !299, line: 8, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!40, !40, !39}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !309, file: !299, line: 14, baseType: !318, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !299, line: 9, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!7, !40, !40, !39}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !309, file: !299, line: 15, baseType: !18, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !309, file: !299, line: 16, baseType: !39, size: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !66, file: !67, line: 208, baseType: !64, size: 64, offset: 2048)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !66, file: !67, line: 209, baseType: !40, size: 64, offset: 2112)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !66, file: !67, line: 210, baseType: !327, size: 64, offset: 2176)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !6, line: 363, baseType: !138)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !66, file: !67, line: 211, baseType: !329, size: 64, offset: 2240)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !6, line: 364, baseType: !215)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !66, file: !67, line: 212, baseType: !75, size: 64, offset: 2304)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !66, file: !67, line: 213, baseType: !332, size: 64, offset: 2368)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !6, line: 365, baseType: !215)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !66, file: !67, line: 214, baseType: !334, size: 64, offset: 2432)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !6, line: 367, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!40, !64, !75}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !66, file: !67, line: 215, baseType: !339, size: 64, offset: 2496)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !6, line: 366, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!40, !64, !40, !40}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !66, file: !67, line: 216, baseType: !344, size: 64, offset: 2560)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !6, line: 352, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !39}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !66, file: !67, line: 217, baseType: !145, size: 64, offset: 2624)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !66, file: !67, line: 218, baseType: !40, size: 64, offset: 2688)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !66, file: !67, line: 219, baseType: !40, size: 64, offset: 2752)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !66, file: !67, line: 220, baseType: !40, size: 64, offset: 2816)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !66, file: !67, line: 221, baseType: !39, size: 64, offset: 2880)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !66, file: !67, line: 222, baseType: !40, size: 64, offset: 2944)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !66, file: !67, line: 223, baseType: !85, size: 64, offset: 3008)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !66, file: !67, line: 228, baseType: !23, size: 32, offset: 3072)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !66, file: !67, line: 230, baseType: !85, size: 64, offset: 3136)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall", scope: !66, file: !67, line: 231, baseType: !358, size: 64, offset: 3200)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "vectorcallfunc", file: !6, line: 370, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!40, !40, !362, !35, !40}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tp_watched", scope: !66, file: !67, line: 234, baseType: !365, size: 8, offset: 3264)
!365 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tp_versions_used", scope: !66, file: !67, line: 241, baseType: !59, size: 16, offset: 3280)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !368, line: 30, baseType: !7)
!368 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_int32_t.h", directory: "")
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !371, line: 15, baseType: !372)
!371 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/bytesobject.h", directory: "")
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !371, line: 5, size: 320, elements: !373)
!373 = !{!374, !375, !376}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !372, file: !371, line: 6, baseType: !70, size: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !372, file: !371, line: 7, baseType: !223, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !372, file: !371, line: 8, baseType: !377, size: 8, offset: 256)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 1)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunctionObject", file: !382, line: 14, baseType: !383)
!382 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/methodobject.h", directory: "")
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 7, size: 448, elements: !384)
!384 = !{!385, !386, !387, !388, !389, !390}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !383, file: !382, line: 8, baseType: !41, size: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "m_ml", scope: !383, file: !382, line: 9, baseType: !285, size: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "m_self", scope: !383, file: !382, line: 10, baseType: !40, size: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "m_module", scope: !383, file: !382, line: 11, baseType: !40, size: 64, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "m_weakreflist", scope: !383, file: !382, line: 12, baseType: !40, size: 64, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "vectorcall", scope: !383, file: !382, line: 13, baseType: !358, size: 64, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !393, line: 163, baseType: !394)
!393 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/unicodeobject.h", directory: "")
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !393, line: 54, size: 320, elements: !395)
!395 = !{!396, !397, !398, !399}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !394, file: !393, line: 99, baseType: !41, size: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !394, file: !393, line: 100, baseType: !75, size: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !394, file: !393, line: 101, baseType: !223, size: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !394, file: !393, line: 162, baseType: !400, size: 32, offset: 256)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !394, file: !393, line: 107, size: 32, elements: !401)
!401 = !{!402, !403, !404, !405, !406}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !400, file: !393, line: 121, baseType: !23, size: 2, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !400, file: !393, line: 145, baseType: !23, size: 3, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !400, file: !393, line: 150, baseType: !23, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !400, file: !393, line: 154, baseType: !23, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "statically_allocated", scope: !400, file: !393, line: 156, baseType: !23, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBaseExceptionObject", file: !409, line: 15, baseType: !410)
!409 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/pyerrors.h", directory: "")
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !409, line: 13, size: 576, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !410, file: !409, line: 14, baseType: !41, size: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !410, file: !409, line: 14, baseType: !40, size: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !410, file: !409, line: 14, baseType: !40, size: 64, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !410, file: !409, line: 14, baseType: !40, size: 64, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", scope: !410, file: !409, line: 14, baseType: !40, size: 64, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !410, file: !409, line: 14, baseType: !40, size: 64, offset: 384)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "cause", scope: !410, file: !409, line: 14, baseType: !40, size: 64, offset: 448)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_context", scope: !410, file: !409, line: 14, baseType: !20, size: 8, offset: 512)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CodeObjectCacheEntry", file: !422, line: 1703, baseType: !423)
!422 = !DIFile(filename: "dataset/cases/goeq-ojva-0009/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c", directory: ".")
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !422, line: 1700, size: 128, elements: !424)
!424 = !{!425, !485}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "code_object", scope: !423, file: !422, line: 1701, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CachedCodeObjectType", file: !422, line: 1698, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !42, line: 21, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyCodeObject", file: !430, line: 115, size: 1728, elements: !431)
!430 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/code.h", directory: "")
!431 = !{!432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !466, !475, !478, !481, !482, !483, !484}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !429, file: !430, line: 115, baseType: !70, size: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !429, file: !430, line: 115, baseType: !40, size: 64, offset: 192)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !429, file: !430, line: 115, baseType: !40, size: 64, offset: 256)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "co_exceptiontable", scope: !429, file: !430, line: 115, baseType: !40, size: 64, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !429, file: !430, line: 115, baseType: !7, size: 32, offset: 384)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !429, file: !430, line: 115, baseType: !7, size: 32, offset: 416)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "co_posonlyargcount", scope: !429, file: !430, line: 115, baseType: !7, size: 32, offset: 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !429, file: !430, line: 115, baseType: !7, size: 32, offset: 480)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !429, file: !430, line: 115, baseType: !7, size: 32, offset: 512)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !429, file: !430, line: 115, baseType: !7, size: 32, offset: 544)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocalsplus", scope: !429, file: !430, line: 115, baseType: !7, size: 32, offset: 576)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "co_framesize", scope: !429, file: !430, line: 115, baseType: !7, size: 32, offset: 608)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !429, file: !430, line: 115, baseType: !7, size: 32, offset: 640)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "co_ncellvars", scope: !429, file: !430, line: 115, baseType: !7, size: 32, offset: 672)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "co_nfreevars", scope: !429, file: !430, line: 115, baseType: !7, size: 32, offset: 704)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "co_version", scope: !429, file: !430, line: 115, baseType: !56, size: 32, offset: 736)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "co_localsplusnames", scope: !429, file: !430, line: 115, baseType: !40, size: 64, offset: 768)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "co_localspluskinds", scope: !429, file: !430, line: 115, baseType: !40, size: 64, offset: 832)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !429, file: !430, line: 115, baseType: !40, size: 64, offset: 896)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !429, file: !430, line: 115, baseType: !40, size: 64, offset: 960)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "co_qualname", scope: !429, file: !430, line: 115, baseType: !40, size: 64, offset: 1024)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "co_linetable", scope: !429, file: !430, line: 115, baseType: !40, size: 64, offset: 1088)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !429, file: !430, line: 115, baseType: !40, size: 64, offset: 1152)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "co_executors", scope: !429, file: !430, line: 115, baseType: !456, size: 64, offset: 1216)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyExecutorArray", file: !430, line: 22, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !430, line: 18, size: 128, elements: !459)
!459 = !{!460, !461, !462}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !458, file: !430, line: 19, baseType: !7, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !458, file: !430, line: 20, baseType: !7, size: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "executors", scope: !458, file: !430, line: 21, baseType: !463, size: 64, offset: 64)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 64, elements: !378)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyExecutorObject", file: !430, line: 21, flags: DIFlagFwdDecl)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_co_cached", scope: !429, file: !430, line: 115, baseType: !467, size: 64, offset: 1280)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyCoCached", file: !430, line: 16, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !430, line: 11, size: 256, elements: !470)
!470 = !{!471, !472, !473, !474}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_co_code", scope: !469, file: !430, line: 12, baseType: !40, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_co_varnames", scope: !469, file: !430, line: 13, baseType: !40, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_co_cellvars", scope: !469, file: !430, line: 14, baseType: !40, size: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_co_freevars", scope: !469, file: !430, line: 15, baseType: !40, size: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_co_instrumentation_version", scope: !429, file: !430, line: 115, baseType: !476, size: 64, offset: 1344)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !477, line: 34, baseType: !38)
!477 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_co_monitoring", scope: !429, file: !430, line: 115, baseType: !479, size: 64, offset: 1408)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyCoMonitoringData", file: !430, line: 115, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_co_unique_id", scope: !429, file: !430, line: 115, baseType: !75, size: 64, offset: 1472)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_co_firsttraceable", scope: !429, file: !430, line: 115, baseType: !7, size: 32, offset: 1536)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "co_extra", scope: !429, file: !430, line: 115, baseType: !39, size: 64, offset: 1600)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "co_code_adaptive", scope: !429, file: !430, line: 115, baseType: !377, size: 8, offset: 1664)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "code_line", scope: !423, file: !422, line: 1702, baseType: !7, size: 32, offset: 64)
!486 = !{!0, !487, !492, !494, !499, !529, !532, !537, !542, !547, !552, !554, !556, !558, !563, !568, !570, !576, !581, !583, !588, !613, !615, !620, !625, !630, !632, !637, !641, !646, !648, !650, !655, !660, !665, !667, !669, !671, !676, !678, !680, !682, !685, !687, !690, !695, !700, !705, !710, !715, !717, !719, !721, !723, !725, !730, !732, !737}
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(scope: null, file: !422, line: 3381, type: !489, isLocal: true, isDefinition: true)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, elements: !490)
!490 = !{!491}
!491 = !DISubrange(count: 16)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(scope: null, file: !422, line: 3388, type: !377, isLocal: true, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(scope: null, file: !422, line: 2093, type: !496, isLocal: true, isDefinition: true)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 72, elements: !497)
!497 = !{!498}
!498 = !DISubrange(count: 9)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "__pyx_moduledef", scope: !2, file: !422, line: 2089, type: !501, isLocal: true, isDefinition: true)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !502, line: 107, size: 832, elements: !503)
!502 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/moduleobject.h", directory: "")
!503 = !{!504, !515, !516, !517, !518, !519, !526, !527, !528}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !501, file: !502, line: 108, baseType: !505, size: 320)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !502, line: 58, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !502, line: 39, size: 320, elements: !507)
!507 = !{!508, !509, !513, !514}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !506, file: !502, line: 40, baseType: !41, size: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !506, file: !502, line: 47, baseType: !510, size: 64, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!40}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !506, file: !502, line: 52, baseType: !75, size: 64, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !506, file: !502, line: 57, baseType: !40, size: 64, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !501, file: !502, line: 109, baseType: !18, size: 64, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !501, file: !502, line: 110, baseType: !18, size: 64, offset: 384)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !501, file: !502, line: 111, baseType: !75, size: 64, offset: 448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !501, file: !502, line: 112, baseType: !285, size: 64, offset: 512)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "m_slots", scope: !501, file: !502, line: 113, baseType: !520, size: 64, offset: 576)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Slot", file: !42, line: 13, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Slot", file: !502, line: 69, size: 128, elements: !523)
!523 = !{!524, !525}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !522, file: !502, line: 70, baseType: !7, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !522, file: !502, line: 71, baseType: !39, size: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !501, file: !502, line: 114, baseType: !265, size: 64, offset: 640)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !501, file: !502, line: 115, baseType: !145, size: 64, offset: 704)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !501, file: !502, line: 116, baseType: !344, size: 64, offset: 768)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "__pyx_methods", scope: !2, file: !422, line: 1988, type: !531, isLocal: true, isDefinition: true)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 256, elements: !378)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "__pyx_moduledef_slots", scope: !2, file: !422, line: 2072, type: !534, isLocal: true, isDefinition: true)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 384, elements: !535)
!535 = !{!536}
!536 = !DISubrange(count: 3)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(scope: null, file: !422, line: 2221, type: !539, isLocal: true, isDefinition: true)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 40, elements: !540)
!540 = !{!541}
!541 = !DISubrange(count: 5)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !422, line: 2228, type: !544, isLocal: true, isDefinition: true)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 56, elements: !545)
!545 = !{!546}
!546 = !DISubrange(count: 7)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(scope: null, file: !422, line: 2228, type: !549, isLocal: true, isDefinition: true)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 88, elements: !550)
!550 = !{!551}
!551 = !DISubrange(count: 11)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(scope: null, file: !422, line: 2229, type: !544, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !422, line: 2229, type: !496, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !422, line: 2230, type: !544, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !422, line: 2230, type: !560, isLocal: true, isDefinition: true)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 96, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 12)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !422, line: 2231, type: !565, isLocal: true, isDefinition: true)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 216, elements: !566)
!566 = !{!567}
!567 = !DISubrange(count: 27)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !422, line: 2231, type: !496, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "main_interpreter_id", scope: !572, file: !422, line: 2168, type: !49, isLocal: true, isDefinition: true)
!572 = distinct !DISubprogram(name: "__Pyx_check_single_interpreter", scope: !422, file: !422, line: 2167, type: !573, scopeLine: 2167, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !575)
!573 = !DISubroutineType(types: !574)
!574 = !{!7}
!575 = !{}
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !422, line: 2190, type: !578, isLocal: true, isDefinition: true)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 760, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 95)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "__pyx_m", scope: !2, file: !422, line: 1326, type: !40, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !422, line: 2259, type: !585, isLocal: true, isDefinition: true)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 648, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 81)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "__pyx_mstate_global", scope: !2, file: !422, line: 1925, type: !590, isLocal: true, isDefinition: true)
!590 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !591)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pyx_mstatetype", file: !422, line: 1904, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !422, line: 1890, size: 1856, elements: !594)
!594 = !{!595, !596, !597, !598, !599, !600, !601, !603, !607}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_d", scope: !593, file: !422, line: 1891, baseType: !40, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_b", scope: !593, file: !422, line: 1892, baseType: !40, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_cython_runtime", scope: !593, file: !422, line: 1893, baseType: !40, size: 64, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_tuple", scope: !593, file: !422, line: 1894, baseType: !40, size: 64, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_bytes", scope: !593, file: !422, line: 1895, baseType: !40, size: 64, offset: 256)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_unicode", scope: !593, file: !422, line: 1896, baseType: !40, size: 64, offset: 320)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_tuple", scope: !593, file: !422, line: 1897, baseType: !602, size: 192, offset: 384)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 192, elements: !535)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_string_tab", scope: !593, file: !422, line: 1898, baseType: !604, size: 1152, offset: 576)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 1152, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 18)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_code_cache", scope: !593, file: !422, line: 1901, baseType: !608, size: 128, offset: 1728)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__Pyx_CodeObjectCache", file: !422, line: 1704, size: 128, elements: !609)
!609 = !{!610, !611, !612}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !608, file: !422, line: 1705, baseType: !7, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "max_count", scope: !608, file: !422, line: 1706, baseType: !7, size: 32, offset: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !608, file: !422, line: 1707, baseType: !420, size: 64, offset: 64)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !422, line: 2289, type: !496, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !422, line: 2290, type: !617, isLocal: true, isDefinition: true)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 120, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 15)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !422, line: 2291, type: !622, isLocal: true, isDefinition: true)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 104, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 13)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !422, line: 2466, type: !627, isLocal: true, isDefinition: true)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 112, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 14)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "__pyx_mstate_global_static", scope: !2, file: !422, line: 1919, type: !592, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !422, line: 1336, type: !634, isLocal: true, isDefinition: true)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 440, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 55)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(name: "__pyx_f", scope: !2, file: !422, line: 1335, type: !639, isLocal: true, isDefinition: true)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !640, size: 64, elements: !378)
!640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !422, line: 4244, type: !643, isLocal: true, isDefinition: true)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 624, elements: !644)
!644 = !{!645}
!645 = !DISubrange(count: 78)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !422, line: 4250, type: !617, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !422, line: 4250, type: !617, isLocal: true, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !422, line: 2579, type: !652, isLocal: true, isDefinition: true)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 776, elements: !653)
!653 = !{!654}
!654 = !DISubrange(count: 97)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(scope: null, file: !422, line: 4260, type: !657, isLocal: true, isDefinition: true)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 136, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 17)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !422, line: 4260, type: !662, isLocal: true, isDefinition: true)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 32, elements: !663)
!663 = !{!664}
!664 = !DISubrange(count: 4)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !422, line: 4260, type: !539, isLocal: true, isDefinition: true)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(scope: null, file: !422, line: 4261, type: !549, isLocal: true, isDefinition: true)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(scope: null, file: !422, line: 4265, type: !662, isLocal: true, isDefinition: true)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(scope: null, file: !422, line: 4312, type: !673, isLocal: true, isDefinition: true)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1224, elements: !674)
!674 = !{!675}
!675 = !DISubrange(count: 153)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "__pyx_filename", scope: !2, file: !422, line: 1331, type: !18, isLocal: true, isDefinition: true)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "__pyx_lineno", scope: !2, file: !422, line: 1328, type: !7, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(name: "__pyx_clineno", scope: !2, file: !422, line: 1329, type: !7, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !371, line: 25, type: !684, isLocal: true, isDefinition: true)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 144, elements: !605)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !371, line: 25, type: !627, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !371, line: 25, type: !689, isLocal: true, isDefinition: true)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 144, elements: !605)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !422, line: 2812, type: !692, isLocal: true, isDefinition: true)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 200, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 25)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !422, line: 2844, type: !697, isLocal: true, isDefinition: true)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 248, elements: !698)
!698 = !{!699}
!699 = !DISubrange(count: 31)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(scope: null, file: !422, line: 2851, type: !702, isLocal: true, isDefinition: true)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 344, elements: !703)
!703 = !{!704}
!704 = !DISubrange(count: 43)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(scope: null, file: !422, line: 2889, type: !707, isLocal: true, isDefinition: true)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 224, elements: !708)
!708 = !{!709}
!709 = !DISubrange(count: 28)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(scope: null, file: !422, line: 2889, type: !712, isLocal: true, isDefinition: true)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 80, elements: !713)
!713 = !{!714}
!714 = !DISubrange(count: 10)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(scope: null, file: !422, line: 2889, type: !565, isLocal: true, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(scope: null, file: !422, line: 2891, type: !549, isLocal: true, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "__pyx_builtin_input", scope: !2, file: !422, line: 1873, type: !40, isLocal: true, isDefinition: true)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "__pyx_builtin_print", scope: !2, file: !422, line: 1874, type: !40, isLocal: true, isDefinition: true)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !422, line: 3256, type: !549, isLocal: true, isDefinition: true)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(scope: null, file: !422, line: 1330, type: !727, isLocal: true, isDefinition: true)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 952, elements: !728)
!728 = !{!729}
!729 = !DISubrange(count: 119)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(name: "__pyx_cfilenm", scope: !2, file: !422, line: 1330, type: !640, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !422, line: 2714, type: !734, isLocal: true, isDefinition: true)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 192, elements: !735)
!735 = !{!736}
!736 = !DISubrange(count: 24)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !422, line: 2714, type: !739, isLocal: true, isDefinition: true)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 560, elements: !740)
!740 = !{!741}
!741 = !DISubrange(count: 70)
!742 = !{i32 2, !"SDK Version", [2 x i32] [i32 14, i32 4]}
!743 = !{i32 7, !"Dwarf Version", i32 4}
!744 = !{i32 2, !"Debug Info Version", i32 3}
!745 = !{i32 1, !"wchar_size", i32 4}
!746 = !{i32 8, !"PIC Level", i32 2}
!747 = !{i32 7, !"uwtable", i32 1}
!748 = !{i32 7, !"frame-pointer", i32 1}
!749 = !{!"Homebrew clang version 20.1.8"}
!750 = distinct !DISubprogram(name: "PyInit_original", scope: !422, file: !422, line: 2132, type: !511, scopeLine: 2134, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2)
!751 = !DILocation(line: 2135, column: 10, scope: !750)
!752 = !DILocation(line: 2135, column: 3, scope: !750)
!753 = distinct !DISubprogram(name: "main", scope: !422, file: !422, line: 3370, type: !754, scopeLine: 3371, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !575)
!754 = !DISubroutineType(types: !755)
!755 = !{!7, !7, !756}
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!757 = !DILocalVariable(name: "argc", arg: 1, scope: !753, file: !422, line: 3370, type: !7)
!758 = !DILocation(line: 3370, column: 10, scope: !753)
!759 = !DILocalVariable(name: "argv", arg: 2, scope: !753, file: !422, line: 3370, type: !756)
!760 = !DILocation(line: 3370, column: 23, scope: !753)
!761 = !DILocation(line: 3372, column: 10, scope: !762)
!762 = distinct !DILexicalBlock(scope: !753, file: !422, line: 3372, column: 9)
!763 = !DILocation(line: 3372, column: 9, scope: !762)
!764 = !DILocation(line: 3373, column: 16, scope: !765)
!765 = distinct !DILexicalBlock(scope: !762, file: !422, line: 3372, column: 16)
!766 = !DILocation(line: 3373, column: 9, scope: !765)
!767 = !DILocalVariable(name: "i", scope: !768, file: !422, line: 3376, type: !7)
!768 = distinct !DILexicalBlock(scope: !762, file: !422, line: 3375, column: 10)
!769 = !DILocation(line: 3376, column: 13, scope: !768)
!770 = !DILocalVariable(name: "res", scope: !768, file: !422, line: 3376, type: !7)
!771 = !DILocation(line: 3376, column: 16, scope: !768)
!772 = !DILocalVariable(name: "argv_copy", scope: !768, file: !422, line: 3377, type: !29)
!773 = !DILocation(line: 3377, column: 19, scope: !768)
!774 = !DILocation(line: 3377, column: 78, scope: !768)
!775 = !DILocation(line: 3377, column: 69, scope: !768)
!776 = !DILocation(line: 3377, column: 67, scope: !768)
!777 = !DILocation(line: 3377, column: 43, scope: !768)
!778 = !DILocalVariable(name: "argv_copy2", scope: !768, file: !422, line: 3378, type: !29)
!779 = !DILocation(line: 3378, column: 19, scope: !768)
!780 = !DILocation(line: 3378, column: 79, scope: !768)
!781 = !DILocation(line: 3378, column: 70, scope: !768)
!782 = !DILocation(line: 3378, column: 68, scope: !768)
!783 = !DILocation(line: 3378, column: 44, scope: !768)
!784 = !DILocalVariable(name: "oldloc", scope: !768, file: !422, line: 3379, type: !95)
!785 = !DILocation(line: 3379, column: 15, scope: !768)
!786 = !DILocation(line: 3379, column: 31, scope: !768)
!787 = !DILocation(line: 3379, column: 24, scope: !768)
!788 = !DILocation(line: 3380, column: 14, scope: !789)
!789 = distinct !DILexicalBlock(scope: !768, file: !422, line: 3380, column: 13)
!790 = !DILocation(line: 3380, column: 24, scope: !789)
!791 = !DILocation(line: 3380, column: 28, scope: !789)
!792 = !DILocation(line: 3380, column: 39, scope: !789)
!793 = !DILocation(line: 3380, column: 43, scope: !789)
!794 = !DILocation(line: 3381, column: 21, scope: !795)
!795 = distinct !DILexicalBlock(scope: !789, file: !422, line: 3380, column: 51)
!796 = !DILocation(line: 3381, column: 13, scope: !795)
!797 = !DILocation(line: 3382, column: 18, scope: !795)
!798 = !DILocation(line: 3382, column: 13, scope: !795)
!799 = !DILocation(line: 3383, column: 18, scope: !795)
!800 = !DILocation(line: 3383, column: 13, scope: !795)
!801 = !DILocation(line: 3384, column: 18, scope: !795)
!802 = !DILocation(line: 3384, column: 13, scope: !795)
!803 = !DILocation(line: 3385, column: 13, scope: !795)
!804 = !DILocation(line: 3387, column: 13, scope: !768)
!805 = !DILocation(line: 3388, column: 9, scope: !768)
!806 = !DILocation(line: 3389, column: 16, scope: !807)
!807 = distinct !DILexicalBlock(scope: !768, file: !422, line: 3389, column: 9)
!808 = !DILocation(line: 3389, column: 14, scope: !807)
!809 = !DILocation(line: 3389, column: 21, scope: !810)
!810 = distinct !DILexicalBlock(scope: !807, file: !422, line: 3389, column: 9)
!811 = !DILocation(line: 3389, column: 25, scope: !810)
!812 = !DILocation(line: 3389, column: 23, scope: !810)
!813 = !DILocation(line: 3389, column: 9, scope: !807)
!814 = !DILocation(line: 3390, column: 60, scope: !815)
!815 = distinct !DILexicalBlock(scope: !810, file: !422, line: 3389, column: 36)
!816 = !DILocation(line: 3390, column: 65, scope: !815)
!817 = !DILocation(line: 3390, column: 44, scope: !815)
!818 = !DILocation(line: 3390, column: 29, scope: !815)
!819 = !DILocation(line: 3390, column: 39, scope: !815)
!820 = !DILocation(line: 3390, column: 42, scope: !815)
!821 = !DILocation(line: 3390, column: 13, scope: !815)
!822 = !DILocation(line: 3390, column: 24, scope: !815)
!823 = !DILocation(line: 3390, column: 27, scope: !815)
!824 = !DILocation(line: 3391, column: 18, scope: !825)
!825 = distinct !DILexicalBlock(scope: !815, file: !422, line: 3391, column: 17)
!826 = !DILocation(line: 3391, column: 28, scope: !825)
!827 = !DILocation(line: 3391, column: 17, scope: !825)
!828 = !DILocation(line: 3391, column: 36, scope: !825)
!829 = !DILocation(line: 3391, column: 32, scope: !825)
!830 = !DILocation(line: 3392, column: 9, scope: !815)
!831 = !DILocation(line: 3389, column: 32, scope: !810)
!832 = !DILocation(line: 3389, column: 9, scope: !810)
!833 = distinct !{!833, !813, !834, !835}
!834 = !DILocation(line: 3392, column: 9, scope: !807)
!835 = !{!"llvm.loop.mustprogress"}
!836 = !DILocation(line: 3393, column: 27, scope: !768)
!837 = !DILocation(line: 3393, column: 9, scope: !768)
!838 = !DILocation(line: 3394, column: 14, scope: !768)
!839 = !DILocation(line: 3394, column: 9, scope: !768)
!840 = !DILocation(line: 3395, column: 13, scope: !841)
!841 = distinct !DILexicalBlock(scope: !768, file: !422, line: 3395, column: 13)
!842 = !DILocation(line: 3395, column: 17, scope: !841)
!843 = !DILocation(line: 3396, column: 30, scope: !841)
!844 = !DILocation(line: 3396, column: 36, scope: !841)
!845 = !DILocation(line: 3396, column: 19, scope: !841)
!846 = !DILocation(line: 3396, column: 17, scope: !841)
!847 = !DILocation(line: 3396, column: 13, scope: !841)
!848 = !DILocation(line: 3397, column: 16, scope: !849)
!849 = distinct !DILexicalBlock(scope: !768, file: !422, line: 3397, column: 9)
!850 = !DILocation(line: 3397, column: 14, scope: !849)
!851 = !DILocation(line: 3397, column: 21, scope: !852)
!852 = distinct !DILexicalBlock(scope: !849, file: !422, line: 3397, column: 9)
!853 = !DILocation(line: 3397, column: 25, scope: !852)
!854 = !DILocation(line: 3397, column: 23, scope: !852)
!855 = !DILocation(line: 3397, column: 9, scope: !849)
!856 = !DILocation(line: 3398, column: 27, scope: !857)
!857 = distinct !DILexicalBlock(scope: !852, file: !422, line: 3397, column: 36)
!858 = !DILocation(line: 3398, column: 38, scope: !857)
!859 = !DILocation(line: 3398, column: 13, scope: !857)
!860 = !DILocation(line: 3399, column: 9, scope: !857)
!861 = !DILocation(line: 3397, column: 32, scope: !852)
!862 = !DILocation(line: 3397, column: 9, scope: !852)
!863 = distinct !{!863, !855, !864, !835}
!864 = !DILocation(line: 3399, column: 9, scope: !849)
!865 = !DILocation(line: 3400, column: 14, scope: !768)
!866 = !DILocation(line: 3400, column: 9, scope: !768)
!867 = !DILocation(line: 3401, column: 14, scope: !768)
!868 = !DILocation(line: 3401, column: 9, scope: !768)
!869 = !DILocation(line: 3402, column: 16, scope: !768)
!870 = !DILocation(line: 3402, column: 9, scope: !768)
!871 = !DILocation(line: 3404, column: 1, scope: !753)
!872 = distinct !DISubprogram(name: "__Pyx_main", scope: !422, file: !422, line: 3315, type: !873, scopeLine: 3317, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !575)
!873 = !DISubroutineType(types: !874)
!874 = !{!7, !7, !29}
!875 = !DILocalVariable(name: "argc", arg: 1, scope: !872, file: !422, line: 3315, type: !7)
!876 = !DILocation(line: 3315, column: 27, scope: !872)
!877 = !DILocalVariable(name: "argv", arg: 2, scope: !872, file: !422, line: 3315, type: !29)
!878 = !DILocation(line: 3315, column: 43, scope: !872)
!879 = !DILocation(line: 3328, column: 9, scope: !880)
!880 = distinct !DILexicalBlock(scope: !872, file: !422, line: 3328, column: 9)
!881 = !DILocation(line: 3328, column: 61, scope: !880)
!882 = !DILocation(line: 3328, column: 66, scope: !880)
!883 = !DILocalVariable(name: "status", scope: !884, file: !422, line: 3330, type: !885)
!884 = distinct !DILexicalBlock(scope: !872, file: !422, line: 3329, column: 5)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyStatus", file: !13, line: 19, baseType: !14)
!886 = !DILocation(line: 3330, column: 18, scope: !884)
!887 = !DILocalVariable(name: "config", scope: !884, file: !422, line: 3331, type: !888)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyConfig", file: !13, line: 244, baseType: !889)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyConfig", file: !13, line: 134, size: 3648, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_config_init", scope: !889, file: !13, line: 135, baseType: !7, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "isolated", scope: !889, file: !13, line: 137, baseType: !7, size: 32, offset: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "use_environment", scope: !889, file: !13, line: 138, baseType: !7, size: 32, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "dev_mode", scope: !889, file: !13, line: 139, baseType: !7, size: 32, offset: 96)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "install_signal_handlers", scope: !889, file: !13, line: 140, baseType: !7, size: 32, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "use_hash_seed", scope: !889, file: !13, line: 141, baseType: !7, size: 32, offset: 160)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "hash_seed", scope: !889, file: !13, line: 142, baseType: !38, size: 64, offset: 192)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "faulthandler", scope: !889, file: !13, line: 143, baseType: !7, size: 32, offset: 256)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "tracemalloc", scope: !889, file: !13, line: 144, baseType: !7, size: 32, offset: 288)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "perf_profiling", scope: !889, file: !13, line: 145, baseType: !7, size: 32, offset: 320)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "remote_debug", scope: !889, file: !13, line: 146, baseType: !7, size: 32, offset: 352)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "import_time", scope: !889, file: !13, line: 147, baseType: !7, size: 32, offset: 384)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "code_debug_ranges", scope: !889, file: !13, line: 148, baseType: !7, size: 32, offset: 416)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "show_ref_count", scope: !889, file: !13, line: 149, baseType: !7, size: 32, offset: 448)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "dump_refs", scope: !889, file: !13, line: 150, baseType: !7, size: 32, offset: 480)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "dump_refs_file", scope: !889, file: !13, line: 151, baseType: !30, size: 64, offset: 512)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_stats", scope: !889, file: !13, line: 152, baseType: !7, size: 32, offset: 576)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "filesystem_encoding", scope: !889, file: !13, line: 153, baseType: !30, size: 64, offset: 640)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "filesystem_errors", scope: !889, file: !13, line: 154, baseType: !30, size: 64, offset: 704)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "pycache_prefix", scope: !889, file: !13, line: 155, baseType: !30, size: 64, offset: 768)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "parse_argv", scope: !889, file: !13, line: 156, baseType: !7, size: 32, offset: 832)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "orig_argv", scope: !889, file: !13, line: 157, baseType: !913, size: 128, offset: 896)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyWideStringList", file: !13, line: 36, baseType: !914)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 31, size: 128, elements: !915)
!915 = !{!916, !917}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !914, file: !13, line: 34, baseType: !75, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !914, file: !13, line: 35, baseType: !29, size: 64, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !889, file: !13, line: 158, baseType: !913, size: 128, offset: 1024)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "xoptions", scope: !889, file: !13, line: 159, baseType: !913, size: 128, offset: 1152)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "warnoptions", scope: !889, file: !13, line: 160, baseType: !913, size: 128, offset: 1280)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "site_import", scope: !889, file: !13, line: 161, baseType: !7, size: 32, offset: 1408)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_warning", scope: !889, file: !13, line: 162, baseType: !7, size: 32, offset: 1440)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "warn_default_encoding", scope: !889, file: !13, line: 163, baseType: !7, size: 32, offset: 1472)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "inspect", scope: !889, file: !13, line: 164, baseType: !7, size: 32, offset: 1504)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !889, file: !13, line: 165, baseType: !7, size: 32, offset: 1536)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "optimization_level", scope: !889, file: !13, line: 166, baseType: !7, size: 32, offset: 1568)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "parser_debug", scope: !889, file: !13, line: 167, baseType: !7, size: 32, offset: 1600)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "write_bytecode", scope: !889, file: !13, line: 168, baseType: !7, size: 32, offset: 1632)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !889, file: !13, line: 169, baseType: !7, size: 32, offset: 1664)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !889, file: !13, line: 170, baseType: !7, size: 32, offset: 1696)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "user_site_directory", scope: !889, file: !13, line: 171, baseType: !7, size: 32, offset: 1728)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "configure_c_stdio", scope: !889, file: !13, line: 172, baseType: !7, size: 32, offset: 1760)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "buffered_stdio", scope: !889, file: !13, line: 173, baseType: !7, size: 32, offset: 1792)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "stdio_encoding", scope: !889, file: !13, line: 174, baseType: !30, size: 64, offset: 1856)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "stdio_errors", scope: !889, file: !13, line: 175, baseType: !30, size: 64, offset: 1920)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "check_hash_pycs_mode", scope: !889, file: !13, line: 179, baseType: !30, size: 64, offset: 1984)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "use_frozen_modules", scope: !889, file: !13, line: 180, baseType: !7, size: 32, offset: 2048)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "safe_path", scope: !889, file: !13, line: 181, baseType: !7, size: 32, offset: 2080)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "int_max_str_digits", scope: !889, file: !13, line: 182, baseType: !7, size: 32, offset: 2112)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "thread_inherit_context", scope: !889, file: !13, line: 183, baseType: !7, size: 32, offset: 2144)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "context_aware_warnings", scope: !889, file: !13, line: 184, baseType: !7, size: 32, offset: 2176)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "use_system_logger", scope: !889, file: !13, line: 186, baseType: !7, size: 32, offset: 2208)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_count", scope: !889, file: !13, line: 189, baseType: !7, size: 32, offset: 2240)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "pathconfig_warnings", scope: !889, file: !13, line: 196, baseType: !7, size: 32, offset: 2272)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "program_name", scope: !889, file: !13, line: 197, baseType: !30, size: 64, offset: 2304)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "pythonpath_env", scope: !889, file: !13, line: 198, baseType: !30, size: 64, offset: 2368)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "home", scope: !889, file: !13, line: 199, baseType: !30, size: 64, offset: 2432)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "platlibdir", scope: !889, file: !13, line: 200, baseType: !30, size: 64, offset: 2496)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "module_search_paths_set", scope: !889, file: !13, line: 203, baseType: !7, size: 32, offset: 2560)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "module_search_paths", scope: !889, file: !13, line: 204, baseType: !913, size: 128, offset: 2624)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "stdlib_dir", scope: !889, file: !13, line: 205, baseType: !30, size: 64, offset: 2752)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "executable", scope: !889, file: !13, line: 206, baseType: !30, size: 64, offset: 2816)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "base_executable", scope: !889, file: !13, line: 207, baseType: !30, size: 64, offset: 2880)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !889, file: !13, line: 208, baseType: !30, size: 64, offset: 2944)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "base_prefix", scope: !889, file: !13, line: 209, baseType: !30, size: 64, offset: 3008)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "exec_prefix", scope: !889, file: !13, line: 210, baseType: !30, size: 64, offset: 3072)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "base_exec_prefix", scope: !889, file: !13, line: 211, baseType: !30, size: 64, offset: 3136)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "skip_source_first_line", scope: !889, file: !13, line: 214, baseType: !7, size: 32, offset: 3200)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "run_command", scope: !889, file: !13, line: 215, baseType: !30, size: 64, offset: 3264)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "run_module", scope: !889, file: !13, line: 216, baseType: !30, size: 64, offset: 3328)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "run_filename", scope: !889, file: !13, line: 217, baseType: !30, size: 64, offset: 3392)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "sys_path_0", scope: !889, file: !13, line: 220, baseType: !30, size: 64, offset: 3456)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_install_importlib", scope: !889, file: !13, line: 226, baseType: !7, size: 32, offset: 3520)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_init_main", scope: !889, file: !13, line: 229, baseType: !7, size: 32, offset: 3552)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_is_python_build", scope: !889, file: !13, line: 232, baseType: !7, size: 32, offset: 3584)
!966 = !DILocation(line: 3331, column: 18, scope: !884)
!967 = !DILocation(line: 3332, column: 9, scope: !884)
!968 = !DILocation(line: 3333, column: 16, scope: !884)
!969 = !DILocation(line: 3333, column: 27, scope: !884)
!970 = !DILocation(line: 3334, column: 13, scope: !971)
!971 = distinct !DILexicalBlock(scope: !884, file: !422, line: 3334, column: 13)
!972 = !DILocation(line: 3334, column: 18, scope: !971)
!973 = !DILocation(line: 3334, column: 21, scope: !971)
!974 = !DILocation(line: 3335, column: 58, scope: !975)
!975 = distinct !DILexicalBlock(scope: !971, file: !422, line: 3334, column: 27)
!976 = !DILocation(line: 3335, column: 72, scope: !975)
!977 = !DILocation(line: 3335, column: 22, scope: !975)
!978 = !DILocation(line: 3336, column: 17, scope: !979)
!979 = distinct !DILexicalBlock(scope: !975, file: !422, line: 3336, column: 17)
!980 = !DILocation(line: 3337, column: 17, scope: !981)
!981 = distinct !DILexicalBlock(scope: !979, file: !422, line: 3336, column: 45)
!982 = !DILocation(line: 3338, column: 17, scope: !981)
!983 = !DILocation(line: 3340, column: 48, scope: !975)
!984 = !DILocation(line: 3340, column: 54, scope: !975)
!985 = !DILocation(line: 3340, column: 22, scope: !975)
!986 = !DILocation(line: 3341, column: 17, scope: !987)
!987 = distinct !DILexicalBlock(scope: !975, file: !422, line: 3341, column: 17)
!988 = !DILocation(line: 3342, column: 17, scope: !989)
!989 = distinct !DILexicalBlock(scope: !987, file: !422, line: 3341, column: 45)
!990 = !DILocation(line: 3343, column: 17, scope: !989)
!991 = !DILocation(line: 3345, column: 9, scope: !975)
!992 = !DILocation(line: 3346, column: 18, scope: !884)
!993 = !DILocation(line: 3347, column: 13, scope: !994)
!994 = distinct !DILexicalBlock(scope: !884, file: !422, line: 3347, column: 13)
!995 = !DILocation(line: 3348, column: 13, scope: !996)
!996 = distinct !DILexicalBlock(scope: !994, file: !422, line: 3347, column: 41)
!997 = !DILocation(line: 3349, column: 13, scope: !996)
!998 = !DILocation(line: 3351, column: 9, scope: !884)
!999 = !DILocalVariable(name: "m", scope: !1000, file: !422, line: 3354, type: !40)
!1000 = distinct !DILexicalBlock(scope: !872, file: !422, line: 3353, column: 5)
!1001 = !DILocation(line: 3354, column: 17, scope: !1000)
!1002 = !DILocation(line: 3355, column: 37, scope: !1000)
!1003 = !DILocation(line: 3356, column: 11, scope: !1000)
!1004 = !DILocation(line: 3356, column: 9, scope: !1000)
!1005 = !DILocation(line: 3357, column: 12, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !1000, file: !422, line: 3357, column: 11)
!1007 = !DILocation(line: 3357, column: 14, scope: !1006)
!1008 = !DILocation(line: 3357, column: 17, scope: !1006)
!1009 = !DILocation(line: 3358, column: 11, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1006, file: !422, line: 3357, column: 35)
!1011 = !DILocation(line: 3359, column: 11, scope: !1010)
!1012 = !DILocation(line: 3361, column: 7, scope: !1000)
!1013 = !DILocation(line: 3363, column: 9, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !872, file: !422, line: 3363, column: 9)
!1015 = !DILocation(line: 3363, column: 25, scope: !1014)
!1016 = !DILocation(line: 3364, column: 9, scope: !1014)
!1017 = !DILocation(line: 3365, column: 5, scope: !872)
!1018 = !DILocation(line: 3366, column: 1, scope: !872)
!1019 = distinct !DISubprogram(name: "__pyx_pymod_create", scope: !422, file: !422, line: 2212, type: !1020, scopeLine: 2212, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !575)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!40, !40, !1022}
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef", file: !42, line: 12, baseType: !501)
!1024 = !DILocalVariable(name: "spec", arg: 1, scope: !1019, file: !422, line: 2212, type: !40)
!1025 = !DILocation(line: 2212, column: 65, scope: !1019)
!1026 = !DILocalVariable(name: "def", arg: 2, scope: !1019, file: !422, line: 2212, type: !1022)
!1027 = !DILocation(line: 2212, column: 84, scope: !1019)
!1028 = !DILocalVariable(name: "module", scope: !1019, file: !422, line: 2213, type: !40)
!1029 = !DILocation(line: 2213, column: 15, scope: !1019)
!1030 = !DILocalVariable(name: "moddict", scope: !1019, file: !422, line: 2213, type: !40)
!1031 = !DILocation(line: 2213, column: 31, scope: !1019)
!1032 = !DILocalVariable(name: "modname", scope: !1019, file: !422, line: 2213, type: !40)
!1033 = !DILocation(line: 2213, column: 41, scope: !1019)
!1034 = !DILocation(line: 2214, column: 5, scope: !1019)
!1035 = !DILocation(line: 2216, column: 9, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1019, file: !422, line: 2216, column: 9)
!1037 = !DILocation(line: 2217, column: 9, scope: !1036)
!1038 = !DILocation(line: 2219, column: 9, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1019, file: !422, line: 2219, column: 9)
!1040 = !DILocation(line: 2220, column: 29, scope: !1039)
!1041 = !DILocation(line: 2220, column: 16, scope: !1039)
!1042 = !DILocation(line: 2220, column: 9, scope: !1039)
!1043 = !DILocation(line: 2221, column: 38, scope: !1019)
!1044 = !DILocation(line: 2221, column: 15, scope: !1019)
!1045 = !DILocation(line: 2221, column: 13, scope: !1019)
!1046 = !DILocation(line: 2222, column: 9, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1019, file: !422, line: 2222, column: 9)
!1048 = !DILocation(line: 2222, column: 29, scope: !1047)
!1049 = !DILocation(line: 2223, column: 33, scope: !1019)
!1050 = !DILocation(line: 2223, column: 14, scope: !1019)
!1051 = !DILocation(line: 2223, column: 12, scope: !1019)
!1052 = !DILocation(line: 2224, column: 5, scope: !1019)
!1053 = !DILocalVariable(name: "op", arg: 1, scope: !1054, file: !1055, line: 411, type: !40)
!1054 = distinct !DISubprogram(name: "Py_DECREF", scope: !1055, file: !1055, line: 411, type: !87, scopeLine: 412, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !575)
!1055 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/refcount.h", directory: "")
!1056 = !DILocation(line: 411, column: 57, scope: !1054, inlinedAt: !1057)
!1057 = distinct !DILocation(line: 2224, column: 5, scope: !1019)
!1058 = !DILocation(line: 415, column: 9, scope: !1059, inlinedAt: !1057)
!1059 = distinct !DILexicalBlock(scope: !1054, file: !1055, line: 415, column: 9)
!1060 = !DILocalVariable(name: "op", arg: 1, scope: !1061, file: !1055, line: 125, type: !40)
!1061 = distinct !DISubprogram(name: "_Py_IsImmortal", scope: !1055, file: !1055, line: 125, type: !147, scopeLine: 126, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !575)
