; ModuleID = 'dataset/cases/goeq-oja-0130/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c'
source_filename = "dataset/cases/goeq-oja-0130/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx14.0.0"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr }
%struct.PyModuleDef_Base = type { %struct._object, ptr, i64, ptr }
%struct._object = type { %union.anon, ptr }
%union.anon = type { i64 }
%struct.PyMethodDef = type { ptr, ptr, i32, ptr }
%struct.__pyx_mstatetype = type { ptr, ptr, ptr, ptr, ptr, ptr, %struct.__Pyx_CachedCFunction, %struct.__Pyx_CachedCFunction, [1 x ptr], [26 x ptr], [1 x ptr], ptr, ptr, %struct.__Pyx_CodeObjectCache }
%struct.__Pyx_CachedCFunction = type { ptr, ptr, ptr, ptr, i32 }
%struct.__Pyx_CodeObjectCache = type { i32, i32, ptr }
%struct.anon.1 = type { i8, [3 x i8] }
%struct._typeobject = type { %struct.PyVarObject, ptr, i64, i64, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, ptr, i8, i16 }
%struct.PyVarObject = type { %struct._object, i64 }
%struct.PyGetSetDef = type { ptr, ptr, ptr, ptr, ptr }
%struct._longobject = type { %struct._object, %struct._PyLongValue }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__pyx_module_is_main_original", scope: !2, file: !399, line: 2364, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Homebrew clang version 20.1.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !34, globals: !632, splitDebugInlining: false, nameTableKind: Apple, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk", sdk: "MacOSX14.sdk")
!3 = !DIFile(filename: "dataset/cases/goeq-oja-0130/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c", directory: ".")
!4 = !{!5, !12, !19}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 695, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/object.h", directory: "")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "PYGEN_RETURN", value: 0)
!10 = !DIEnumerator(name: "PYGEN_ERROR", value: -1)
!11 = !DIEnumerator(name: "PYGEN_NEXT", value: 1)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !13, line: 245, baseType: !14, size: 32, elements: !15)
!13 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/unicodeobject.h", directory: "")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16, !17, !18}
!16 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!17 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!18 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !21, file: !20, line: 11, baseType: !14, size: 32, elements: !30)
!20 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/initconfig.h", directory: "")
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !20, line: 10, size: 256, elements: !22)
!22 = !{!23, !24, !28, !29}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_type", scope: !21, file: !20, line: 15, baseType: !19, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !21, file: !20, line: 16, baseType: !25, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!27 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "err_msg", scope: !21, file: !20, line: 17, baseType: !25, size: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "exitcode", scope: !21, file: !20, line: 18, baseType: !7, size: 32, offset: 192)
!30 = !{!31, !32, !33}
!31 = !DIEnumerator(name: "_PyStatus_TYPE_OK", value: 0)
!32 = !DIEnumerator(name: "_PyStatus_TYPE_ERROR", value: 1)
!33 = !DIEnumerator(name: "_PyStatus_TYPE_EXIT", value: 2)
!34 = !{!35, !41, !45, !46, !373, !7, !25, !101, !375, !70, !386, !397, !421, !430, !125, !449, !450, !451, !454, !298, !319, !324, !455, !14, !81, !463, !467, !471, !472, !479, !494, !496, !503, !524, !526, !528, !27, !530, !540, !86, !556, !569}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !38, line: 34, baseType: !39)
!38 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_wchar_t.h", directory: "")
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wchar_t", file: !40, line: 82, baseType: !7)
!40 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/arm/_types.h", directory: "")
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !42, line: 31, baseType: !43)
!42 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !40, line: 70, baseType: !44)
!44 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !48, line: 18, baseType: !49)
!48 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pytypedefs.h", directory: "")
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !6, line: 110, size: 128, elements: !50)
!50 = !{!51, !69}
!51 = !DIDerivedType(tag: DW_TAG_member, scope: !49, file: !6, line: 122, baseType: !52, size: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !49, file: !6, line: 122, size: 64, elements: !53)
!53 = !{!54, !58}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt_full", scope: !52, file: !6, line: 124, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !56, line: 30, baseType: !57)
!56 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_int64_t.h", directory: "")
!57 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, scope: !52, file: !6, line: 125, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !52, file: !6, line: 125, size: 64, elements: !60)
!60 = !{!61, !64, !68}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !59, file: !6, line: 131, baseType: !62, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !63, line: 31, baseType: !14)
!63 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint32_t.h", directory: "")
!64 = !DIDerivedType(tag: DW_TAG_member, name: "ob_overflow", scope: !59, file: !6, line: 132, baseType: !65, size: 16, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !66, line: 31, baseType: !67)
!66 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint16_t.h", directory: "")
!67 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ob_flags", scope: !59, file: !6, line: 133, baseType: !65, size: 16, offset: 48)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !49, file: !6, line: 144, baseType: !70, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !48, line: 20, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !73, line: 148, size: 3328, elements: !74)
!73 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/object.h", directory: "")
!74 = !{!75, !87, !88, !89, !90, !95, !96, !102, !107, !126, !128, !181, !212, !224, !230, !231, !232, !234, !236, !268, !269, !270, !279, !280, !285, !286, !288, !290, !301, !312, !330, !331, !332, !334, !336, !337, !339, !344, !349, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !370, !372}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !72, file: !73, line: 149, baseType: !76, size: 192)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !6, line: 172, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 169, size: 192, elements: !78)
!78 = !{!79, !80}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !77, file: !6, line: 170, baseType: !47, size: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !77, file: !6, line: 171, baseType: !81, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !82, line: 156, baseType: !83)
!82 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pyport.h", directory: "")
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !84, line: 31, baseType: !85)
!84 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_ssize_t.h", directory: "")
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ssize_t", file: !40, line: 97, baseType: !86)
!86 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !72, file: !73, line: 150, baseType: !25, size: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !72, file: !73, line: 151, baseType: !81, size: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !72, file: !73, line: 151, baseType: !81, size: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !72, file: !73, line: 155, baseType: !91, size: 64, offset: 384)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !6, line: 353, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !46}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall_offset", scope: !72, file: !73, line: 156, baseType: !81, size: 64, offset: 448)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !72, file: !73, line: 157, baseType: !97, size: 64, offset: 512)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !6, line: 354, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!46, !46, !101}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !72, file: !73, line: 158, baseType: !103, size: 64, offset: 576)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !6, line: 356, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!7, !46, !101, !46}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_async", scope: !72, file: !73, line: 159, baseType: !108, size: 64, offset: 640)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyAsyncMethods", file: !73, line: 135, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 130, size: 256, elements: !111)
!111 = !{!112, !117, !118, !119}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "am_await", scope: !110, file: !73, line: 131, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !6, line: 336, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!46, !46}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "am_aiter", scope: !110, file: !73, line: 132, baseType: !113, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "am_anext", scope: !110, file: !73, line: 133, baseType: !113, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "am_send", scope: !110, file: !73, line: 134, baseType: !120, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "sendfunc", file: !73, line: 128, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!124, !46, !46, !125}
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySendResult", file: !6, line: 699, baseType: !5)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !72, file: !73, line: 161, baseType: !127, size: 64, offset: 704)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !6, line: 358, baseType: !114)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !72, file: !73, line: 165, baseType: !129, size: 64, offset: 768)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !73, line: 106, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 61, size: 2304, elements: !132)
!132 = !{!133, !138, !139, !140, !141, !142, !147, !148, !149, !150, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !131, file: !73, line: 66, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !6, line: 337, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!46, !46, !46}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !131, file: !73, line: 67, baseType: !134, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !131, file: !73, line: 68, baseType: !134, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !131, file: !73, line: 69, baseType: !134, size: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !131, file: !73, line: 70, baseType: !134, size: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !131, file: !73, line: 71, baseType: !143, size: 64, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !6, line: 338, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!46, !46, !46, !46}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !131, file: !73, line: 72, baseType: !113, size: 64, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !131, file: !73, line: 73, baseType: !113, size: 64, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !131, file: !73, line: 74, baseType: !113, size: 64, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !131, file: !73, line: 75, baseType: !151, size: 64, offset: 576)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !6, line: 339, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!7, !46}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !131, file: !73, line: 76, baseType: !113, size: 64, offset: 640)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !131, file: !73, line: 77, baseType: !134, size: 64, offset: 704)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !131, file: !73, line: 78, baseType: !134, size: 64, offset: 768)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !131, file: !73, line: 79, baseType: !134, size: 64, offset: 832)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !131, file: !73, line: 80, baseType: !134, size: 64, offset: 896)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !131, file: !73, line: 81, baseType: !134, size: 64, offset: 960)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !131, file: !73, line: 82, baseType: !113, size: 64, offset: 1024)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !131, file: !73, line: 83, baseType: !45, size: 64, offset: 1088)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !131, file: !73, line: 84, baseType: !113, size: 64, offset: 1152)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !131, file: !73, line: 86, baseType: !134, size: 64, offset: 1216)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !131, file: !73, line: 87, baseType: !134, size: 64, offset: 1280)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !131, file: !73, line: 88, baseType: !134, size: 64, offset: 1344)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !131, file: !73, line: 89, baseType: !134, size: 64, offset: 1408)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !131, file: !73, line: 90, baseType: !143, size: 64, offset: 1472)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !131, file: !73, line: 91, baseType: !134, size: 64, offset: 1536)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !131, file: !73, line: 92, baseType: !134, size: 64, offset: 1600)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !131, file: !73, line: 93, baseType: !134, size: 64, offset: 1664)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !131, file: !73, line: 94, baseType: !134, size: 64, offset: 1728)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !131, file: !73, line: 95, baseType: !134, size: 64, offset: 1792)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !131, file: !73, line: 97, baseType: !134, size: 64, offset: 1856)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !131, file: !73, line: 98, baseType: !134, size: 64, offset: 1920)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !131, file: !73, line: 99, baseType: !134, size: 64, offset: 1984)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !131, file: !73, line: 100, baseType: !134, size: 64, offset: 2048)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !131, file: !73, line: 102, baseType: !113, size: 64, offset: 2112)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_matrix_multiply", scope: !131, file: !73, line: 104, baseType: !134, size: 64, offset: 2176)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_matrix_multiply", scope: !131, file: !73, line: 105, baseType: !134, size: 64, offset: 2240)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !72, file: !73, line: 166, baseType: !182, size: 64, offset: 832)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !73, line: 120, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 108, size: 640, elements: !185)
!185 = !{!186, !191, !192, !197, !198, !199, !204, !205, !210, !211}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !184, file: !73, line: 109, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !6, line: 340, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!81, !46}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !184, file: !73, line: 110, baseType: !134, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !184, file: !73, line: 111, baseType: !193, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !6, line: 341, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!46, !46, !81}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !184, file: !73, line: 112, baseType: !193, size: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !184, file: !73, line: 113, baseType: !45, size: 64, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !184, file: !73, line: 114, baseType: !200, size: 64, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !6, line: 343, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!7, !46, !81, !46}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !184, file: !73, line: 115, baseType: !45, size: 64, offset: 384)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !184, file: !73, line: 116, baseType: !206, size: 64, offset: 448)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !6, line: 347, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!7, !46, !46}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !184, file: !73, line: 118, baseType: !134, size: 64, offset: 512)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !184, file: !73, line: 119, baseType: !193, size: 64, offset: 576)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !72, file: !73, line: 167, baseType: !213, size: 64, offset: 896)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !73, line: 126, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 122, size: 192, elements: !216)
!216 = !{!217, !218, !219}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !215, file: !73, line: 123, baseType: !187, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !215, file: !73, line: 124, baseType: !134, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !215, file: !73, line: 125, baseType: !220, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !6, line: 345, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!7, !46, !46, !46}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !72, file: !73, line: 171, baseType: !225, size: 64, offset: 960)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !6, line: 359, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!229, !46}
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !82, line: 170, baseType: !81)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !72, file: !73, line: 172, baseType: !143, size: 64, offset: 1024)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !72, file: !73, line: 173, baseType: !127, size: 64, offset: 1088)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !72, file: !73, line: 174, baseType: !233, size: 64, offset: 1152)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !6, line: 355, baseType: !135)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !72, file: !73, line: 175, baseType: !235, size: 64, offset: 1216)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !6, line: 357, baseType: !221)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !72, file: !73, line: 178, baseType: !237, size: 64, offset: 1280)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !73, line: 140, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 137, size: 128, elements: !240)
!240 = !{!241, !263}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !239, file: !73, line: 138, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !243, line: 35, baseType: !244)
!243 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pybuffer.h", directory: "")
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!7, !46, !247, !7}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !243, line: 33, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !243, line: 20, size: 640, elements: !250)
!250 = !{!251, !252, !253, !254, !255, !256, !257, !258, !260, !261, !262}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !249, file: !243, line: 21, baseType: !45, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !249, file: !243, line: 22, baseType: !46, size: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !249, file: !243, line: 23, baseType: !81, size: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !249, file: !243, line: 24, baseType: !81, size: 64, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !249, file: !243, line: 26, baseType: !7, size: 32, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !249, file: !243, line: 27, baseType: !7, size: 32, offset: 288)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !249, file: !243, line: 28, baseType: !101, size: 64, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !249, file: !243, line: 29, baseType: !259, size: 64, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !249, file: !243, line: 30, baseType: !259, size: 64, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !249, file: !243, line: 31, baseType: !259, size: 64, offset: 512)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !249, file: !243, line: 32, baseType: !45, size: 64, offset: 576)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !239, file: !73, line: 139, baseType: !264, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !243, line: 36, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !46, !247}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !72, file: !73, line: 181, baseType: !44, size: 64, offset: 1344)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !72, file: !73, line: 183, baseType: !25, size: 64, offset: 1408)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !72, file: !73, line: 187, baseType: !271, size: 64, offset: 1472)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !6, line: 349, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!7, !46, !275, !45}
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !6, line: 348, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!7, !46, !45}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !72, file: !73, line: 190, baseType: !151, size: 64, offset: 1536)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !72, file: !73, line: 194, baseType: !281, size: 64, offset: 1600)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !6, line: 360, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!46, !46, !46, !7}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !72, file: !73, line: 197, baseType: !81, size: 64, offset: 1664)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !72, file: !73, line: 200, baseType: !287, size: 64, offset: 1728)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !6, line: 361, baseType: !114)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !72, file: !73, line: 201, baseType: !289, size: 64, offset: 1792)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !6, line: 362, baseType: !114)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !72, file: !73, line: 204, baseType: !291, size: 64, offset: 1856)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !48, line: 14, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !294, line: 68, size: 256, elements: !295)
!294 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/methodobject.h", directory: "")
!295 = !{!296, !297, !299, !300}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !293, file: !294, line: 69, baseType: !25, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !293, file: !294, line: 70, baseType: !298, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !294, line: 19, baseType: !135)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !293, file: !294, line: 71, baseType: !7, size: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !293, file: !294, line: 73, baseType: !25, size: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !72, file: !73, line: 205, baseType: !302, size: 64, offset: 1920)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !48, line: 16, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !305, line: 41, size: 320, elements: !306)
!305 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/descrobject.h", directory: "")
!306 = !{!307, !308, !309, !310, !311}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !304, file: !305, line: 42, baseType: !25, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !304, file: !305, line: 43, baseType: !7, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !304, file: !305, line: 44, baseType: !81, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !304, file: !305, line: 45, baseType: !7, size: 32, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !304, file: !305, line: 46, baseType: !25, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !72, file: !73, line: 206, baseType: !313, size: 64, offset: 1984)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGetSetDef", file: !48, line: 15, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !305, line: 11, size: 320, elements: !316)
!316 = !{!317, !318, !323, !328, !329}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !315, file: !305, line: 12, baseType: !25, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !315, file: !305, line: 13, baseType: !319, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !305, line: 8, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!46, !46, !45}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !315, file: !305, line: 14, baseType: !324, size: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !305, line: 9, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!7, !46, !46, !45}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !315, file: !305, line: 15, baseType: !25, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !315, file: !305, line: 16, baseType: !45, size: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !72, file: !73, line: 208, baseType: !70, size: 64, offset: 2048)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !72, file: !73, line: 209, baseType: !46, size: 64, offset: 2112)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !72, file: !73, line: 210, baseType: !333, size: 64, offset: 2176)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !6, line: 363, baseType: !144)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !72, file: !73, line: 211, baseType: !335, size: 64, offset: 2240)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !6, line: 364, baseType: !221)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !72, file: !73, line: 212, baseType: !81, size: 64, offset: 2304)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !72, file: !73, line: 213, baseType: !338, size: 64, offset: 2368)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !6, line: 365, baseType: !221)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !72, file: !73, line: 214, baseType: !340, size: 64, offset: 2432)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !6, line: 367, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!46, !70, !81}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !72, file: !73, line: 215, baseType: !345, size: 64, offset: 2496)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !6, line: 366, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!46, !70, !46, !46}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !72, file: !73, line: 216, baseType: !350, size: 64, offset: 2560)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !6, line: 352, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !45}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !72, file: !73, line: 217, baseType: !151, size: 64, offset: 2624)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !72, file: !73, line: 218, baseType: !46, size: 64, offset: 2688)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !72, file: !73, line: 219, baseType: !46, size: 64, offset: 2752)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !72, file: !73, line: 220, baseType: !46, size: 64, offset: 2816)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !72, file: !73, line: 221, baseType: !45, size: 64, offset: 2880)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !72, file: !73, line: 222, baseType: !46, size: 64, offset: 2944)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !72, file: !73, line: 223, baseType: !91, size: 64, offset: 3008)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !72, file: !73, line: 228, baseType: !14, size: 32, offset: 3072)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !72, file: !73, line: 230, baseType: !91, size: 64, offset: 3136)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall", scope: !72, file: !73, line: 231, baseType: !364, size: 64, offset: 3200)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "vectorcallfunc", file: !6, line: 370, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!46, !46, !368, !41, !46}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tp_watched", scope: !72, file: !73, line: 234, baseType: !371, size: 8, offset: 3264)
!371 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tp_versions_used", scope: !72, file: !73, line: 241, baseType: !65, size: 16, offset: 3280)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !374, line: 30, baseType: !7)
!374 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_int32_t.h", directory: "")
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !377, line: 15, baseType: !378)
!377 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/bytesobject.h", directory: "")
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !377, line: 5, size: 320, elements: !379)
!379 = !{!380, !381, !382}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !378, file: !377, line: 6, baseType: !76, size: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !378, file: !377, line: 7, baseType: !229, size: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !378, file: !377, line: 8, baseType: !383, size: 8, offset: 256)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 1)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunctionObject", file: !388, line: 14, baseType: !389)
!388 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/methodobject.h", directory: "")
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !388, line: 7, size: 448, elements: !390)
!390 = !{!391, !392, !393, !394, !395, !396}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !389, file: !388, line: 8, baseType: !47, size: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "m_ml", scope: !389, file: !388, line: 9, baseType: !291, size: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "m_self", scope: !389, file: !388, line: 10, baseType: !46, size: 64, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "m_module", scope: !389, file: !388, line: 11, baseType: !46, size: 64, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "m_weakreflist", scope: !389, file: !388, line: 12, baseType: !46, size: 64, offset: 320)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "vectorcall", scope: !389, file: !388, line: 13, baseType: !364, size: 64, offset: 384)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pyx_CyFunctionObject", file: !399, line: 2148, baseType: !400)
!399 = !DIFile(filename: "dataset/cases/goeq-oja-0130/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c", directory: ".")
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 2114, size: 1344, elements: !401)
!401 = !{!402, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !400, file: !399, line: 2121, baseType: !403, size: 512)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCMethodObject", file: !388, line: 26, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !388, line: 23, size: 512, elements: !405)
!405 = !{!406, !407}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !404, file: !388, line: 24, baseType: !387, size: 448)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "mm_class", scope: !404, file: !388, line: 25, baseType: !70, size: 64, offset: 448)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "func_name", scope: !400, file: !399, line: 2132, baseType: !46, size: 64, offset: 512)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "func_qualname", scope: !400, file: !399, line: 2133, baseType: !46, size: 64, offset: 576)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "func_doc", scope: !400, file: !399, line: 2134, baseType: !46, size: 64, offset: 640)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "func_globals", scope: !400, file: !399, line: 2135, baseType: !46, size: 64, offset: 704)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "func_code", scope: !400, file: !399, line: 2136, baseType: !46, size: 64, offset: 768)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "func_closure", scope: !400, file: !399, line: 2137, baseType: !46, size: 64, offset: 832)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !400, file: !399, line: 2141, baseType: !46, size: 64, offset: 896)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !400, file: !399, line: 2142, baseType: !7, size: 32, offset: 960)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "defaults_tuple", scope: !400, file: !399, line: 2143, baseType: !46, size: 64, offset: 1024)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "defaults_kwdict", scope: !400, file: !399, line: 2144, baseType: !46, size: 64, offset: 1088)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "defaults_getter", scope: !400, file: !399, line: 2145, baseType: !114, size: 64, offset: 1152)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "func_annotations", scope: !400, file: !399, line: 2146, baseType: !46, size: 64, offset: 1216)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "func_is_coroutine", scope: !400, file: !399, line: 2147, baseType: !46, size: 64, offset: 1280)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !423, line: 13, baseType: !424)
!423 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/tupleobject.h", directory: "")
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !423, line: 5, size: 320, elements: !425)
!425 = !{!426, !427, !428}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !424, file: !423, line: 6, baseType: !76, size: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ob_hash", scope: !424, file: !423, line: 8, baseType: !229, size: 64, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !424, file: !423, line: 12, baseType: !429, size: 64, offset: 256)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 64, elements: !384)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictObject", file: !432, line: 33, baseType: !433)
!432 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/dictobject.h", directory: "")
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !432, line: 11, size: 384, elements: !434)
!434 = !{!435, !436, !437, !441, !445}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !433, file: !432, line: 12, baseType: !47, size: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ma_used", scope: !433, file: !432, line: 15, baseType: !81, size: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_ma_watcher_tag", scope: !433, file: !432, line: 23, baseType: !438, size: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !439, line: 31, baseType: !440)
!439 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint64_t.h", directory: "")
!440 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ma_keys", scope: !433, file: !432, line: 25, baseType: !442, size: 64, offset: 256)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictKeysObject", file: !432, line: 5, baseType: !444)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "_dictkeysobject", file: !73, line: 280, flags: DIFlagFwdDecl)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ma_values", scope: !433, file: !432, line: 32, baseType: !446, size: 64, offset: 320)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictValues", file: !432, line: 6, baseType: !448)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "_dictvalues", file: !432, line: 6, flags: DIFlagFwdDecl)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunctionWithKeywords", file: !294, line: 21, baseType: !144)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{null}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !457, line: 22, baseType: !458)
!457 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/listobject.h", directory: "")
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !457, line: 5, size: 320, elements: !459)
!459 = !{!460, !461, !462}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !458, file: !457, line: 6, baseType: !76, size: 192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !458, file: !457, line: 8, baseType: !125, size: 64, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !458, file: !457, line: 21, baseType: !81, size: 64, offset: 256)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCMethod", file: !294, line: 26, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!46, !46, !70, !368, !81, !46}
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunctionFastWithKeywords", file: !294, line: 23, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!46, !46, !368, !81, !46}
!471 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFloatObject", file: !474, line: 8, baseType: !475)
!474 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/floatobject.h", directory: "")
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !474, line: 5, size: 192, elements: !476)
!476 = !{!477, !478}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !475, file: !474, line: 6, baseType: !47, size: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ob_fval", scope: !475, file: !474, line: 7, baseType: !471, size: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !13, line: 163, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 54, size: 320, elements: !482)
!482 = !{!483, !484, !485, !486}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !481, file: !13, line: 99, baseType: !47, size: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !481, file: !13, line: 100, baseType: !81, size: 64, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !481, file: !13, line: 101, baseType: !229, size: 64, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !481, file: !13, line: 162, baseType: !487, size: 32, offset: 256)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !481, file: !13, line: 107, size: 32, elements: !488)
!488 = !{!489, !490, !491, !492, !493}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !487, file: !13, line: 121, baseType: !14, size: 2, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !487, file: !13, line: 145, baseType: !14, size: 3, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !487, file: !13, line: 150, baseType: !14, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !487, file: !13, line: 154, baseType: !14, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "statically_allocated", scope: !487, file: !13, line: 156, baseType: !14, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !13, line: 173, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 168, size: 448, elements: !499)
!499 = !{!500, !501, !502}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !498, file: !13, line: 169, baseType: !480, size: 320)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !498, file: !13, line: 170, baseType: !81, size: 64, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !498, file: !13, line: 172, baseType: !101, size: 64, offset: 384)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !13, line: 184, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 176, size: 512, elements: !506)
!506 = !{!507, !508}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !505, file: !13, line: 177, baseType: !497, size: 448)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !505, file: !13, line: 183, baseType: !509, size: 64, offset: 448)
!509 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !505, file: !13, line: 178, size: 64, elements: !510)
!510 = !{!511, !512, !518, !521}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !509, file: !13, line: 179, baseType: !45, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !509, file: !13, line: 180, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !515, line: 96, baseType: !516)
!515 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/unicodeobject.h", directory: "")
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !517, line: 31, baseType: !371)
!517 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint8_t.h", directory: "")
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !509, file: !13, line: 181, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !515, line: 95, baseType: !65)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !509, file: !13, line: 182, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !515, line: 94, baseType: !62)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !514)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !520)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !523)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyByteArrayObject", file: !532, line: 12, baseType: !533)
!532 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/bytearrayobject.h", directory: "")
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !532, line: 6, size: 448, elements: !534)
!534 = !{!535, !536, !537, !538, !539}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !533, file: !532, line: 7, baseType: !76, size: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ob_alloc", scope: !533, file: !532, line: 8, baseType: !81, size: 64, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ob_bytes", scope: !533, file: !532, line: 9, baseType: !101, size: 64, offset: 256)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ob_start", scope: !533, file: !532, line: 10, baseType: !101, size: 64, offset: 320)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ob_exports", scope: !533, file: !532, line: 11, baseType: !81, size: 64, offset: 384)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyLongObject", file: !48, line: 19, baseType: !542)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_longobject", file: !543, line: 98, size: 256, elements: !544)
!543 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/longintrepr.h", directory: "")
!544 = !{!545, !546}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !542, file: !543, line: 99, baseType: !47, size: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "long_value", scope: !542, file: !543, line: 100, baseType: !547, size: 128, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyLongValue", file: !543, line: 96, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PyLongValue", file: !543, line: 93, size: 128, elements: !549)
!549 = !{!550, !553}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "lv_tag", scope: !548, file: !543, line: 94, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !552, line: 34, baseType: !44)
!552 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ob_digit", scope: !548, file: !543, line: 95, baseType: !554, size: 32, offset: 64)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 32, elements: !384)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "digit", file: !543, line: 43, baseType: !62)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBaseExceptionObject", file: !558, line: 15, baseType: !559)
!558 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/pyerrors.h", directory: "")
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !558, line: 13, size: 576, elements: !560)
!560 = !{!561, !562, !563, !564, !565, !566, !567, !568}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !559, file: !558, line: 14, baseType: !47, size: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !559, file: !558, line: 14, baseType: !46, size: 64, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !559, file: !558, line: 14, baseType: !46, size: 64, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !559, file: !558, line: 14, baseType: !46, size: 64, offset: 256)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", scope: !559, file: !558, line: 14, baseType: !46, size: 64, offset: 320)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !559, file: !558, line: 14, baseType: !46, size: 64, offset: 384)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "cause", scope: !559, file: !558, line: 14, baseType: !46, size: 64, offset: 448)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_context", scope: !559, file: !558, line: 14, baseType: !27, size: 8, offset: 512)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CodeObjectCacheEntry", file: !399, line: 2206, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 2203, size: 128, elements: !572)
!572 = !{!573, !631}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "code_object", scope: !571, file: !399, line: 2204, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CachedCodeObjectType", file: !399, line: 2201, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !48, line: 21, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyCodeObject", file: !578, line: 115, size: 1728, elements: !579)
!578 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/code.h", directory: "")
!579 = !{!580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !614, !623, !624, !627, !628, !629, !630}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !577, file: !578, line: 115, baseType: !76, size: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !577, file: !578, line: 115, baseType: !46, size: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !577, file: !578, line: 115, baseType: !46, size: 64, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "co_exceptiontable", scope: !577, file: !578, line: 115, baseType: !46, size: 64, offset: 320)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !577, file: !578, line: 115, baseType: !7, size: 32, offset: 384)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !577, file: !578, line: 115, baseType: !7, size: 32, offset: 416)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "co_posonlyargcount", scope: !577, file: !578, line: 115, baseType: !7, size: 32, offset: 448)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !577, file: !578, line: 115, baseType: !7, size: 32, offset: 480)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !577, file: !578, line: 115, baseType: !7, size: 32, offset: 512)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !577, file: !578, line: 115, baseType: !7, size: 32, offset: 544)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocalsplus", scope: !577, file: !578, line: 115, baseType: !7, size: 32, offset: 576)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "co_framesize", scope: !577, file: !578, line: 115, baseType: !7, size: 32, offset: 608)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !577, file: !578, line: 115, baseType: !7, size: 32, offset: 640)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "co_ncellvars", scope: !577, file: !578, line: 115, baseType: !7, size: 32, offset: 672)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "co_nfreevars", scope: !577, file: !578, line: 115, baseType: !7, size: 32, offset: 704)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "co_version", scope: !577, file: !578, line: 115, baseType: !62, size: 32, offset: 736)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "co_localsplusnames", scope: !577, file: !578, line: 115, baseType: !46, size: 64, offset: 768)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "co_localspluskinds", scope: !577, file: !578, line: 115, baseType: !46, size: 64, offset: 832)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !577, file: !578, line: 115, baseType: !46, size: 64, offset: 896)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !577, file: !578, line: 115, baseType: !46, size: 64, offset: 960)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "co_qualname", scope: !577, file: !578, line: 115, baseType: !46, size: 64, offset: 1024)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "co_linetable", scope: !577, file: !578, line: 115, baseType: !46, size: 64, offset: 1088)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !577, file: !578, line: 115, baseType: !46, size: 64, offset: 1152)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "co_executors", scope: !577, file: !578, line: 115, baseType: !604, size: 64, offset: 1216)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyExecutorArray", file: !578, line: 22, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !578, line: 18, size: 128, elements: !607)
!607 = !{!608, !609, !610}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !606, file: !578, line: 19, baseType: !7, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !606, file: !578, line: 20, baseType: !7, size: 32, offset: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "executors", scope: !606, file: !578, line: 21, baseType: !611, size: 64, offset: 64)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 64, elements: !384)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyExecutorObject", file: !578, line: 21, flags: DIFlagFwdDecl)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_co_cached", scope: !577, file: !578, line: 115, baseType: !615, size: 64, offset: 1280)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyCoCached", file: !578, line: 16, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !578, line: 11, size: 256, elements: !618)
!618 = !{!619, !620, !621, !622}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_co_code", scope: !617, file: !578, line: 12, baseType: !46, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_co_varnames", scope: !617, file: !578, line: 13, baseType: !46, size: 64, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_co_cellvars", scope: !617, file: !578, line: 14, baseType: !46, size: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_co_freevars", scope: !617, file: !578, line: 15, baseType: !46, size: 64, offset: 192)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_co_instrumentation_version", scope: !577, file: !578, line: 115, baseType: !551, size: 64, offset: 1344)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_co_monitoring", scope: !577, file: !578, line: 115, baseType: !625, size: 64, offset: 1408)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyCoMonitoringData", file: !578, line: 115, flags: DIFlagFwdDecl)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_co_unique_id", scope: !577, file: !578, line: 115, baseType: !81, size: 64, offset: 1472)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_co_firsttraceable", scope: !577, file: !578, line: 115, baseType: !7, size: 32, offset: 1536)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "co_extra", scope: !577, file: !578, line: 115, baseType: !45, size: 64, offset: 1600)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "co_code_adaptive", scope: !577, file: !578, line: 115, baseType: !383, size: 8, offset: 1664)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "code_line", scope: !571, file: !399, line: 2205, baseType: !7, size: 32, offset: 64)
!632 = !{!0, !633, !638, !640, !645, !675, !678, !683, !688, !693, !698, !700, !702, !704, !709, !714, !716, !722, !727, !729, !734, !771, !773, !778, !783, !788, !790, !795, !799, !804, !806, !808, !813, !818, !823, !825, !827, !829, !834, !836, !838, !840, !845, !847, !850, !855, !860, !865, !867, !872, !877, !882, !898, !903, !905, !908, !913, !915, !918, !923, !925, !930, !935, !938, !940, !942, !947, !950, !952, !954, !956, !961, !966, !968, !973, !975, !977, !982, !985, !987, !989, !992, !994, !999, !1001, !1003, !1006, !1011, !1013, !1016, !1018, !1021, !1023, !1025, !1027, !1029, !1031, !1033, !1035, !1037, !1039, !1041, !1043, !1045, !1047, !1049, !1051, !1053, !1056, !1058, !1063, !1068, !1070, !1075, !1077, !1079, !1084, !1089, !1091, !1093, !1095, !1097, !1099, !1101, !1103, !1105, !1107, !1109, !1111, !1113, !1115, !1117, !1119, !1122, !1124, !1126, !1131, !1133, !1136, !1138, !1141, !1144, !1147, !1149, !1152, !1154, !1159, !1162, !1164, !1166, !1168, !1171, !1173, !1175, !1178, !1180, !1183, !1185, !1187, !1189, !1191, !1193, !1198, !1200, !1202}
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !399, line: 6448, type: !635, isLocal: true, isDefinition: true)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 128, elements: !636)
!636 = !{!637}
!637 = !DISubrange(count: 16)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !399, line: 6455, type: !383, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2773, type: !642, isLocal: true, isDefinition: true)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 72, elements: !643)
!643 = !{!644}
!644 = !DISubrange(count: 9)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "__pyx_moduledef", scope: !2, file: !399, line: 2769, type: !647, isLocal: true, isDefinition: true)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !648, line: 107, size: 832, elements: !649)
!648 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/moduleobject.h", directory: "")
!649 = !{!650, !661, !662, !663, !664, !665, !672, !673, !674}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !647, file: !648, line: 108, baseType: !651, size: 320)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !648, line: 58, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !648, line: 39, size: 320, elements: !653)
!653 = !{!654, !655, !659, !660}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !652, file: !648, line: 40, baseType: !47, size: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !652, file: !648, line: 47, baseType: !656, size: 64, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!46}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !652, file: !648, line: 52, baseType: !81, size: 64, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !652, file: !648, line: 57, baseType: !46, size: 64, offset: 256)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !647, file: !648, line: 109, baseType: !25, size: 64, offset: 320)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !647, file: !648, line: 110, baseType: !25, size: 64, offset: 384)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !647, file: !648, line: 111, baseType: !81, size: 64, offset: 448)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !647, file: !648, line: 112, baseType: !291, size: 64, offset: 512)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "m_slots", scope: !647, file: !648, line: 113, baseType: !666, size: 64, offset: 576)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Slot", file: !48, line: 13, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Slot", file: !648, line: 69, size: 128, elements: !669)
!669 = !{!670, !671}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !668, file: !648, line: 70, baseType: !7, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !668, file: !648, line: 71, baseType: !45, size: 64, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !647, file: !648, line: 114, baseType: !271, size: 64, offset: 640)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !647, file: !648, line: 115, baseType: !151, size: 64, offset: 704)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !647, file: !648, line: 116, baseType: !350, size: 64, offset: 768)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "__pyx_methods", scope: !2, file: !399, line: 2668, type: !677, isLocal: true, isDefinition: true)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 256, elements: !384)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "__pyx_moduledef_slots", scope: !2, file: !399, line: 2752, type: !680, isLocal: true, isDefinition: true)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 384, elements: !681)
!681 = !{!682}
!682 = !DISubrange(count: 3)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2901, type: !685, isLocal: true, isDefinition: true)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 40, elements: !686)
!686 = !{!687}
!687 = !DISubrange(count: 5)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2908, type: !690, isLocal: true, isDefinition: true)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 56, elements: !691)
!691 = !{!692}
!692 = !DISubrange(count: 7)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2908, type: !695, isLocal: true, isDefinition: true)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 88, elements: !696)
!696 = !{!697}
!697 = !DISubrange(count: 11)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2909, type: !690, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2909, type: !642, isLocal: true, isDefinition: true)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2910, type: !690, isLocal: true, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2910, type: !706, isLocal: true, isDefinition: true)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 96, elements: !707)
!707 = !{!708}
!708 = !DISubrange(count: 12)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2911, type: !711, isLocal: true, isDefinition: true)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 216, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 27)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2911, type: !642, isLocal: true, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "main_interpreter_id", scope: !718, file: !399, line: 2848, type: !55, isLocal: true, isDefinition: true)
!718 = distinct !DISubprogram(name: "__Pyx_check_single_interpreter", scope: !399, file: !399, line: 2847, type: !719, scopeLine: 2847, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !721)
!719 = !DISubroutineType(types: !720)
!720 = !{!7}
!721 = !{}
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2870, type: !724, isLocal: true, isDefinition: true)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 760, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 95)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "__pyx_m", scope: !2, file: !399, line: 1326, type: !46, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2940, type: !731, isLocal: true, isDefinition: true)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 648, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 81)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(name: "__pyx_mstate_global", scope: !2, file: !399, line: 2434, type: !736, isLocal: true, isDefinition: true)
!736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !737)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pyx_mstatetype", file: !399, line: 2413, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 2385, size: 3072, elements: !740)
!740 = !{!741, !742, !743, !744, !745, !746, !747, !756, !757, !758, !762, !763, !764, !765}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_d", scope: !739, file: !399, line: 2386, baseType: !46, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_b", scope: !739, file: !399, line: 2387, baseType: !46, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_cython_runtime", scope: !739, file: !399, line: 2388, baseType: !46, size: 64, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_tuple", scope: !739, file: !399, line: 2389, baseType: !46, size: 64, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_bytes", scope: !739, file: !399, line: 2390, baseType: !46, size: 64, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_unicode", scope: !739, file: !399, line: 2391, baseType: !46, size: 64, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_umethod_PyDict_Type_items", scope: !739, file: !399, line: 2392, baseType: !748, size: 320, offset: 384)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CachedCFunction", file: !399, line: 2045, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 2036, size: 320, elements: !750)
!750 = !{!751, !752, !753, !754, !755}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !749, file: !399, line: 2037, baseType: !46, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "method_name", scope: !749, file: !399, line: 2038, baseType: !125, size: 64, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !749, file: !399, line: 2042, baseType: !298, size: 64, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !749, file: !399, line: 2043, baseType: !46, size: 64, offset: 192)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !749, file: !399, line: 2044, baseType: !7, size: 32, offset: 256)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_umethod_PyDict_Type_values", scope: !739, file: !399, line: 2393, baseType: !748, size: 320, offset: 704)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_codeobj_tab", scope: !739, file: !399, line: 2394, baseType: !429, size: 64, offset: 1024)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_string_tab", scope: !739, file: !399, line: 2395, baseType: !759, size: 1664, offset: 1088)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 1664, elements: !760)
!760 = !{!761}
!761 = !DISubrange(count: 26)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_number_tab", scope: !739, file: !399, line: 2396, baseType: !429, size: 64, offset: 2752)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_CommonTypesMetaclassType", scope: !739, file: !399, line: 2399, baseType: !70, size: 64, offset: 2816)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_CyFunctionType", scope: !739, file: !399, line: 2407, baseType: !70, size: 64, offset: 2880)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_code_cache", scope: !739, file: !399, line: 2410, baseType: !766, size: 128, offset: 2944)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__Pyx_CodeObjectCache", file: !399, line: 2207, size: 128, elements: !767)
!767 = !{!768, !769, !770}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !766, file: !399, line: 2208, baseType: !7, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "max_count", scope: !766, file: !399, line: 2209, baseType: !7, size: 32, offset: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !766, file: !399, line: 2210, baseType: !569, size: 64, offset: 64)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2970, type: !642, isLocal: true, isDefinition: true)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2971, type: !775, isLocal: true, isDefinition: true)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 120, elements: !776)
!776 = !{!777}
!777 = !DISubrange(count: 15)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(scope: null, file: !399, line: 2972, type: !780, isLocal: true, isDefinition: true)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 104, elements: !781)
!781 = !{!782}
!782 = !DISubrange(count: 13)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(scope: null, file: !399, line: 3118, type: !785, isLocal: true, isDefinition: true)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 112, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 14)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(name: "__pyx_mstate_global_static", scope: !2, file: !399, line: 2428, type: !738, isLocal: true, isDefinition: true)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(scope: null, file: !399, line: 1336, type: !792, isLocal: true, isDefinition: true)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 432, elements: !793)
!793 = !{!794}
!794 = !DISubrange(count: 54)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "__pyx_f", scope: !2, file: !399, line: 1335, type: !797, isLocal: true, isDefinition: true)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 64, elements: !384)
!798 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(scope: null, file: !399, line: 7266, type: !801, isLocal: true, isDefinition: true)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 624, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 78)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(scope: null, file: !399, line: 7272, type: !775, isLocal: true, isDefinition: true)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(scope: null, file: !399, line: 7272, type: !775, isLocal: true, isDefinition: true)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(scope: null, file: !399, line: 3182, type: !810, isLocal: true, isDefinition: true)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1904, elements: !811)
!811 = !{!812}
!812 = !DISubrange(count: 238)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(scope: null, file: !399, line: 7423, type: !815, isLocal: true, isDefinition: true)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 136, elements: !816)
!816 = !{!817}
!817 = !DISubrange(count: 17)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(scope: null, file: !399, line: 7423, type: !820, isLocal: true, isDefinition: true)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 32, elements: !821)
!821 = !{!822}
!822 = !DISubrange(count: 4)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(scope: null, file: !399, line: 7423, type: !685, isLocal: true, isDefinition: true)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(scope: null, file: !399, line: 7424, type: !695, isLocal: true, isDefinition: true)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(scope: null, file: !399, line: 7428, type: !820, isLocal: true, isDefinition: true)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(scope: null, file: !399, line: 7475, type: !831, isLocal: true, isDefinition: true)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1224, elements: !832)
!832 = !{!833}
!833 = !DISubrange(count: 153)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(name: "__pyx_filename", scope: !2, file: !399, line: 1331, type: !25, isLocal: true, isDefinition: true)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(name: "__pyx_lineno", scope: !2, file: !399, line: 1328, type: !7, isLocal: true, isDefinition: true)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "__pyx_clineno", scope: !2, file: !399, line: 1329, type: !7, isLocal: true, isDefinition: true)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(scope: null, file: !377, line: 25, type: !842, isLocal: true, isDefinition: true)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 144, elements: !843)
!843 = !{!844}
!844 = !DISubrange(count: 18)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(scope: null, file: !377, line: 25, type: !785, isLocal: true, isDefinition: true)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(scope: null, file: !377, line: 25, type: !849, isLocal: true, isDefinition: true)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 144, elements: !843)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !399, line: 4675, type: !852, isLocal: true, isDefinition: true)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 240, elements: !853)
!853 = !{!854}
!854 = !DISubrange(count: 30)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(scope: null, file: !399, line: 4675, type: !857, isLocal: true, isDefinition: true)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 80, elements: !858)
!858 = !{!859}
!859 = !DISubrange(count: 10)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(scope: null, file: !399, line: 4675, type: !862, isLocal: true, isDefinition: true)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 392, elements: !863)
!863 = !{!864}
!864 = !DISubrange(count: 49)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(scope: null, file: !399, line: 4575, type: !785, isLocal: true, isDefinition: true)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(scope: null, file: !399, line: 4603, type: !869, isLocal: true, isDefinition: true)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 376, elements: !870)
!870 = !{!871}
!871 = !DISubrange(count: 47)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(scope: null, file: !399, line: 4622, type: !874, isLocal: true, isDefinition: true)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 496, elements: !875)
!875 = !{!876}
!876 = !DISubrange(count: 62)
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(scope: null, file: !399, line: 4711, type: !879, isLocal: true, isDefinition: true)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 296, elements: !880)
!880 = !{!881}
!881 = !DISubrange(count: 37)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(name: "__pyx_CommonTypesMetaclass_spec", scope: !2, file: !399, line: 4710, type: !884, isLocal: true, isDefinition: true)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyType_Spec", file: !6, line: 385, baseType: !885)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 379, size: 256, elements: !886)
!886 = !{!887, !888, !889, !890, !891}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !885, file: !6, line: 380, baseType: !25, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "basicsize", scope: !885, file: !6, line: 381, baseType: !7, size: 32, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !885, file: !6, line: 382, baseType: !7, size: 32, offset: 96)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !885, file: !6, line: 383, baseType: !14, size: 32, offset: 128)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !885, file: !6, line: 384, baseType: !892, size: 64, offset: 192)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyType_Slot", file: !6, line: 377, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 374, size: 128, elements: !895)
!895 = !{!896, !897}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !894, file: !6, line: 375, baseType: !7, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "pfunc", scope: !894, file: !6, line: 376, baseType: !45, size: 64, offset: 64)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "__pyx_CommonTypesMetaclass_slots", scope: !2, file: !399, line: 4701, type: !900, isLocal: true, isDefinition: true)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !893, size: 256, elements: !901)
!901 = !{!902}
!902 = !DISubrange(count: 2)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(scope: null, file: !399, line: 4698, type: !695, isLocal: true, isDefinition: true)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(name: "__pyx_CommonTypesMetaclass_getset", scope: !2, file: !399, line: 4697, type: !907, isLocal: true, isDefinition: true)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 640, elements: !901)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(scope: null, file: !399, line: 6016, type: !910, isLocal: true, isDefinition: true)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 320, elements: !911)
!911 = !{!912}
!912 = !DISubrange(count: 40)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(name: "__pyx_CyFunctionType_spec", scope: !2, file: !399, line: 6015, type: !884, isLocal: true, isDefinition: true)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(name: "__pyx_CyFunctionType_slots", scope: !2, file: !399, line: 6003, type: !917, isLocal: true, isDefinition: true)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !893, size: 1280, elements: !858)
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5716, type: !920, isLocal: true, isDefinition: true)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 176, elements: !921)
!921 = !{!922}
!922 = !DISubrange(count: 22)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5812, type: !852, isLocal: true, isDefinition: true)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5812, type: !927, isLocal: true, isDefinition: true)
!927 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 160, elements: !928)
!928 = !{!929}
!929 = !DISubrange(count: 20)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5836, type: !932, isLocal: true, isDefinition: true)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 336, elements: !933)
!933 = !{!934}
!934 = !DISubrange(count: 42)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(scope: null, file: !432, line: 55, type: !937, isLocal: true, isDefinition: true)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 128, elements: !636)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(scope: null, file: !432, line: 55, type: !780, isLocal: true, isDefinition: true)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(scope: null, file: !432, line: 55, type: !815, isLocal: true, isDefinition: true)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5023, type: !944, isLocal: true, isDefinition: true)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 200, elements: !945)
!945 = !{!946}
!946 = !DISubrange(count: 25)
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(scope: null, file: !423, line: 34, type: !949, isLocal: true, isDefinition: true)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 136, elements: !816)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !423, line: 34, type: !785, isLocal: true, isDefinition: true)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(scope: null, file: !423, line: 34, type: !849, isLocal: true, isDefinition: true)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(scope: null, file: !423, line: 35, type: !695, isLocal: true, isDefinition: true)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(scope: null, file: !423, line: 36, type: !958, isLocal: true, isDefinition: true)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 184, elements: !959)
!959 = !{!960}
!960 = !DISubrange(count: 23)
!961 = !DIGlobalVariableExpression(var: !962, expr: !DIExpression())
!962 = distinct !DIGlobalVariable(scope: null, file: !6, line: 284, type: !963, isLocal: true, isDefinition: true)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 64, elements: !964)
!964 = !{!965}
!965 = !DISubrange(count: 8)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(scope: null, file: !6, line: 284, type: !642, isLocal: true, isDefinition: true)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(scope: null, file: !6, line: 284, type: !970, isLocal: true, isDefinition: true)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 224, elements: !971)
!971 = !{!972}
!972 = !DISubrange(count: 28)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(scope: null, file: !6, line: 285, type: !970, isLocal: true, isDefinition: true)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(scope: null, file: !423, line: 24, type: !949, isLocal: true, isDefinition: true)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5755, type: !979, isLocal: true, isDefinition: true)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 152, elements: !980)
!980 = !{!981}
!981 = !DISubrange(count: 19)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5770, type: !984, isLocal: true, isDefinition: true)
!984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 224, elements: !971)
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5770, type: !979, isLocal: true, isDefinition: true)
!987 = !DIGlobalVariableExpression(var: !988, expr: !DIExpression())
!988 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5782, type: !711, isLocal: true, isDefinition: true)
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5787, type: !991, isLocal: true, isDefinition: true)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 240, elements: !853)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5791, type: !711, isLocal: true, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5449, type: !996, isLocal: true, isDefinition: true)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 192, elements: !997)
!997 = !{!998}
!998 = !DISubrange(count: 24)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5464, type: !706, isLocal: true, isDefinition: true)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5542, type: !695, isLocal: true, isDefinition: true)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(name: "__pyx_CyFunction_methods", scope: !2, file: !399, line: 5541, type: !1005, isLocal: true, isDefinition: true)
!1005 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 512, elements: !901)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5520, type: !1008, isLocal: true, isDefinition: true)
!1008 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 168, elements: !1009)
!1009 = !{!1010}
!1010 = !DISubrange(count: 21)
!1011 = !DIGlobalVariableExpression(var: !1012, expr: !DIExpression())
!1012 = distinct !DIGlobalVariable(scope: null, file: !399, line: 5525, type: !979, isLocal: true, isDefinition: true)
!1013 = !DIGlobalVariableExpression(var: !1014, expr: !DIExpression())
