; ModuleID = 'dataset/cases/goeq-oja-0067/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c'
source_filename = "dataset/cases/goeq-oja-0067/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx14.0.0"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr }
%struct.PyModuleDef_Base = type { %struct._object, ptr, i64, ptr }
%struct._object = type { %union.anon, ptr }
%union.anon = type { i64 }
%struct.PyMethodDef = type { ptr, ptr, i32, ptr }
%struct._typeobject = type { %struct.PyVarObject, ptr, i64, i64, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, ptr, i8, i16 }
%struct.PyVarObject = type { %struct._object, i64 }
%struct.__Pyx_CodeObjectCache = type { i32, i32, ptr }
%struct.anon.1 = type { i8, [3 x i8] }
%struct.PyGetSetDef = type { ptr, ptr, ptr, ptr, ptr }
%struct._longobject = type { %struct._object, %struct._PyLongValue }
%struct._PyLongValue = type { i64, [1 x i32] }
%struct.PyStatus = type { i32, ptr, ptr, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__pyx_module_is_main_original", scope: !2, file: !382, line: 2123, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Homebrew clang version 20.1.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !28, globals: !686, splitDebugInlining: false, nameTableKind: Apple, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk", sdk: "MacOSX14.sdk")
!3 = !DIFile(filename: "dataset/cases/goeq-oja-0067/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c", directory: ".")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 695, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/object.h", directory: "")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "PYGEN_RETURN", value: 0)
!10 = !DIEnumerator(name: "PYGEN_ERROR", value: -1)
!11 = !DIEnumerator(name: "PYGEN_NEXT", value: 1)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !14, file: !13, line: 11, baseType: !23, size: 32, elements: !24)
!13 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/initconfig.h", directory: "")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 10, size: 256, elements: !15)
!15 = !{!16, !17, !21, !22}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_type", scope: !14, file: !13, line: 15, baseType: !12, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !14, file: !13, line: 16, baseType: !18, size: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "err_msg", scope: !14, file: !13, line: 17, baseType: !18, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "exitcode", scope: !14, file: !13, line: 18, baseType: !7, size: 32, offset: 192)
!23 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!24 = !{!25, !26, !27}
!25 = !DIEnumerator(name: "_PyStatus_TYPE_OK", value: 0)
!26 = !DIEnumerator(name: "_PyStatus_TYPE_ERROR", value: 1)
!27 = !DIEnumerator(name: "_PyStatus_TYPE_EXIT", value: 2)
!28 = !{!29, !35, !39, !40, !367, !7, !18, !95, !369, !64, !380, !520, !534, !542, !554, !555, !292, !313, !318, !565, !23, !75, !621, !629, !387, !640, !656, !80, !670, !671, !678}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !32, line: 34, baseType: !33)
!32 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_wchar_t.h", directory: "")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wchar_t", file: !34, line: 82, baseType: !7)
!34 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/arm/_types.h", directory: "")
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !36, line: 31, baseType: !37)
!36 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !34, line: 70, baseType: !38)
!38 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !42, line: 18, baseType: !43)
!42 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pytypedefs.h", directory: "")
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !6, line: 110, size: 128, elements: !44)
!44 = !{!45, !63}
!45 = !DIDerivedType(tag: DW_TAG_member, scope: !43, file: !6, line: 122, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !43, file: !6, line: 122, size: 64, elements: !47)
!47 = !{!48, !52}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt_full", scope: !46, file: !6, line: 124, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !50, line: 30, baseType: !51)
!50 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_int64_t.h", directory: "")
!51 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, scope: !46, file: !6, line: 125, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !46, file: !6, line: 125, size: 64, elements: !54)
!54 = !{!55, !58, !62}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !53, file: !6, line: 131, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !57, line: 31, baseType: !23)
!57 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint32_t.h", directory: "")
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ob_overflow", scope: !53, file: !6, line: 132, baseType: !59, size: 16, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !60, line: 31, baseType: !61)
!60 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint16_t.h", directory: "")
!61 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ob_flags", scope: !53, file: !6, line: 133, baseType: !59, size: 16, offset: 48)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !43, file: !6, line: 144, baseType: !64, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !42, line: 20, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !67, line: 148, size: 3328, elements: !68)
!67 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/object.h", directory: "")
!68 = !{!69, !81, !82, !83, !84, !89, !90, !96, !101, !120, !122, !175, !206, !218, !224, !225, !226, !228, !230, !262, !263, !264, !273, !274, !279, !280, !282, !284, !295, !306, !324, !325, !326, !328, !330, !331, !333, !338, !343, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !364, !366}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !66, file: !67, line: 149, baseType: !70, size: 192)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !6, line: 172, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 169, size: 192, elements: !72)
!72 = !{!73, !74}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !71, file: !6, line: 170, baseType: !41, size: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !71, file: !6, line: 171, baseType: !75, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !76, line: 156, baseType: !77)
!76 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pyport.h", directory: "")
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !78, line: 31, baseType: !79)
!78 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_ssize_t.h", directory: "")
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ssize_t", file: !34, line: 97, baseType: !80)
!80 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !66, file: !67, line: 150, baseType: !18, size: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !66, file: !67, line: 151, baseType: !75, size: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !66, file: !67, line: 151, baseType: !75, size: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !66, file: !67, line: 155, baseType: !85, size: 64, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !6, line: 353, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !40}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall_offset", scope: !66, file: !67, line: 156, baseType: !75, size: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !66, file: !67, line: 157, baseType: !91, size: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !6, line: 354, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!40, !40, !95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !66, file: !67, line: 158, baseType: !97, size: 64, offset: 576)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !6, line: 356, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!7, !40, !95, !40}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_async", scope: !66, file: !67, line: 159, baseType: !102, size: 64, offset: 640)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyAsyncMethods", file: !67, line: 135, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 130, size: 256, elements: !105)
!105 = !{!106, !111, !112, !113}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "am_await", scope: !104, file: !67, line: 131, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !6, line: 336, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!40, !40}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "am_aiter", scope: !104, file: !67, line: 132, baseType: !107, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "am_anext", scope: !104, file: !67, line: 133, baseType: !107, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "am_send", scope: !104, file: !67, line: 134, baseType: !114, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "sendfunc", file: !67, line: 128, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!118, !40, !40, !119}
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySendResult", file: !6, line: 699, baseType: !5)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !66, file: !67, line: 161, baseType: !121, size: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !6, line: 358, baseType: !108)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !66, file: !67, line: 165, baseType: !123, size: 64, offset: 768)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !67, line: 106, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 61, size: 2304, elements: !126)
!126 = !{!127, !132, !133, !134, !135, !136, !141, !142, !143, !144, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !125, file: !67, line: 66, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !6, line: 337, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!40, !40, !40}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !125, file: !67, line: 67, baseType: !128, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !125, file: !67, line: 68, baseType: !128, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !125, file: !67, line: 69, baseType: !128, size: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !125, file: !67, line: 70, baseType: !128, size: 64, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !125, file: !67, line: 71, baseType: !137, size: 64, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !6, line: 338, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!40, !40, !40, !40}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !125, file: !67, line: 72, baseType: !107, size: 64, offset: 384)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !125, file: !67, line: 73, baseType: !107, size: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !125, file: !67, line: 74, baseType: !107, size: 64, offset: 512)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !125, file: !67, line: 75, baseType: !145, size: 64, offset: 576)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !6, line: 339, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!7, !40}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !125, file: !67, line: 76, baseType: !107, size: 64, offset: 640)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !125, file: !67, line: 77, baseType: !128, size: 64, offset: 704)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !125, file: !67, line: 78, baseType: !128, size: 64, offset: 768)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !125, file: !67, line: 79, baseType: !128, size: 64, offset: 832)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !125, file: !67, line: 80, baseType: !128, size: 64, offset: 896)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !125, file: !67, line: 81, baseType: !128, size: 64, offset: 960)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !125, file: !67, line: 82, baseType: !107, size: 64, offset: 1024)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !125, file: !67, line: 83, baseType: !39, size: 64, offset: 1088)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !125, file: !67, line: 84, baseType: !107, size: 64, offset: 1152)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !125, file: !67, line: 86, baseType: !128, size: 64, offset: 1216)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !125, file: !67, line: 87, baseType: !128, size: 64, offset: 1280)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !125, file: !67, line: 88, baseType: !128, size: 64, offset: 1344)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !125, file: !67, line: 89, baseType: !128, size: 64, offset: 1408)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !125, file: !67, line: 90, baseType: !137, size: 64, offset: 1472)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !125, file: !67, line: 91, baseType: !128, size: 64, offset: 1536)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !125, file: !67, line: 92, baseType: !128, size: 64, offset: 1600)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !125, file: !67, line: 93, baseType: !128, size: 64, offset: 1664)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !125, file: !67, line: 94, baseType: !128, size: 64, offset: 1728)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !125, file: !67, line: 95, baseType: !128, size: 64, offset: 1792)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !125, file: !67, line: 97, baseType: !128, size: 64, offset: 1856)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !125, file: !67, line: 98, baseType: !128, size: 64, offset: 1920)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !125, file: !67, line: 99, baseType: !128, size: 64, offset: 1984)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !125, file: !67, line: 100, baseType: !128, size: 64, offset: 2048)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !125, file: !67, line: 102, baseType: !107, size: 64, offset: 2112)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_matrix_multiply", scope: !125, file: !67, line: 104, baseType: !128, size: 64, offset: 2176)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_matrix_multiply", scope: !125, file: !67, line: 105, baseType: !128, size: 64, offset: 2240)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !66, file: !67, line: 166, baseType: !176, size: 64, offset: 832)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !67, line: 120, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 108, size: 640, elements: !179)
!179 = !{!180, !185, !186, !191, !192, !193, !198, !199, !204, !205}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !178, file: !67, line: 109, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !6, line: 340, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!75, !40}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !178, file: !67, line: 110, baseType: !128, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !178, file: !67, line: 111, baseType: !187, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !6, line: 341, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!40, !40, !75}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !178, file: !67, line: 112, baseType: !187, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !178, file: !67, line: 113, baseType: !39, size: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !178, file: !67, line: 114, baseType: !194, size: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !6, line: 343, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!7, !40, !75, !40}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !178, file: !67, line: 115, baseType: !39, size: 64, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !178, file: !67, line: 116, baseType: !200, size: 64, offset: 448)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !6, line: 347, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!7, !40, !40}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !178, file: !67, line: 118, baseType: !128, size: 64, offset: 512)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !178, file: !67, line: 119, baseType: !187, size: 64, offset: 576)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !66, file: !67, line: 167, baseType: !207, size: 64, offset: 896)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !67, line: 126, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 122, size: 192, elements: !210)
!210 = !{!211, !212, !213}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !209, file: !67, line: 123, baseType: !181, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !209, file: !67, line: 124, baseType: !128, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !209, file: !67, line: 125, baseType: !214, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !6, line: 345, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!7, !40, !40, !40}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !66, file: !67, line: 171, baseType: !219, size: 64, offset: 960)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !6, line: 359, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!223, !40}
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !76, line: 170, baseType: !75)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !66, file: !67, line: 172, baseType: !137, size: 64, offset: 1024)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !66, file: !67, line: 173, baseType: !121, size: 64, offset: 1088)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !66, file: !67, line: 174, baseType: !227, size: 64, offset: 1152)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !6, line: 355, baseType: !129)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !66, file: !67, line: 175, baseType: !229, size: 64, offset: 1216)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !6, line: 357, baseType: !215)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !66, file: !67, line: 178, baseType: !231, size: 64, offset: 1280)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !67, line: 140, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 137, size: 128, elements: !234)
!234 = !{!235, !257}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !233, file: !67, line: 138, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !237, line: 35, baseType: !238)
!237 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pybuffer.h", directory: "")
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!7, !40, !241, !7}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !237, line: 33, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !237, line: 20, size: 640, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !254, !255, !256}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !243, file: !237, line: 21, baseType: !39, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !243, file: !237, line: 22, baseType: !40, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !243, file: !237, line: 23, baseType: !75, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !243, file: !237, line: 24, baseType: !75, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !243, file: !237, line: 26, baseType: !7, size: 32, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !243, file: !237, line: 27, baseType: !7, size: 32, offset: 288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !243, file: !237, line: 28, baseType: !95, size: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !243, file: !237, line: 29, baseType: !253, size: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !243, file: !237, line: 30, baseType: !253, size: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !243, file: !237, line: 31, baseType: !253, size: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !243, file: !237, line: 32, baseType: !39, size: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !233, file: !67, line: 139, baseType: !258, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !237, line: 36, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !40, !241}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !66, file: !67, line: 181, baseType: !38, size: 64, offset: 1344)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !66, file: !67, line: 183, baseType: !18, size: 64, offset: 1408)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !66, file: !67, line: 187, baseType: !265, size: 64, offset: 1472)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !6, line: 349, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!7, !40, !269, !39}
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !6, line: 348, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!7, !40, !39}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !66, file: !67, line: 190, baseType: !145, size: 64, offset: 1536)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !66, file: !67, line: 194, baseType: !275, size: 64, offset: 1600)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !6, line: 360, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!40, !40, !40, !7}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !66, file: !67, line: 197, baseType: !75, size: 64, offset: 1664)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !66, file: !67, line: 200, baseType: !281, size: 64, offset: 1728)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !6, line: 361, baseType: !108)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !66, file: !67, line: 201, baseType: !283, size: 64, offset: 1792)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !6, line: 362, baseType: !108)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !66, file: !67, line: 204, baseType: !285, size: 64, offset: 1856)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !42, line: 14, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 68, size: 256, elements: !289)
!288 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/methodobject.h", directory: "")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 69, baseType: !18, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 70, baseType: !292, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 19, baseType: !129)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 71, baseType: !7, size: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 73, baseType: !18, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !66, file: !67, line: 205, baseType: !296, size: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !42, line: 16, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !299, line: 41, size: 320, elements: !300)
!299 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/descrobject.h", directory: "")
!300 = !{!301, !302, !303, !304, !305}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !298, file: !299, line: 42, baseType: !18, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !298, file: !299, line: 43, baseType: !7, size: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !298, file: !299, line: 44, baseType: !75, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !298, file: !299, line: 45, baseType: !7, size: 32, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !298, file: !299, line: 46, baseType: !18, size: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !66, file: !67, line: 206, baseType: !307, size: 64, offset: 1984)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGetSetDef", file: !42, line: 15, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !299, line: 11, size: 320, elements: !310)
!310 = !{!311, !312, !317, !322, !323}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !309, file: !299, line: 12, baseType: !18, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !309, file: !299, line: 13, baseType: !313, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !299, line: 8, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!40, !40, !39}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !309, file: !299, line: 14, baseType: !318, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !299, line: 9, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!7, !40, !40, !39}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !309, file: !299, line: 15, baseType: !18, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !309, file: !299, line: 16, baseType: !39, size: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !66, file: !67, line: 208, baseType: !64, size: 64, offset: 2048)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !66, file: !67, line: 209, baseType: !40, size: 64, offset: 2112)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !66, file: !67, line: 210, baseType: !327, size: 64, offset: 2176)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !6, line: 363, baseType: !138)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !66, file: !67, line: 211, baseType: !329, size: 64, offset: 2240)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !6, line: 364, baseType: !215)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !66, file: !67, line: 212, baseType: !75, size: 64, offset: 2304)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !66, file: !67, line: 213, baseType: !332, size: 64, offset: 2368)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !6, line: 365, baseType: !215)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !66, file: !67, line: 214, baseType: !334, size: 64, offset: 2432)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !6, line: 367, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!40, !64, !75}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !66, file: !67, line: 215, baseType: !339, size: 64, offset: 2496)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !6, line: 366, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!40, !64, !40, !40}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !66, file: !67, line: 216, baseType: !344, size: 64, offset: 2560)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !6, line: 352, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !39}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !66, file: !67, line: 217, baseType: !145, size: 64, offset: 2624)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !66, file: !67, line: 218, baseType: !40, size: 64, offset: 2688)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !66, file: !67, line: 219, baseType: !40, size: 64, offset: 2752)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !66, file: !67, line: 220, baseType: !40, size: 64, offset: 2816)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !66, file: !67, line: 221, baseType: !39, size: 64, offset: 2880)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !66, file: !67, line: 222, baseType: !40, size: 64, offset: 2944)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !66, file: !67, line: 223, baseType: !85, size: 64, offset: 3008)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !66, file: !67, line: 228, baseType: !23, size: 32, offset: 3072)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !66, file: !67, line: 230, baseType: !85, size: 64, offset: 3136)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall", scope: !66, file: !67, line: 231, baseType: !358, size: 64, offset: 3200)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "vectorcallfunc", file: !6, line: 370, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!40, !40, !362, !35, !40}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tp_watched", scope: !66, file: !67, line: 234, baseType: !365, size: 8, offset: 3264)
!365 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tp_versions_used", scope: !66, file: !67, line: 241, baseType: !59, size: 16, offset: 3280)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !368, line: 30, baseType: !7)
!368 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_int32_t.h", directory: "")
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !371, line: 15, baseType: !372)
!371 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/bytesobject.h", directory: "")
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !371, line: 5, size: 320, elements: !373)
!373 = !{!374, !375, !376}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !372, file: !371, line: 6, baseType: !70, size: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !372, file: !371, line: 7, baseType: !223, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !372, file: !371, line: 8, baseType: !377, size: 8, offset: 256)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 1)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pyx_CoroutineObject", file: !382, line: 2011, baseType: !383)
!382 = !DIFile(filename: "dataset/cases/goeq-oja-0067/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c", directory: ".")
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pyx_CoroutineObject", file: !382, line: 1989, size: 960, elements: !384)
!384 = !{!385, !386, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !383, file: !382, line: 1990, baseType: !41, size: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !383, file: !382, line: 1991, baseType: !387, size: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pyx_coroutine_body_t", file: !382, line: 1979, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!40, !391, !392, !40}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !42, line: 24, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !395, line: 66, size: 6592, elements: !396)
!395 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/pystate.h", directory: "")
!396 = !{!397, !398, !399, !403, !406, !417, !418, !419, !420, !421, !422, !423, !424, !425, !429, !454, !455, !456, !457, !458, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !481, !482, !492, !493, !494, !495, !496, !497, !498, !499}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !394, file: !395, line: 69, baseType: !392, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !394, file: !395, line: 70, baseType: !392, size: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !394, file: !395, line: 71, baseType: !400, size: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !42, line: 25, baseType: !402)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !42, line: 25, flags: DIFlagFwdDecl)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "eval_breaker", scope: !394, file: !395, line: 76, baseType: !404, size: 64, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !405, line: 34, baseType: !38)
!405 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_status", scope: !394, file: !395, line: 101, baseType: !407, size: 32, offset: 256)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !394, file: !395, line: 78, size: 32, elements: !408)
!408 = !{!409, !410, !411, !412, !413, !414, !415, !416}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !407, file: !395, line: 83, baseType: !23, size: 1, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !407, file: !395, line: 86, baseType: !23, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "unbound", scope: !407, file: !395, line: 88, baseType: !23, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "bound_gilstate", scope: !407, file: !395, line: 90, baseType: !23, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !407, file: !395, line: 92, baseType: !23, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "finalizing", scope: !407, file: !395, line: 95, baseType: !23, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "cleared", scope: !407, file: !395, line: 96, baseType: !23, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "finalized", scope: !407, file: !395, line: 97, baseType: !23, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "holds_gil", scope: !394, file: !395, line: 113, baseType: !7, size: 32, offset: 288)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_whence", scope: !394, file: !395, line: 115, baseType: !7, size: 32, offset: 320)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !394, file: !395, line: 119, baseType: !7, size: 32, offset: 352)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "py_recursion_remaining", scope: !394, file: !395, line: 121, baseType: !7, size: 32, offset: 384)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "py_recursion_limit", scope: !394, file: !395, line: 122, baseType: !7, size: 32, offset: 416)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_headroom", scope: !394, file: !395, line: 123, baseType: !7, size: 32, offset: 448)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !394, file: !395, line: 128, baseType: !7, size: 32, offset: 480)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "what_event", scope: !394, file: !395, line: 129, baseType: !7, size: 32, offset: 512)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "current_frame", scope: !394, file: !395, line: 132, baseType: !426, size: 64, offset: 576)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyInterpreterFrame", file: !428, line: 25, flags: DIFlagFwdDecl)
!428 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/pyframe.h", directory: "")
!429 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !394, file: !395, line: 134, baseType: !430, size: 64, offset: 640)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !395, line: 14, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!7, !40, !434, !7, !40}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFrameObject", file: !42, line: 22, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !437, line: 18, size: 640, elements: !438)
!437 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/internal/pycore_frame.h", directory: "")
!438 = !{!439, !440, !441, !445, !446, !447, !448, !449, !450, !451, !452}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !436, file: !437, line: 19, baseType: !41, size: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "f_back", scope: !436, file: !437, line: 20, baseType: !434, size: 64, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "f_frame", scope: !436, file: !437, line: 21, baseType: !442, size: 64, offset: 192)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyInterpreterFrame", file: !444, line: 12, baseType: !427)
!444 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/internal/pycore_typedefs.h", directory: "")
!445 = !DIDerivedType(tag: DW_TAG_member, name: "f_trace", scope: !436, file: !437, line: 22, baseType: !40, size: 64, offset: 256)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "f_lineno", scope: !436, file: !437, line: 23, baseType: !7, size: 32, offset: 320)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "f_trace_lines", scope: !436, file: !437, line: 24, baseType: !20, size: 8, offset: 352)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "f_trace_opcodes", scope: !436, file: !437, line: 25, baseType: !20, size: 8, offset: 360)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "f_extra_locals", scope: !436, file: !437, line: 26, baseType: !40, size: 64, offset: 384)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "f_locals_cache", scope: !436, file: !437, line: 30, baseType: !40, size: 64, offset: 448)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "f_overwritten_fast_locals", scope: !436, file: !437, line: 36, baseType: !40, size: 64, offset: 512)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_f_frame_data", scope: !436, file: !437, line: 38, baseType: !453, size: 64, offset: 576)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 64, elements: !378)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !394, file: !395, line: 135, baseType: !430, size: 64, offset: 704)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !394, file: !395, line: 136, baseType: !40, size: 64, offset: 768)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !394, file: !395, line: 137, baseType: !40, size: 64, offset: 832)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "current_exception", scope: !394, file: !395, line: 140, baseType: !40, size: 64, offset: 896)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "exc_info", scope: !394, file: !395, line: 145, baseType: !459, size: 64, offset: 960)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyErr_StackItem", file: !395, line: 55, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_err_stackitem", file: !395, line: 37, size: 128, elements: !462)
!462 = !{!463, !464}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !461, file: !395, line: 51, baseType: !40, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "previous_item", scope: !461, file: !395, line: 53, baseType: !465, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !394, file: !395, line: 147, baseType: !40, size: 64, offset: 1024)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !394, file: !395, line: 149, baseType: !7, size: 32, offset: 1088)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !394, file: !395, line: 151, baseType: !40, size: 64, offset: 1152)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !394, file: !395, line: 152, baseType: !38, size: 64, offset: 1216)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "native_thread_id", scope: !394, file: !395, line: 158, baseType: !38, size: 64, offset: 1280)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "delete_later", scope: !394, file: !395, line: 160, baseType: !40, size: 64, offset: 1344)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "critical_section", scope: !394, file: !395, line: 167, baseType: !404, size: 64, offset: 1408)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "coroutine_origin_tracking_depth", scope: !394, file: !395, line: 169, baseType: !7, size: 32, offset: 1472)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "async_gen_firstiter", scope: !394, file: !395, line: 171, baseType: !40, size: 64, offset: 1536)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "async_gen_finalizer", scope: !394, file: !395, line: 172, baseType: !40, size: 64, offset: 1600)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !394, file: !395, line: 174, baseType: !40, size: 64, offset: 1664)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "context_ver", scope: !394, file: !395, line: 175, baseType: !478, size: 64, offset: 1728)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !479, line: 31, baseType: !480)
!479 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint64_t.h", directory: "")
!480 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !394, file: !395, line: 178, baseType: !478, size: 64, offset: 1792)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "datastack_chunk", scope: !394, file: !395, line: 180, baseType: !483, size: 64, offset: 1856)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyStackChunk", file: !395, line: 62, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stack_chunk", file: !395, line: 57, size: 256, elements: !486)
!486 = !{!487, !489, !490, !491}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !485, file: !395, line: 58, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !485, file: !395, line: 59, baseType: !35, size: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !485, file: !395, line: 60, baseType: !35, size: 64, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !485, file: !395, line: 61, baseType: !453, size: 64, offset: 192)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "datastack_top", scope: !394, file: !395, line: 181, baseType: !119, size: 64, offset: 1920)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "datastack_limit", scope: !394, file: !395, line: 182, baseType: !119, size: 64, offset: 1984)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "exc_state", scope: !394, file: !395, line: 197, baseType: !460, size: 128, offset: 2048)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "current_executor", scope: !394, file: !395, line: 199, baseType: !40, size: 64, offset: 2176)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "dict_global_version", scope: !394, file: !395, line: 201, baseType: !478, size: 64, offset: 2240)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "threading_local_key", scope: !394, file: !395, line: 204, baseType: !40, size: 64, offset: 2304)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "threading_local_sentinel", scope: !394, file: !395, line: 209, baseType: !40, size: 64, offset: 2368)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "remote_debugger_support", scope: !394, file: !395, line: 210, baseType: !500, size: 4128, offset: 2432)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyRemoteDebuggerSupport", file: !395, line: 35, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !395, line: 32, size: 4128, elements: !502)
!502 = !{!503, !504}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "debugger_pending_call", scope: !501, file: !395, line: 33, baseType: !367, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "debugger_script_path", scope: !501, file: !395, line: 34, baseType: !505, size: 4096, offset: 32)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 4096, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 512)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !383, file: !382, line: 1992, baseType: !40, size: 64, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "gi_exc_state", scope: !383, file: !382, line: 1993, baseType: !460, size: 128, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "classobj", scope: !383, file: !382, line: 1997, baseType: !40, size: 64, offset: 384)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "yieldfrom", scope: !383, file: !382, line: 1998, baseType: !40, size: 64, offset: 448)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "yieldfrom_am_send", scope: !383, file: !382, line: 1999, baseType: !114, size: 64, offset: 512)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "gi_name", scope: !383, file: !382, line: 2000, baseType: !40, size: 64, offset: 576)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "gi_qualname", scope: !383, file: !382, line: 2001, baseType: !40, size: 64, offset: 640)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "gi_modulename", scope: !383, file: !382, line: 2002, baseType: !40, size: 64, offset: 704)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "gi_code", scope: !383, file: !382, line: 2003, baseType: !40, size: 64, offset: 768)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "gi_frame", scope: !383, file: !382, line: 2004, baseType: !40, size: 64, offset: 832)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "resume_label", scope: !383, file: !382, line: 2009, baseType: !7, size: 32, offset: 896)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "is_running", scope: !383, file: !382, line: 2010, baseType: !20, size: 8, offset: 928)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyStopIterationObject", file: !522, line: 73, baseType: !523)
!522 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/pyerrors.h", directory: "")
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !522, line: 70, size: 640, elements: !524)
!524 = !{!525, !526, !527, !528, !529, !530, !531, !532, !533}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !523, file: !522, line: 71, baseType: !41, size: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !523, file: !522, line: 71, baseType: !40, size: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !523, file: !522, line: 71, baseType: !40, size: 64, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !523, file: !522, line: 71, baseType: !40, size: 64, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", scope: !523, file: !522, line: 71, baseType: !40, size: 64, offset: 320)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !523, file: !522, line: 71, baseType: !40, size: 64, offset: 384)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "cause", scope: !523, file: !522, line: 71, baseType: !40, size: 64, offset: 448)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_context", scope: !523, file: !522, line: 71, baseType: !20, size: 8, offset: 512)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !523, file: !522, line: 72, baseType: !40, size: 64, offset: 576)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !536, line: 13, baseType: !537)
!536 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/tupleobject.h", directory: "")
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !536, line: 5, size: 320, elements: !538)
!538 = !{!539, !540, !541}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !537, file: !536, line: 6, baseType: !70, size: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ob_hash", scope: !537, file: !536, line: 8, baseType: !223, size: 64, offset: 192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !537, file: !536, line: 12, baseType: !453, size: 64, offset: 256)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBaseExceptionObject", file: !522, line: 15, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !522, line: 13, size: 576, elements: !545)
!545 = !{!546, !547, !548, !549, !550, !551, !552, !553}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !544, file: !522, line: 14, baseType: !41, size: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !544, file: !522, line: 14, baseType: !40, size: 64, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !544, file: !522, line: 14, baseType: !40, size: 64, offset: 192)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !544, file: !522, line: 14, baseType: !40, size: 64, offset: 256)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", scope: !544, file: !522, line: 14, baseType: !40, size: 64, offset: 320)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !544, file: !522, line: 14, baseType: !40, size: 64, offset: 384)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "cause", scope: !544, file: !522, line: 14, baseType: !40, size: 64, offset: 448)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_context", scope: !544, file: !522, line: 14, baseType: !20, size: 8, offset: 512)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTracebackObject", file: !557, line: 5, baseType: !558)
!557 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/traceback.h", directory: "")
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_traceback", file: !557, line: 7, size: 320, elements: !559)
!559 = !{!560, !561, !562, !563, !564}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !558, file: !557, line: 8, baseType: !41, size: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "tb_next", scope: !558, file: !557, line: 9, baseType: !555, size: 64, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "tb_frame", scope: !558, file: !557, line: 10, baseType: !434, size: 64, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "tb_lasti", scope: !558, file: !557, line: 11, baseType: !7, size: 32, offset: 256)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "tb_lineno", scope: !558, file: !557, line: 12, baseType: !7, size: 32, offset: 288)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !42, line: 21, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyCodeObject", file: !568, line: 115, size: 1728, elements: !569)
!568 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/code.h", directory: "")
!569 = !{!570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !604, !613, !614, !617, !618, !619, !620}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !567, file: !568, line: 115, baseType: !70, size: 192)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !567, file: !568, line: 115, baseType: !40, size: 64, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !567, file: !568, line: 115, baseType: !40, size: 64, offset: 256)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "co_exceptiontable", scope: !567, file: !568, line: 115, baseType: !40, size: 64, offset: 320)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !567, file: !568, line: 115, baseType: !7, size: 32, offset: 384)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !567, file: !568, line: 115, baseType: !7, size: 32, offset: 416)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "co_posonlyargcount", scope: !567, file: !568, line: 115, baseType: !7, size: 32, offset: 448)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !567, file: !568, line: 115, baseType: !7, size: 32, offset: 480)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !567, file: !568, line: 115, baseType: !7, size: 32, offset: 512)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !567, file: !568, line: 115, baseType: !7, size: 32, offset: 544)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocalsplus", scope: !567, file: !568, line: 115, baseType: !7, size: 32, offset: 576)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "co_framesize", scope: !567, file: !568, line: 115, baseType: !7, size: 32, offset: 608)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !567, file: !568, line: 115, baseType: !7, size: 32, offset: 640)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "co_ncellvars", scope: !567, file: !568, line: 115, baseType: !7, size: 32, offset: 672)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "co_nfreevars", scope: !567, file: !568, line: 115, baseType: !7, size: 32, offset: 704)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "co_version", scope: !567, file: !568, line: 115, baseType: !56, size: 32, offset: 736)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "co_localsplusnames", scope: !567, file: !568, line: 115, baseType: !40, size: 64, offset: 768)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "co_localspluskinds", scope: !567, file: !568, line: 115, baseType: !40, size: 64, offset: 832)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !567, file: !568, line: 115, baseType: !40, size: 64, offset: 896)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !567, file: !568, line: 115, baseType: !40, size: 64, offset: 960)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "co_qualname", scope: !567, file: !568, line: 115, baseType: !40, size: 64, offset: 1024)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "co_linetable", scope: !567, file: !568, line: 115, baseType: !40, size: 64, offset: 1088)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !567, file: !568, line: 115, baseType: !40, size: 64, offset: 1152)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "co_executors", scope: !567, file: !568, line: 115, baseType: !594, size: 64, offset: 1216)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyExecutorArray", file: !568, line: 22, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !568, line: 18, size: 128, elements: !597)
!597 = !{!598, !599, !600}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !596, file: !568, line: 19, baseType: !7, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !596, file: !568, line: 20, baseType: !7, size: 32, offset: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "executors", scope: !596, file: !568, line: 21, baseType: !601, size: 64, offset: 64)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 64, elements: !378)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyExecutorObject", file: !568, line: 21, flags: DIFlagFwdDecl)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_co_cached", scope: !567, file: !568, line: 115, baseType: !605, size: 64, offset: 1280)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyCoCached", file: !568, line: 16, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !568, line: 11, size: 256, elements: !608)
!608 = !{!609, !610, !611, !612}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_co_code", scope: !607, file: !568, line: 12, baseType: !40, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_co_varnames", scope: !607, file: !568, line: 13, baseType: !40, size: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_co_cellvars", scope: !607, file: !568, line: 14, baseType: !40, size: 64, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_co_freevars", scope: !607, file: !568, line: 15, baseType: !40, size: 64, offset: 192)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_co_instrumentation_version", scope: !567, file: !568, line: 115, baseType: !404, size: 64, offset: 1344)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_co_monitoring", scope: !567, file: !568, line: 115, baseType: !615, size: 64, offset: 1408)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyCoMonitoringData", file: !568, line: 115, flags: DIFlagFwdDecl)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_co_unique_id", scope: !567, file: !568, line: 115, baseType: !75, size: 64, offset: 1472)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_co_firsttraceable", scope: !567, file: !568, line: 115, baseType: !7, size: 32, offset: 1536)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "co_extra", scope: !567, file: !568, line: 115, baseType: !39, size: 64, offset: 1600)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "co_code_adaptive", scope: !567, file: !568, line: 115, baseType: !377, size: 8, offset: 1664)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pyx_obj_8original___pyx_scope_struct__genexpr", file: !382, line: 1490, size: 384, elements: !623)
!623 = !{!624, !625, !626, !627, !628}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !622, file: !382, line: 1491, baseType: !41, size: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_genexpr_arg_0", scope: !622, file: !382, line: 1492, baseType: !40, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_v__", scope: !622, file: !382, line: 1493, baseType: !40, size: 64, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_t_0", scope: !622, file: !382, line: 1494, baseType: !40, size: 64, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_t_1", scope: !622, file: !382, line: 1495, baseType: !108, size: 64, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunctionObject", file: !631, line: 14, baseType: !632)
!631 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/methodobject.h", directory: "")
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !631, line: 7, size: 448, elements: !633)
!633 = !{!634, !635, !636, !637, !638, !639}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !632, file: !631, line: 8, baseType: !41, size: 128)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "m_ml", scope: !632, file: !631, line: 9, baseType: !285, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "m_self", scope: !632, file: !631, line: 10, baseType: !40, size: 64, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "m_module", scope: !632, file: !631, line: 11, baseType: !40, size: 64, offset: 256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "m_weakreflist", scope: !632, file: !631, line: 12, baseType: !40, size: 64, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "vectorcall", scope: !632, file: !631, line: 13, baseType: !358, size: 64, offset: 384)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !642, line: 163, baseType: !643)
!642 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/unicodeobject.h", directory: "")
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !642, line: 54, size: 320, elements: !644)
!644 = !{!645, !646, !647, !648}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !643, file: !642, line: 99, baseType: !41, size: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !643, file: !642, line: 100, baseType: !75, size: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !643, file: !642, line: 101, baseType: !223, size: 64, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !643, file: !642, line: 162, baseType: !649, size: 32, offset: 256)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !643, file: !642, line: 107, size: 32, elements: !650)
!650 = !{!651, !652, !653, !654, !655}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !649, file: !642, line: 121, baseType: !23, size: 2, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !649, file: !642, line: 145, baseType: !23, size: 3, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !649, file: !642, line: 150, baseType: !23, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !649, file: !642, line: 154, baseType: !23, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "statically_allocated", scope: !649, file: !642, line: 156, baseType: !23, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyLongObject", file: !42, line: 19, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_longobject", file: !659, line: 98, size: 256, elements: !660)
!659 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/longintrepr.h", directory: "")
!660 = !{!661, !662}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !658, file: !659, line: 99, baseType: !41, size: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "long_value", scope: !658, file: !659, line: 100, baseType: !663, size: 128, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyLongValue", file: !659, line: 96, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PyLongValue", file: !659, line: 93, size: 128, elements: !665)
!665 = !{!666, !667}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "lv_tag", scope: !664, file: !659, line: 94, baseType: !404, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ob_digit", scope: !664, file: !659, line: 95, baseType: !668, size: 32, offset: 64)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !669, size: 32, elements: !378)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "digit", file: !659, line: 43, baseType: !56)
!670 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFloatObject", file: !673, line: 8, baseType: !674)
!673 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/floatobject.h", directory: "")
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !673, line: 5, size: 192, elements: !675)
!675 = !{!676, !677}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !674, file: !673, line: 6, baseType: !41, size: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ob_fval", scope: !674, file: !673, line: 7, baseType: !670, size: 64, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CodeObjectCacheEntry", file: !382, line: 1818, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 1815, size: 128, elements: !681)
!681 = !{!682, !685}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "code_object", scope: !680, file: !382, line: 1816, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CachedCodeObjectType", file: !382, line: 1813, baseType: !566)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "code_line", scope: !680, file: !382, line: 1817, baseType: !7, size: 32, offset: 64)
!686 = !{!0, !687, !692, !694, !699, !729, !732, !737, !742, !747, !752, !754, !756, !758, !763, !768, !770, !776, !781, !783, !788, !822, !824, !829, !834, !839, !841, !846, !850, !855, !857, !859, !864, !869, !874, !876, !878, !880, !885, !887, !889, !891, !896, !898, !901, !906, !911, !916, !918, !923, !928, !933, !949, !954, !956, !959, !964, !966, !969, !972, !977, !982, !984, !989, !992, !994, !999, !1004, !1006, !1008, !1011, !1013, !1016, !1018, !1020, !1023, !1025, !1027, !1029, !1032, !1037, !1042, !1047, !1050, !1055, !1057, !1062, !1067, !1069, !1071, !1073, !1078, !1083, !1088, !1090, !1092, !1094, !1096, !1099, !1104, !1109, !1114, !1119, !1121, !1124, !1129, !1134, !1136, !1141, !1146, !1151, !1154, !1156, !1158, !1161, !1164, !1166, !1171, !1173, !1175, !1177, !1180, !1182, !1185, !1190, !1195, !1197, !1199, !1201, !1203, !1205, !1207, !1210, !1212, !1215, !1220, !1223, !1225, !1227, !1229, !1231, !1233, !1236, !1238, !1240, !1242, !1247, !1249, !1251, !1253, !1255, !1258, !1263, !1265, !1267, !1269, !1271, !1273, !1278}
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !382, line: 4845, type: !689, isLocal: true, isDefinition: true)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, elements: !690)
!690 = !{!691}
!691 = !DISubrange(count: 16)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !382, line: 4852, type: !377, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !382, line: 2755, type: !696, isLocal: true, isDefinition: true)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 72, elements: !697)
!697 = !{!698}
!698 = !DISubrange(count: 9)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "__pyx_moduledef", scope: !2, file: !382, line: 2751, type: !701, isLocal: true, isDefinition: true)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !702, line: 107, size: 832, elements: !703)
!702 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/moduleobject.h", directory: "")
!703 = !{!704, !715, !716, !717, !718, !719, !726, !727, !728}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !701, file: !702, line: 108, baseType: !705, size: 320)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !702, line: 58, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !702, line: 39, size: 320, elements: !707)
!707 = !{!708, !709, !713, !714}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !706, file: !702, line: 40, baseType: !41, size: 128)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !706, file: !702, line: 47, baseType: !710, size: 64, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!40}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !706, file: !702, line: 52, baseType: !75, size: 64, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !706, file: !702, line: 57, baseType: !40, size: 64, offset: 256)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !701, file: !702, line: 109, baseType: !18, size: 64, offset: 320)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !701, file: !702, line: 110, baseType: !18, size: 64, offset: 384)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !701, file: !702, line: 111, baseType: !75, size: 64, offset: 448)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !701, file: !702, line: 112, baseType: !285, size: 64, offset: 512)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "m_slots", scope: !701, file: !702, line: 113, baseType: !720, size: 64, offset: 576)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Slot", file: !42, line: 13, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Slot", file: !702, line: 69, size: 128, elements: !723)
!723 = !{!724, !725}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !722, file: !702, line: 70, baseType: !7, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !722, file: !702, line: 71, baseType: !39, size: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !701, file: !702, line: 114, baseType: !265, size: 64, offset: 640)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !701, file: !702, line: 115, baseType: !145, size: 64, offset: 704)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !701, file: !702, line: 116, baseType: !344, size: 64, offset: 768)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "__pyx_methods", scope: !2, file: !382, line: 2625, type: !731, isLocal: true, isDefinition: true)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 256, elements: !378)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "__pyx_moduledef_slots", scope: !2, file: !382, line: 2734, type: !734, isLocal: true, isDefinition: true)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !721, size: 384, elements: !735)
!735 = !{!736}
!736 = !DISubrange(count: 3)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !382, line: 2883, type: !739, isLocal: true, isDefinition: true)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 40, elements: !740)
!740 = !{!741}
!741 = !DISubrange(count: 5)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(scope: null, file: !382, line: 2890, type: !744, isLocal: true, isDefinition: true)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 56, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 7)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !382, line: 2890, type: !749, isLocal: true, isDefinition: true)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 88, elements: !750)
!750 = !{!751}
!751 = !DISubrange(count: 11)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !382, line: 2891, type: !744, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !382, line: 2891, type: !696, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !382, line: 2892, type: !744, isLocal: true, isDefinition: true)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !382, line: 2892, type: !760, isLocal: true, isDefinition: true)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 96, elements: !761)
!761 = !{!762}
!762 = !DISubrange(count: 12)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(scope: null, file: !382, line: 2893, type: !765, isLocal: true, isDefinition: true)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 216, elements: !766)
!766 = !{!767}
!767 = !DISubrange(count: 27)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(scope: null, file: !382, line: 2893, type: !696, isLocal: true, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "main_interpreter_id", scope: !772, file: !382, line: 2830, type: !49, isLocal: true, isDefinition: true)
!772 = distinct !DISubprogram(name: "__Pyx_check_single_interpreter", scope: !382, file: !382, line: 2829, type: !773, scopeLine: 2829, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !775)
!773 = !DISubroutineType(types: !774)
!774 = !{!7}
!775 = !{}
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(scope: null, file: !382, line: 2852, type: !778, isLocal: true, isDefinition: true)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 760, elements: !779)
!779 = !{!780}
!780 = !DISubrange(count: 95)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(name: "__pyx_m", scope: !2, file: !382, line: 1326, type: !40, isLocal: true, isDefinition: true)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(scope: null, file: !382, line: 2926, type: !785, isLocal: true, isDefinition: true)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 648, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 81)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(name: "__pyx_mstate_global", scope: !2, file: !382, line: 2201, type: !790, isLocal: true, isDefinition: true)
!790 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pyx_mstatetype", file: !382, line: 2180, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 2147, size: 3264, elements: !794)
!794 = !{!795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !808, !809, !813, !814, !820, !821}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_d", scope: !793, file: !382, line: 2148, baseType: !40, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_b", scope: !793, file: !382, line: 2149, baseType: !40, size: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_cython_runtime", scope: !793, file: !382, line: 2150, baseType: !40, size: 64, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_tuple", scope: !793, file: !382, line: 2151, baseType: !40, size: 64, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_bytes", scope: !793, file: !382, line: 2152, baseType: !40, size: 64, offset: 256)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_unicode", scope: !793, file: !382, line: 2153, baseType: !40, size: 64, offset: 320)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_type_8original___pyx_scope_struct__genexpr", scope: !793, file: !382, line: 2154, baseType: !40, size: 64, offset: 384)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_ptype_8original___pyx_scope_struct__genexpr", scope: !793, file: !382, line: 2155, baseType: !64, size: 64, offset: 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_codeobj_tab", scope: !793, file: !382, line: 2156, baseType: !453, size: 64, offset: 512)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_string_tab", scope: !793, file: !382, line: 2157, baseType: !805, size: 1792, offset: 576)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 1792, elements: !806)
!806 = !{!807}
!807 = !DISubrange(count: 28)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_number_tab", scope: !793, file: !382, line: 2158, baseType: !453, size: 64, offset: 2368)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_freelist_8original___pyx_scope_struct__genexpr", scope: !793, file: !382, line: 2162, baseType: !810, size: 512, offset: 2432)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 512, elements: !811)
!811 = !{!812}
!812 = !DISubrange(count: 8)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_freecount_8original___pyx_scope_struct__genexpr", scope: !793, file: !382, line: 2163, baseType: !7, size: 32, offset: 2944)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_code_cache", scope: !793, file: !382, line: 2166, baseType: !815, size: 128, offset: 3008)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__Pyx_CodeObjectCache", file: !382, line: 1819, size: 128, elements: !816)
!816 = !{!817, !818, !819}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !815, file: !382, line: 1820, baseType: !7, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "max_count", scope: !815, file: !382, line: 1821, baseType: !7, size: 32, offset: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !815, file: !382, line: 1822, baseType: !678, size: 64, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_CommonTypesMetaclassType", scope: !793, file: !382, line: 2169, baseType: !64, size: 64, offset: 3136)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_GeneratorType", scope: !793, file: !382, line: 2177, baseType: !64, size: 64, offset: 3200)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(scope: null, file: !382, line: 2956, type: !696, isLocal: true, isDefinition: true)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(scope: null, file: !382, line: 2957, type: !826, isLocal: true, isDefinition: true)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 120, elements: !827)
!827 = !{!828}
!828 = !DISubrange(count: 15)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(scope: null, file: !382, line: 2958, type: !831, isLocal: true, isDefinition: true)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 104, elements: !832)
!832 = !{!833}
!833 = !DISubrange(count: 13)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(scope: null, file: !382, line: 3095, type: !836, isLocal: true, isDefinition: true)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 112, elements: !837)
!837 = !{!838}
!838 = !DISubrange(count: 14)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "__pyx_mstate_global_static", scope: !2, file: !382, line: 2195, type: !792, isLocal: true, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(scope: null, file: !382, line: 1336, type: !843, isLocal: true, isDefinition: true)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 432, elements: !844)
!844 = !{!845}
!845 = !DISubrange(count: 54)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "__pyx_f", scope: !2, file: !382, line: 1335, type: !848, isLocal: true, isDefinition: true)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !849, size: 64, elements: !378)
!849 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !382, line: 7271, type: !852, isLocal: true, isDefinition: true)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 624, elements: !853)
!853 = !{!854}
!854 = !DISubrange(count: 78)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(scope: null, file: !382, line: 7277, type: !826, isLocal: true, isDefinition: true)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(scope: null, file: !382, line: 7277, type: !826, isLocal: true, isDefinition: true)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(scope: null, file: !382, line: 3163, type: !861, isLocal: true, isDefinition: true)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1288, elements: !862)
!862 = !{!863}
!863 = !DISubrange(count: 161)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(scope: null, file: !382, line: 7428, type: !866, isLocal: true, isDefinition: true)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 136, elements: !867)
!867 = !{!868}
!868 = !DISubrange(count: 17)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(scope: null, file: !382, line: 7428, type: !871, isLocal: true, isDefinition: true)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 32, elements: !872)
!872 = !{!873}
!873 = !DISubrange(count: 4)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(scope: null, file: !382, line: 7428, type: !739, isLocal: true, isDefinition: true)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(scope: null, file: !382, line: 7429, type: !749, isLocal: true, isDefinition: true)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(scope: null, file: !382, line: 7433, type: !871, isLocal: true, isDefinition: true)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(scope: null, file: !382, line: 7480, type: !882, isLocal: true, isDefinition: true)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1224, elements: !883)
!883 = !{!884}
!884 = !DISubrange(count: 153)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(name: "__pyx_filename", scope: !2, file: !382, line: 1331, type: !18, isLocal: true, isDefinition: true)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(name: "__pyx_lineno", scope: !2, file: !382, line: 1328, type: !7, isLocal: true, isDefinition: true)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(name: "__pyx_clineno", scope: !2, file: !382, line: 1329, type: !7, isLocal: true, isDefinition: true)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(scope: null, file: !371, line: 25, type: !893, isLocal: true, isDefinition: true)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 144, elements: !894)
!894 = !{!895}
!895 = !DISubrange(count: 18)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(scope: null, file: !371, line: 25, type: !836, isLocal: true, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(scope: null, file: !371, line: 25, type: !900, isLocal: true, isDefinition: true)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 144, elements: !894)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(scope: null, file: !382, line: 5800, type: !903, isLocal: true, isDefinition: true)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 240, elements: !904)
!904 = !{!905}
!905 = !DISubrange(count: 30)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(scope: null, file: !382, line: 5800, type: !908, isLocal: true, isDefinition: true)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 80, elements: !909)
!909 = !{!910}
!910 = !DISubrange(count: 10)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(scope: null, file: !382, line: 5800, type: !913, isLocal: true, isDefinition: true)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 392, elements: !914)
!914 = !{!915}
!915 = !DISubrange(count: 49)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(scope: null, file: !382, line: 5700, type: !836, isLocal: true, isDefinition: true)
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(scope: null, file: !382, line: 5728, type: !920, isLocal: true, isDefinition: true)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 376, elements: !921)
!921 = !{!922}
!922 = !DISubrange(count: 47)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(scope: null, file: !382, line: 5747, type: !925, isLocal: true, isDefinition: true)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 496, elements: !926)
!926 = !{!927}
!927 = !DISubrange(count: 62)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(scope: null, file: !382, line: 5836, type: !930, isLocal: true, isDefinition: true)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 296, elements: !931)
!931 = !{!932}
!932 = !DISubrange(count: 37)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(name: "__pyx_CommonTypesMetaclass_spec", scope: !2, file: !382, line: 5835, type: !935, isLocal: true, isDefinition: true)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyType_Spec", file: !6, line: 385, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 379, size: 256, elements: !937)
!937 = !{!938, !939, !940, !941, !942}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !936, file: !6, line: 380, baseType: !18, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "basicsize", scope: !936, file: !6, line: 381, baseType: !7, size: 32, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !936, file: !6, line: 382, baseType: !7, size: 32, offset: 96)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !936, file: !6, line: 383, baseType: !23, size: 32, offset: 128)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !936, file: !6, line: 384, baseType: !943, size: 64, offset: 192)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyType_Slot", file: !6, line: 377, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 374, size: 128, elements: !946)
!946 = !{!947, !948}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !945, file: !6, line: 375, baseType: !7, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "pfunc", scope: !945, file: !6, line: 376, baseType: !39, size: 64, offset: 64)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(name: "__pyx_CommonTypesMetaclass_slots", scope: !2, file: !382, line: 5826, type: !951, isLocal: true, isDefinition: true)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !944, size: 256, elements: !952)
!952 = !{!953}
!953 = !DISubrange(count: 2)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(scope: null, file: !382, line: 5823, type: !749, isLocal: true, isDefinition: true)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(name: "__pyx_CommonTypesMetaclass_getset", scope: !2, file: !382, line: 5822, type: !958, isLocal: true, isDefinition: true)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 640, elements: !952)
!959 = !DIGlobalVariableExpression(var: !960, expr: !DIExpression())
