; ModuleID = 'dataset/cases/goeq-ojv-0091/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c'
source_filename = "dataset/cases/goeq-ojv-0091/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx14.0.0"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr }
%struct.PyModuleDef_Base = type { %struct._object, ptr, i64, ptr }
%struct._object = type { %union.anon, ptr }
%union.anon = type { i64 }
%struct.PyMethodDef = type { ptr, ptr, i32, ptr }
%struct.__pyx_mstatetype = type { ptr, ptr, ptr, ptr, ptr, ptr, [16 x ptr], %struct.__Pyx_CodeObjectCache }
%struct.__Pyx_CodeObjectCache = type { i32, i32, ptr }
%struct._typeobject = type { %struct.PyVarObject, ptr, i64, i64, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, ptr, i8, i16 }
%struct.PyVarObject = type { %struct._object, i64 }
%struct.anon.1 = type { i8, [3 x i8] }
%struct.PyStatus = type { i32, ptr, ptr, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__pyx_module_is_main_original", scope: !2, file: !424, line: 1883, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Homebrew clang version 20.1.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !28, globals: !488, splitDebugInlining: false, nameTableKind: Apple, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk", sdk: "MacOSX14.sdk")
!3 = !DIFile(filename: "dataset/cases/goeq-ojv-0091/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c", directory: ".")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 695, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/object.h", directory: "")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "PYGEN_RETURN", value: 0)
!10 = !DIEnumerator(name: "PYGEN_ERROR", value: -1)
!11 = !DIEnumerator(name: "PYGEN_NEXT", value: 1)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !14, file: !13, line: 11, baseType: !23, size: 32, elements: !24)
!13 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/initconfig.h", directory: "")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 10, size: 256, elements: !15)
!15 = !{!16, !17, !21, !22}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_type", scope: !14, file: !13, line: 15, baseType: !12, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !14, file: !13, line: 16, baseType: !18, size: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "err_msg", scope: !14, file: !13, line: 17, baseType: !18, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "exitcode", scope: !14, file: !13, line: 18, baseType: !7, size: 32, offset: 192)
!23 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!24 = !{!25, !26, !27}
!25 = !DIEnumerator(name: "_PyStatus_TYPE_OK", value: 0)
!26 = !DIEnumerator(name: "_PyStatus_TYPE_ERROR", value: 1)
!27 = !DIEnumerator(name: "_PyStatus_TYPE_EXIT", value: 2)
!28 = !{!29, !35, !39, !40, !367, !369, !7, !18, !95, !380, !389, !64, !400, !401, !409, !422}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !32, line: 34, baseType: !33)
!32 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_wchar_t.h", directory: "")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wchar_t", file: !34, line: 82, baseType: !7)
!34 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/arm/_types.h", directory: "")
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !36, line: 31, baseType: !37)
!36 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !34, line: 70, baseType: !38)
!38 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !42, line: 18, baseType: !43)
!42 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pytypedefs.h", directory: "")
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !6, line: 110, size: 128, elements: !44)
!44 = !{!45, !63}
!45 = !DIDerivedType(tag: DW_TAG_member, scope: !43, file: !6, line: 122, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !43, file: !6, line: 122, size: 64, elements: !47)
!47 = !{!48, !52}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt_full", scope: !46, file: !6, line: 124, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !50, line: 30, baseType: !51)
!50 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_int64_t.h", directory: "")
!51 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, scope: !46, file: !6, line: 125, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !46, file: !6, line: 125, size: 64, elements: !54)
!54 = !{!55, !58, !62}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !53, file: !6, line: 131, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !57, line: 31, baseType: !23)
!57 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint32_t.h", directory: "")
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ob_overflow", scope: !53, file: !6, line: 132, baseType: !59, size: 16, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !60, line: 31, baseType: !61)
!60 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint16_t.h", directory: "")
!61 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ob_flags", scope: !53, file: !6, line: 133, baseType: !59, size: 16, offset: 48)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !43, file: !6, line: 144, baseType: !64, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !42, line: 20, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !67, line: 148, size: 3328, elements: !68)
!67 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/object.h", directory: "")
!68 = !{!69, !81, !82, !83, !84, !89, !90, !96, !101, !120, !122, !175, !206, !218, !224, !225, !226, !228, !230, !262, !263, !264, !273, !274, !279, !280, !282, !284, !295, !306, !324, !325, !326, !328, !330, !331, !333, !338, !343, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !364, !366}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !66, file: !67, line: 149, baseType: !70, size: 192)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !6, line: 172, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 169, size: 192, elements: !72)
!72 = !{!73, !74}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !71, file: !6, line: 170, baseType: !41, size: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !71, file: !6, line: 171, baseType: !75, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !76, line: 156, baseType: !77)
!76 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pyport.h", directory: "")
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !78, line: 31, baseType: !79)
!78 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_ssize_t.h", directory: "")
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ssize_t", file: !34, line: 97, baseType: !80)
!80 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !66, file: !67, line: 150, baseType: !18, size: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !66, file: !67, line: 151, baseType: !75, size: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !66, file: !67, line: 151, baseType: !75, size: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !66, file: !67, line: 155, baseType: !85, size: 64, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !6, line: 353, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !40}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall_offset", scope: !66, file: !67, line: 156, baseType: !75, size: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !66, file: !67, line: 157, baseType: !91, size: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !6, line: 354, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!40, !40, !95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !66, file: !67, line: 158, baseType: !97, size: 64, offset: 576)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !6, line: 356, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!7, !40, !95, !40}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_async", scope: !66, file: !67, line: 159, baseType: !102, size: 64, offset: 640)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyAsyncMethods", file: !67, line: 135, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 130, size: 256, elements: !105)
!105 = !{!106, !111, !112, !113}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "am_await", scope: !104, file: !67, line: 131, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !6, line: 336, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!40, !40}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "am_aiter", scope: !104, file: !67, line: 132, baseType: !107, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "am_anext", scope: !104, file: !67, line: 133, baseType: !107, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "am_send", scope: !104, file: !67, line: 134, baseType: !114, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "sendfunc", file: !67, line: 128, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!118, !40, !40, !119}
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySendResult", file: !6, line: 699, baseType: !5)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !66, file: !67, line: 161, baseType: !121, size: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !6, line: 358, baseType: !108)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !66, file: !67, line: 165, baseType: !123, size: 64, offset: 768)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !67, line: 106, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 61, size: 2304, elements: !126)
!126 = !{!127, !132, !133, !134, !135, !136, !141, !142, !143, !144, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !125, file: !67, line: 66, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !6, line: 337, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!40, !40, !40}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !125, file: !67, line: 67, baseType: !128, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !125, file: !67, line: 68, baseType: !128, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !125, file: !67, line: 69, baseType: !128, size: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !125, file: !67, line: 70, baseType: !128, size: 64, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !125, file: !67, line: 71, baseType: !137, size: 64, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !6, line: 338, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!40, !40, !40, !40}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !125, file: !67, line: 72, baseType: !107, size: 64, offset: 384)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !125, file: !67, line: 73, baseType: !107, size: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !125, file: !67, line: 74, baseType: !107, size: 64, offset: 512)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !125, file: !67, line: 75, baseType: !145, size: 64, offset: 576)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !6, line: 339, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!7, !40}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !125, file: !67, line: 76, baseType: !107, size: 64, offset: 640)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !125, file: !67, line: 77, baseType: !128, size: 64, offset: 704)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !125, file: !67, line: 78, baseType: !128, size: 64, offset: 768)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !125, file: !67, line: 79, baseType: !128, size: 64, offset: 832)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !125, file: !67, line: 80, baseType: !128, size: 64, offset: 896)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !125, file: !67, line: 81, baseType: !128, size: 64, offset: 960)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !125, file: !67, line: 82, baseType: !107, size: 64, offset: 1024)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !125, file: !67, line: 83, baseType: !39, size: 64, offset: 1088)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !125, file: !67, line: 84, baseType: !107, size: 64, offset: 1152)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !125, file: !67, line: 86, baseType: !128, size: 64, offset: 1216)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !125, file: !67, line: 87, baseType: !128, size: 64, offset: 1280)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !125, file: !67, line: 88, baseType: !128, size: 64, offset: 1344)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !125, file: !67, line: 89, baseType: !128, size: 64, offset: 1408)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !125, file: !67, line: 90, baseType: !137, size: 64, offset: 1472)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !125, file: !67, line: 91, baseType: !128, size: 64, offset: 1536)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !125, file: !67, line: 92, baseType: !128, size: 64, offset: 1600)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !125, file: !67, line: 93, baseType: !128, size: 64, offset: 1664)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !125, file: !67, line: 94, baseType: !128, size: 64, offset: 1728)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !125, file: !67, line: 95, baseType: !128, size: 64, offset: 1792)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !125, file: !67, line: 97, baseType: !128, size: 64, offset: 1856)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !125, file: !67, line: 98, baseType: !128, size: 64, offset: 1920)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !125, file: !67, line: 99, baseType: !128, size: 64, offset: 1984)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !125, file: !67, line: 100, baseType: !128, size: 64, offset: 2048)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !125, file: !67, line: 102, baseType: !107, size: 64, offset: 2112)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_matrix_multiply", scope: !125, file: !67, line: 104, baseType: !128, size: 64, offset: 2176)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_matrix_multiply", scope: !125, file: !67, line: 105, baseType: !128, size: 64, offset: 2240)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !66, file: !67, line: 166, baseType: !176, size: 64, offset: 832)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !67, line: 120, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 108, size: 640, elements: !179)
!179 = !{!180, !185, !186, !191, !192, !193, !198, !199, !204, !205}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !178, file: !67, line: 109, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !6, line: 340, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!75, !40}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !178, file: !67, line: 110, baseType: !128, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !178, file: !67, line: 111, baseType: !187, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !6, line: 341, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!40, !40, !75}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !178, file: !67, line: 112, baseType: !187, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !178, file: !67, line: 113, baseType: !39, size: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !178, file: !67, line: 114, baseType: !194, size: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !6, line: 343, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!7, !40, !75, !40}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !178, file: !67, line: 115, baseType: !39, size: 64, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !178, file: !67, line: 116, baseType: !200, size: 64, offset: 448)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !6, line: 347, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!7, !40, !40}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !178, file: !67, line: 118, baseType: !128, size: 64, offset: 512)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !178, file: !67, line: 119, baseType: !187, size: 64, offset: 576)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !66, file: !67, line: 167, baseType: !207, size: 64, offset: 896)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !67, line: 126, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 122, size: 192, elements: !210)
!210 = !{!211, !212, !213}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !209, file: !67, line: 123, baseType: !181, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !209, file: !67, line: 124, baseType: !128, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !209, file: !67, line: 125, baseType: !214, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !6, line: 345, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!7, !40, !40, !40}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !66, file: !67, line: 171, baseType: !219, size: 64, offset: 960)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !6, line: 359, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!223, !40}
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !76, line: 170, baseType: !75)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !66, file: !67, line: 172, baseType: !137, size: 64, offset: 1024)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !66, file: !67, line: 173, baseType: !121, size: 64, offset: 1088)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !66, file: !67, line: 174, baseType: !227, size: 64, offset: 1152)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !6, line: 355, baseType: !129)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !66, file: !67, line: 175, baseType: !229, size: 64, offset: 1216)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !6, line: 357, baseType: !215)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !66, file: !67, line: 178, baseType: !231, size: 64, offset: 1280)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !67, line: 140, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 137, size: 128, elements: !234)
!234 = !{!235, !257}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !233, file: !67, line: 138, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !237, line: 35, baseType: !238)
!237 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pybuffer.h", directory: "")
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!7, !40, !241, !7}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !237, line: 33, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !237, line: 20, size: 640, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !254, !255, !256}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !243, file: !237, line: 21, baseType: !39, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !243, file: !237, line: 22, baseType: !40, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !243, file: !237, line: 23, baseType: !75, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !243, file: !237, line: 24, baseType: !75, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !243, file: !237, line: 26, baseType: !7, size: 32, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !243, file: !237, line: 27, baseType: !7, size: 32, offset: 288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !243, file: !237, line: 28, baseType: !95, size: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !243, file: !237, line: 29, baseType: !253, size: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !243, file: !237, line: 30, baseType: !253, size: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !243, file: !237, line: 31, baseType: !253, size: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !243, file: !237, line: 32, baseType: !39, size: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !233, file: !67, line: 139, baseType: !258, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !237, line: 36, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !40, !241}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !66, file: !67, line: 181, baseType: !38, size: 64, offset: 1344)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !66, file: !67, line: 183, baseType: !18, size: 64, offset: 1408)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !66, file: !67, line: 187, baseType: !265, size: 64, offset: 1472)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !6, line: 349, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!7, !40, !269, !39}
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !6, line: 348, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!7, !40, !39}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !66, file: !67, line: 190, baseType: !145, size: 64, offset: 1536)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !66, file: !67, line: 194, baseType: !275, size: 64, offset: 1600)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !6, line: 360, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!40, !40, !40, !7}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !66, file: !67, line: 197, baseType: !75, size: 64, offset: 1664)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !66, file: !67, line: 200, baseType: !281, size: 64, offset: 1728)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !6, line: 361, baseType: !108)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !66, file: !67, line: 201, baseType: !283, size: 64, offset: 1792)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !6, line: 362, baseType: !108)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !66, file: !67, line: 204, baseType: !285, size: 64, offset: 1856)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !42, line: 14, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 68, size: 256, elements: !289)
!288 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/methodobject.h", directory: "")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 69, baseType: !18, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 70, baseType: !292, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 19, baseType: !129)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 71, baseType: !7, size: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 73, baseType: !18, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !66, file: !67, line: 205, baseType: !296, size: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !42, line: 16, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !299, line: 41, size: 320, elements: !300)
!299 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/descrobject.h", directory: "")
!300 = !{!301, !302, !303, !304, !305}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !298, file: !299, line: 42, baseType: !18, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !298, file: !299, line: 43, baseType: !7, size: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !298, file: !299, line: 44, baseType: !75, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !298, file: !299, line: 45, baseType: !7, size: 32, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !298, file: !299, line: 46, baseType: !18, size: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !66, file: !67, line: 206, baseType: !307, size: 64, offset: 1984)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGetSetDef", file: !42, line: 15, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !299, line: 11, size: 320, elements: !310)
!310 = !{!311, !312, !317, !322, !323}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !309, file: !299, line: 12, baseType: !18, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !309, file: !299, line: 13, baseType: !313, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !299, line: 8, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!40, !40, !39}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !309, file: !299, line: 14, baseType: !318, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !299, line: 9, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!7, !40, !40, !39}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !309, file: !299, line: 15, baseType: !18, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !309, file: !299, line: 16, baseType: !39, size: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !66, file: !67, line: 208, baseType: !64, size: 64, offset: 2048)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !66, file: !67, line: 209, baseType: !40, size: 64, offset: 2112)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !66, file: !67, line: 210, baseType: !327, size: 64, offset: 2176)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !6, line: 363, baseType: !138)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !66, file: !67, line: 211, baseType: !329, size: 64, offset: 2240)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !6, line: 364, baseType: !215)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !66, file: !67, line: 212, baseType: !75, size: 64, offset: 2304)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !66, file: !67, line: 213, baseType: !332, size: 64, offset: 2368)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !6, line: 365, baseType: !215)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !66, file: !67, line: 214, baseType: !334, size: 64, offset: 2432)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !6, line: 367, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!40, !64, !75}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !66, file: !67, line: 215, baseType: !339, size: 64, offset: 2496)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !6, line: 366, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!40, !64, !40, !40}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !66, file: !67, line: 216, baseType: !344, size: 64, offset: 2560)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !6, line: 352, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !39}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !66, file: !67, line: 217, baseType: !145, size: 64, offset: 2624)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !66, file: !67, line: 218, baseType: !40, size: 64, offset: 2688)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !66, file: !67, line: 219, baseType: !40, size: 64, offset: 2752)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !66, file: !67, line: 220, baseType: !40, size: 64, offset: 2816)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !66, file: !67, line: 221, baseType: !39, size: 64, offset: 2880)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !66, file: !67, line: 222, baseType: !40, size: 64, offset: 2944)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !66, file: !67, line: 223, baseType: !85, size: 64, offset: 3008)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !66, file: !67, line: 228, baseType: !23, size: 32, offset: 3072)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !66, file: !67, line: 230, baseType: !85, size: 64, offset: 3136)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall", scope: !66, file: !67, line: 231, baseType: !358, size: 64, offset: 3200)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "vectorcallfunc", file: !6, line: 370, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!40, !40, !362, !35, !40}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tp_watched", scope: !66, file: !67, line: 234, baseType: !365, size: 8, offset: 3264)
!365 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tp_versions_used", scope: !66, file: !67, line: 241, baseType: !59, size: 16, offset: 3280)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !368, line: 30, baseType: !7)
!368 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_int32_t.h", directory: "")
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !371, line: 13, baseType: !372)
!371 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/tupleobject.h", directory: "")
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !371, line: 5, size: 320, elements: !373)
!373 = !{!374, !375, !376}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !372, file: !371, line: 6, baseType: !70, size: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ob_hash", scope: !372, file: !371, line: 8, baseType: !223, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !372, file: !371, line: 12, baseType: !377, size: 64, offset: 256)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 64, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 1)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !382, line: 15, baseType: !383)
!382 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/bytesobject.h", directory: "")
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 5, size: 320, elements: !384)
!384 = !{!385, !386, !387}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !383, file: !382, line: 6, baseType: !70, size: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !383, file: !382, line: 7, baseType: !223, size: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !383, file: !382, line: 8, baseType: !388, size: 8, offset: 256)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, elements: !378)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunctionObject", file: !391, line: 14, baseType: !392)
!391 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/methodobject.h", directory: "")
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !391, line: 7, size: 448, elements: !393)
!393 = !{!394, !395, !396, !397, !398, !399}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !392, file: !391, line: 8, baseType: !41, size: 128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "m_ml", scope: !392, file: !391, line: 9, baseType: !285, size: 64, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "m_self", scope: !392, file: !391, line: 10, baseType: !40, size: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "m_module", scope: !392, file: !391, line: 11, baseType: !40, size: 64, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "m_weakreflist", scope: !392, file: !391, line: 12, baseType: !40, size: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "vectorcall", scope: !392, file: !391, line: 13, baseType: !358, size: 64, offset: 384)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !403, line: 22, baseType: !404)
!403 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/listobject.h", directory: "")
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !403, line: 5, size: 320, elements: !405)
!405 = !{!406, !407, !408}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !404, file: !403, line: 6, baseType: !70, size: 192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !404, file: !403, line: 8, baseType: !119, size: 64, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !404, file: !403, line: 21, baseType: !75, size: 64, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBaseExceptionObject", file: !411, line: 15, baseType: !412)
!411 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/pyerrors.h", directory: "")
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !411, line: 13, size: 576, elements: !413)
!413 = !{!414, !415, !416, !417, !418, !419, !420, !421}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !412, file: !411, line: 14, baseType: !41, size: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !412, file: !411, line: 14, baseType: !40, size: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !412, file: !411, line: 14, baseType: !40, size: 64, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !412, file: !411, line: 14, baseType: !40, size: 64, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", scope: !412, file: !411, line: 14, baseType: !40, size: 64, offset: 320)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !412, file: !411, line: 14, baseType: !40, size: 64, offset: 384)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "cause", scope: !412, file: !411, line: 14, baseType: !40, size: 64, offset: 448)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_context", scope: !412, file: !411, line: 14, baseType: !20, size: 8, offset: 512)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CodeObjectCacheEntry", file: !424, line: 1715, baseType: !425)
!424 = !DIFile(filename: "dataset/cases/goeq-ojv-0091/artifacts/cython-clang-llvm-o0-embed-v1/prog_b/program.c", directory: ".")
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !424, line: 1712, size: 128, elements: !426)
!426 = !{!427, !487}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "code_object", scope: !425, file: !424, line: 1713, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CachedCodeObjectType", file: !424, line: 1710, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !42, line: 21, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyCodeObject", file: !432, line: 115, size: 1728, elements: !433)
!432 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/code.h", directory: "")
!433 = !{!434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !468, !477, !480, !483, !484, !485, !486}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !431, file: !432, line: 115, baseType: !70, size: 192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !431, file: !432, line: 115, baseType: !40, size: 64, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !431, file: !432, line: 115, baseType: !40, size: 64, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "co_exceptiontable", scope: !431, file: !432, line: 115, baseType: !40, size: 64, offset: 320)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !431, file: !432, line: 115, baseType: !7, size: 32, offset: 384)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !431, file: !432, line: 115, baseType: !7, size: 32, offset: 416)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "co_posonlyargcount", scope: !431, file: !432, line: 115, baseType: !7, size: 32, offset: 448)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !431, file: !432, line: 115, baseType: !7, size: 32, offset: 480)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !431, file: !432, line: 115, baseType: !7, size: 32, offset: 512)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !431, file: !432, line: 115, baseType: !7, size: 32, offset: 544)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocalsplus", scope: !431, file: !432, line: 115, baseType: !7, size: 32, offset: 576)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "co_framesize", scope: !431, file: !432, line: 115, baseType: !7, size: 32, offset: 608)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !431, file: !432, line: 115, baseType: !7, size: 32, offset: 640)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "co_ncellvars", scope: !431, file: !432, line: 115, baseType: !7, size: 32, offset: 672)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "co_nfreevars", scope: !431, file: !432, line: 115, baseType: !7, size: 32, offset: 704)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "co_version", scope: !431, file: !432, line: 115, baseType: !56, size: 32, offset: 736)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "co_localsplusnames", scope: !431, file: !432, line: 115, baseType: !40, size: 64, offset: 768)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "co_localspluskinds", scope: !431, file: !432, line: 115, baseType: !40, size: 64, offset: 832)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !431, file: !432, line: 115, baseType: !40, size: 64, offset: 896)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !431, file: !432, line: 115, baseType: !40, size: 64, offset: 960)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "co_qualname", scope: !431, file: !432, line: 115, baseType: !40, size: 64, offset: 1024)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "co_linetable", scope: !431, file: !432, line: 115, baseType: !40, size: 64, offset: 1088)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !431, file: !432, line: 115, baseType: !40, size: 64, offset: 1152)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "co_executors", scope: !431, file: !432, line: 115, baseType: !458, size: 64, offset: 1216)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyExecutorArray", file: !432, line: 22, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !432, line: 18, size: 128, elements: !461)
!461 = !{!462, !463, !464}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !460, file: !432, line: 19, baseType: !7, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !460, file: !432, line: 20, baseType: !7, size: 32, offset: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "executors", scope: !460, file: !432, line: 21, baseType: !465, size: 64, offset: 64)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 64, elements: !378)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyExecutorObject", file: !432, line: 21, flags: DIFlagFwdDecl)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_co_cached", scope: !431, file: !432, line: 115, baseType: !469, size: 64, offset: 1280)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyCoCached", file: !432, line: 16, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !432, line: 11, size: 256, elements: !472)
!472 = !{!473, !474, !475, !476}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_co_code", scope: !471, file: !432, line: 12, baseType: !40, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_co_varnames", scope: !471, file: !432, line: 13, baseType: !40, size: 64, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_co_cellvars", scope: !471, file: !432, line: 14, baseType: !40, size: 64, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_co_freevars", scope: !471, file: !432, line: 15, baseType: !40, size: 64, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_co_instrumentation_version", scope: !431, file: !432, line: 115, baseType: !478, size: 64, offset: 1344)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !479, line: 34, baseType: !38)
!479 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_co_monitoring", scope: !431, file: !432, line: 115, baseType: !481, size: 64, offset: 1408)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyCoMonitoringData", file: !432, line: 115, flags: DIFlagFwdDecl)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_co_unique_id", scope: !431, file: !432, line: 115, baseType: !75, size: 64, offset: 1472)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_co_firsttraceable", scope: !431, file: !432, line: 115, baseType: !7, size: 32, offset: 1536)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "co_extra", scope: !431, file: !432, line: 115, baseType: !39, size: 64, offset: 1600)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "co_code_adaptive", scope: !431, file: !432, line: 115, baseType: !388, size: 8, offset: 1664)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "code_line", scope: !425, file: !424, line: 1714, baseType: !7, size: 32, offset: 64)
!488 = !{!0, !489, !494, !496, !501, !531, !534, !539, !544, !549, !554, !556, !558, !560, !565, !570, !572, !578, !583, !585, !590, !611, !613, !618, !623, !628, !633, !638, !643, !645, !650, !654, !659, !661, !663, !668, !673, !678, !680, !682, !684, !689, !691, !693, !695, !700, !702, !705, !707, !712, !717, !722, !724, !726, !728, !733, !738, !741, !743, !745, !750, !752, !755, !757, !760, !765, !770, !775, !777, !779, !781, !784, !789, !791, !793, !795, !797, !799, !804, !806, !811}
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !424, line: 3394, type: !491, isLocal: true, isDefinition: true)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, elements: !492)
!492 = !{!493}
!493 = !DISubrange(count: 16)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(scope: null, file: !424, line: 3401, type: !388, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2107, type: !498, isLocal: true, isDefinition: true)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 72, elements: !499)
!499 = !{!500}
!500 = !DISubrange(count: 9)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "__pyx_moduledef", scope: !2, file: !424, line: 2103, type: !503, isLocal: true, isDefinition: true)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !504, line: 107, size: 832, elements: !505)
!504 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/moduleobject.h", directory: "")
!505 = !{!506, !517, !518, !519, !520, !521, !528, !529, !530}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !503, file: !504, line: 108, baseType: !507, size: 320)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !504, line: 58, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !504, line: 39, size: 320, elements: !509)
!509 = !{!510, !511, !515, !516}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !508, file: !504, line: 40, baseType: !41, size: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !508, file: !504, line: 47, baseType: !512, size: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!40}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !508, file: !504, line: 52, baseType: !75, size: 64, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !508, file: !504, line: 57, baseType: !40, size: 64, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !503, file: !504, line: 109, baseType: !18, size: 64, offset: 320)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !503, file: !504, line: 110, baseType: !18, size: 64, offset: 384)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !503, file: !504, line: 111, baseType: !75, size: 64, offset: 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !503, file: !504, line: 112, baseType: !285, size: 64, offset: 512)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "m_slots", scope: !503, file: !504, line: 113, baseType: !522, size: 64, offset: 576)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Slot", file: !42, line: 13, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Slot", file: !504, line: 69, size: 128, elements: !525)
!525 = !{!526, !527}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !524, file: !504, line: 70, baseType: !7, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !524, file: !504, line: 71, baseType: !39, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !503, file: !504, line: 114, baseType: !265, size: 64, offset: 640)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !503, file: !504, line: 115, baseType: !145, size: 64, offset: 704)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !503, file: !504, line: 116, baseType: !344, size: 64, offset: 768)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "__pyx_methods", scope: !2, file: !424, line: 2000, type: !533, isLocal: true, isDefinition: true)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 256, elements: !378)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "__pyx_moduledef_slots", scope: !2, file: !424, line: 2086, type: !536, isLocal: true, isDefinition: true)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 384, elements: !537)
!537 = !{!538}
!538 = !DISubrange(count: 3)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2235, type: !541, isLocal: true, isDefinition: true)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 40, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 5)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2242, type: !546, isLocal: true, isDefinition: true)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 56, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 7)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2242, type: !551, isLocal: true, isDefinition: true)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 88, elements: !552)
!552 = !{!553}
!553 = !DISubrange(count: 11)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2243, type: !546, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2243, type: !498, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2244, type: !546, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2244, type: !562, isLocal: true, isDefinition: true)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 96, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 12)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2245, type: !567, isLocal: true, isDefinition: true)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 216, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 27)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2245, type: !498, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "main_interpreter_id", scope: !574, file: !424, line: 2182, type: !49, isLocal: true, isDefinition: true)
!574 = distinct !DISubprogram(name: "__Pyx_check_single_interpreter", scope: !424, file: !424, line: 2181, type: !575, scopeLine: 2181, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !577)
!575 = !DISubroutineType(types: !576)
!576 = !{!7}
!577 = !{}
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2204, type: !580, isLocal: true, isDefinition: true)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 760, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 95)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "__pyx_m", scope: !2, file: !424, line: 1326, type: !40, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2283, type: !587, isLocal: true, isDefinition: true)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 648, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 81)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "__pyx_mstate_global", scope: !2, file: !424, line: 1941, type: !592, isLocal: true, isDefinition: true)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !593)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pyx_mstatetype", file: !424, line: 1920, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !424, line: 1907, size: 1536, elements: !596)
!596 = !{!597, !598, !599, !600, !601, !602, !603, !605}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_d", scope: !595, file: !424, line: 1908, baseType: !40, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_b", scope: !595, file: !424, line: 1909, baseType: !40, size: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_cython_runtime", scope: !595, file: !424, line: 1910, baseType: !40, size: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_tuple", scope: !595, file: !424, line: 1911, baseType: !40, size: 64, offset: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_bytes", scope: !595, file: !424, line: 1912, baseType: !40, size: 64, offset: 256)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_unicode", scope: !595, file: !424, line: 1913, baseType: !40, size: 64, offset: 320)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_string_tab", scope: !595, file: !424, line: 1914, baseType: !604, size: 1024, offset: 384)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 1024, elements: !492)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_code_cache", scope: !595, file: !424, line: 1917, baseType: !606, size: 128, offset: 1408)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__Pyx_CodeObjectCache", file: !424, line: 1716, size: 128, elements: !607)
!607 = !{!608, !609, !610}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !606, file: !424, line: 1717, baseType: !7, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "max_count", scope: !606, file: !424, line: 1718, baseType: !7, size: 32, offset: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !606, file: !424, line: 1719, baseType: !422, size: 64, offset: 64)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2313, type: !498, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2314, type: !615, isLocal: true, isDefinition: true)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 120, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 15)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2315, type: !620, isLocal: true, isDefinition: true)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 104, elements: !621)
!621 = !{!622}
!622 = !DISubrange(count: 13)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2476, type: !625, isLocal: true, isDefinition: true)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 208, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 26)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2476, type: !630, isLocal: true, isDefinition: true)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 80, elements: !631)
!631 = !{!632}
!632 = !DISubrange(count: 10)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2476, type: !635, isLocal: true, isDefinition: true)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 200, elements: !636)
!636 = !{!637}
!637 = !DISubrange(count: 25)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2553, type: !640, isLocal: true, isDefinition: true)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 112, elements: !641)
!641 = !{!642}
!642 = !DISubrange(count: 14)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "__pyx_mstate_global_static", scope: !2, file: !424, line: 1935, type: !594, isLocal: true, isDefinition: true)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !424, line: 1336, type: !647, isLocal: true, isDefinition: true)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 432, elements: !648)
!648 = !{!649}
!649 = !DISubrange(count: 54)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "__pyx_f", scope: !2, file: !424, line: 1335, type: !652, isLocal: true, isDefinition: true)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !653, size: 64, elements: !378)
!653 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(scope: null, file: !424, line: 4257, type: !656, isLocal: true, isDefinition: true)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 624, elements: !657)
!657 = !{!658}
!658 = !DISubrange(count: 78)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !424, line: 4263, type: !615, isLocal: true, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(scope: null, file: !424, line: 4263, type: !615, isLocal: true, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2615, type: !665, isLocal: true, isDefinition: true)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 728, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 91)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !424, line: 4273, type: !670, isLocal: true, isDefinition: true)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 136, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 17)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !424, line: 4273, type: !675, isLocal: true, isDefinition: true)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 32, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 4)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !424, line: 4273, type: !541, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !424, line: 4274, type: !551, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !424, line: 4278, type: !675, isLocal: true, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(scope: null, file: !424, line: 4325, type: !686, isLocal: true, isDefinition: true)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1224, elements: !687)
!687 = !{!688}
!688 = !DISubrange(count: 153)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "__pyx_filename", scope: !2, file: !424, line: 1331, type: !18, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(name: "__pyx_lineno", scope: !2, file: !424, line: 1328, type: !7, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(name: "__pyx_clineno", scope: !2, file: !424, line: 1329, type: !7, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !382, line: 25, type: !697, isLocal: true, isDefinition: true)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 144, elements: !698)
!698 = !{!699}
!699 = !DISubrange(count: 18)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(scope: null, file: !382, line: 25, type: !640, isLocal: true, isDefinition: true)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(scope: null, file: !382, line: 25, type: !704, isLocal: true, isDefinition: true)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 144, elements: !698)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2848, type: !635, isLocal: true, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2880, type: !709, isLocal: true, isDefinition: true)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 248, elements: !710)
!710 = !{!711}
!711 = !DISubrange(count: 31)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2887, type: !714, isLocal: true, isDefinition: true)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 344, elements: !715)
!715 = !{!716}
!716 = !DISubrange(count: 43)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2925, type: !719, isLocal: true, isDefinition: true)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 224, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 28)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2925, type: !567, isLocal: true, isDefinition: true)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2927, type: !551, isLocal: true, isDefinition: true)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "__pyx_builtin_input", scope: !2, file: !424, line: 1889, type: !40, isLocal: true, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !424, line: 4115, type: !730, isLocal: true, isDefinition: true)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 160, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 20)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !424, line: 4115, type: !735, isLocal: true, isDefinition: true)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 152, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 19)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !371, line: 24, type: !740, isLocal: true, isDefinition: true)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 136, elements: !671)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !371, line: 24, type: !640, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !371, line: 24, type: !704, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !6, line: 284, type: !747, isLocal: true, isDefinition: true)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 64, elements: !748)
!748 = !{!749}
!749 = !DISubrange(count: 8)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !6, line: 284, type: !498, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !6, line: 284, type: !754, isLocal: true, isDefinition: true)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 224, elements: !720)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !6, line: 285, type: !754, isLocal: true, isDefinition: true)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(scope: null, file: !424, line: 4100, type: !759, isLocal: true, isDefinition: true)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 128, elements: !492)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(scope: null, file: !424, line: 4132, type: !762, isLocal: true, isDefinition: true)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 312, elements: !763)
!763 = !{!764}
!764 = !DISubrange(count: 39)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(scope: null, file: !424, line: 4132, type: !767, isLocal: true, isDefinition: true)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 264, elements: !768)
!768 = !{!769}
!769 = !DISubrange(count: 33)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !424, line: 4135, type: !772, isLocal: true, isDefinition: true)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 168, elements: !773)
!773 = !{!774}
!774 = !DISubrange(count: 21)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "__pyx_8genexpr1__pyx_v_8original_A", scope: !2, file: !424, line: 1878, type: !40, isLocal: true, isDefinition: true)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(name: "__pyx_builtin_map", scope: !2, file: !424, line: 1891, type: !40, isLocal: true, isDefinition: true)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "__pyx_builtin_sum", scope: !2, file: !424, line: 1890, type: !40, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !6, line: 308, type: !783, isLocal: true, isDefinition: true)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 96, elements: !563)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(scope: null, file: !6, line: 308, type: !786, isLocal: true, isDefinition: true)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 352, elements: !787)
!787 = !{!788}
!788 = !DISubrange(count: 44)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(scope: null, file: !6, line: 309, type: !786, isLocal: true, isDefinition: true)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "__pyx_7genexpr__pyx_v_8original_A", scope: !2, file: !424, line: 1877, type: !40, isLocal: true, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "__pyx_builtin_max", scope: !2, file: !424, line: 1887, type: !40, isLocal: true, isDefinition: true)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "__pyx_builtin_min", scope: !2, file: !424, line: 1888, type: !40, isLocal: true, isDefinition: true)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(scope: null, file: !424, line: 3269, type: !551, isLocal: true, isDefinition: true)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(scope: null, file: !424, line: 1330, type: !801, isLocal: true, isDefinition: true)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 944, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 118)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(name: "__pyx_cfilenm", scope: !2, file: !424, line: 1330, type: !653, isLocal: true, isDefinition: true)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2750, type: !808, isLocal: true, isDefinition: true)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 192, elements: !809)
!809 = !{!810}
!810 = !DISubrange(count: 24)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(scope: null, file: !424, line: 2750, type: !813, isLocal: true, isDefinition: true)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 560, elements: !814)
!814 = !{!815}
!815 = !DISubrange(count: 70)
!816 = !{i32 2, !"SDK Version", [2 x i32] [i32 14, i32 4]}
!817 = !{i32 7, !"Dwarf Version", i32 4}
!818 = !{i32 2, !"Debug Info Version", i32 3}
!819 = !{i32 1, !"wchar_size", i32 4}
!820 = !{i32 8, !"PIC Level", i32 2}
!821 = !{i32 7, !"uwtable", i32 1}
!822 = !{i32 7, !"frame-pointer", i32 1}
!823 = !{!"Homebrew clang version 20.1.8"}
!824 = distinct !DISubprogram(name: "PyInit_original", scope: !424, file: !424, line: 2146, type: !513, scopeLine: 2148, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2)
!825 = !DILocation(line: 2149, column: 10, scope: !824)
!826 = !DILocation(line: 2149, column: 3, scope: !824)
!827 = distinct !DISubprogram(name: "main", scope: !424, file: !424, line: 3383, type: !828, scopeLine: 3384, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !577)
!828 = !DISubroutineType(types: !829)
!829 = !{!7, !7, !830}
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!831 = !DILocalVariable(name: "argc", arg: 1, scope: !827, file: !424, line: 3383, type: !7)
!832 = !DILocation(line: 3383, column: 10, scope: !827)
!833 = !DILocalVariable(name: "argv", arg: 2, scope: !827, file: !424, line: 3383, type: !830)
!834 = !DILocation(line: 3383, column: 23, scope: !827)
!835 = !DILocation(line: 3385, column: 10, scope: !836)
!836 = distinct !DILexicalBlock(scope: !827, file: !424, line: 3385, column: 9)
!837 = !DILocation(line: 3385, column: 9, scope: !836)
!838 = !DILocation(line: 3386, column: 16, scope: !839)
!839 = distinct !DILexicalBlock(scope: !836, file: !424, line: 3385, column: 16)
!840 = !DILocation(line: 3386, column: 9, scope: !839)
!841 = !DILocalVariable(name: "i", scope: !842, file: !424, line: 3389, type: !7)
!842 = distinct !DILexicalBlock(scope: !836, file: !424, line: 3388, column: 10)
!843 = !DILocation(line: 3389, column: 13, scope: !842)
!844 = !DILocalVariable(name: "res", scope: !842, file: !424, line: 3389, type: !7)
!845 = !DILocation(line: 3389, column: 16, scope: !842)
!846 = !DILocalVariable(name: "argv_copy", scope: !842, file: !424, line: 3390, type: !29)
!847 = !DILocation(line: 3390, column: 19, scope: !842)
!848 = !DILocation(line: 3390, column: 78, scope: !842)
!849 = !DILocation(line: 3390, column: 69, scope: !842)
!850 = !DILocation(line: 3390, column: 67, scope: !842)
!851 = !DILocation(line: 3390, column: 43, scope: !842)
!852 = !DILocalVariable(name: "argv_copy2", scope: !842, file: !424, line: 3391, type: !29)
!853 = !DILocation(line: 3391, column: 19, scope: !842)
!854 = !DILocation(line: 3391, column: 79, scope: !842)
!855 = !DILocation(line: 3391, column: 70, scope: !842)
!856 = !DILocation(line: 3391, column: 68, scope: !842)
!857 = !DILocation(line: 3391, column: 44, scope: !842)
!858 = !DILocalVariable(name: "oldloc", scope: !842, file: !424, line: 3392, type: !95)
!859 = !DILocation(line: 3392, column: 15, scope: !842)
!860 = !DILocation(line: 3392, column: 31, scope: !842)
!861 = !DILocation(line: 3392, column: 24, scope: !842)
!862 = !DILocation(line: 3393, column: 14, scope: !863)
!863 = distinct !DILexicalBlock(scope: !842, file: !424, line: 3393, column: 13)
!864 = !DILocation(line: 3393, column: 24, scope: !863)
!865 = !DILocation(line: 3393, column: 28, scope: !863)
!866 = !DILocation(line: 3393, column: 39, scope: !863)
!867 = !DILocation(line: 3393, column: 43, scope: !863)
!868 = !DILocation(line: 3394, column: 21, scope: !869)
!869 = distinct !DILexicalBlock(scope: !863, file: !424, line: 3393, column: 51)
!870 = !DILocation(line: 3394, column: 13, scope: !869)
!871 = !DILocation(line: 3395, column: 18, scope: !869)
!872 = !DILocation(line: 3395, column: 13, scope: !869)
!873 = !DILocation(line: 3396, column: 18, scope: !869)
!874 = !DILocation(line: 3396, column: 13, scope: !869)
!875 = !DILocation(line: 3397, column: 18, scope: !869)
!876 = !DILocation(line: 3397, column: 13, scope: !869)
!877 = !DILocation(line: 3398, column: 13, scope: !869)
!878 = !DILocation(line: 3400, column: 13, scope: !842)
!879 = !DILocation(line: 3401, column: 9, scope: !842)
!880 = !DILocation(line: 3402, column: 16, scope: !881)
!881 = distinct !DILexicalBlock(scope: !842, file: !424, line: 3402, column: 9)
!882 = !DILocation(line: 3402, column: 14, scope: !881)
!883 = !DILocation(line: 3402, column: 21, scope: !884)
!884 = distinct !DILexicalBlock(scope: !881, file: !424, line: 3402, column: 9)
!885 = !DILocation(line: 3402, column: 25, scope: !884)
!886 = !DILocation(line: 3402, column: 23, scope: !884)
!887 = !DILocation(line: 3402, column: 9, scope: !881)
!888 = !DILocation(line: 3403, column: 60, scope: !889)
!889 = distinct !DILexicalBlock(scope: !884, file: !424, line: 3402, column: 36)
!890 = !DILocation(line: 3403, column: 65, scope: !889)
!891 = !DILocation(line: 3403, column: 44, scope: !889)
!892 = !DILocation(line: 3403, column: 29, scope: !889)
!893 = !DILocation(line: 3403, column: 39, scope: !889)
!894 = !DILocation(line: 3403, column: 42, scope: !889)
!895 = !DILocation(line: 3403, column: 13, scope: !889)
!896 = !DILocation(line: 3403, column: 24, scope: !889)
!897 = !DILocation(line: 3403, column: 27, scope: !889)
!898 = !DILocation(line: 3404, column: 18, scope: !899)
!899 = distinct !DILexicalBlock(scope: !889, file: !424, line: 3404, column: 17)
!900 = !DILocation(line: 3404, column: 28, scope: !899)
!901 = !DILocation(line: 3404, column: 17, scope: !899)
!902 = !DILocation(line: 3404, column: 36, scope: !899)
!903 = !DILocation(line: 3404, column: 32, scope: !899)
!904 = !DILocation(line: 3405, column: 9, scope: !889)
!905 = !DILocation(line: 3402, column: 32, scope: !884)
!906 = !DILocation(line: 3402, column: 9, scope: !884)
!907 = distinct !{!907, !887, !908, !909}
!908 = !DILocation(line: 3405, column: 9, scope: !881)
!909 = !{!"llvm.loop.mustprogress"}
!910 = !DILocation(line: 3406, column: 27, scope: !842)
!911 = !DILocation(line: 3406, column: 9, scope: !842)
!912 = !DILocation(line: 3407, column: 14, scope: !842)
!913 = !DILocation(line: 3407, column: 9, scope: !842)
!914 = !DILocation(line: 3408, column: 13, scope: !915)
!915 = distinct !DILexicalBlock(scope: !842, file: !424, line: 3408, column: 13)
!916 = !DILocation(line: 3408, column: 17, scope: !915)
!917 = !DILocation(line: 3409, column: 30, scope: !915)
!918 = !DILocation(line: 3409, column: 36, scope: !915)
!919 = !DILocation(line: 3409, column: 19, scope: !915)
!920 = !DILocation(line: 3409, column: 17, scope: !915)
!921 = !DILocation(line: 3409, column: 13, scope: !915)
!922 = !DILocation(line: 3410, column: 16, scope: !923)
!923 = distinct !DILexicalBlock(scope: !842, file: !424, line: 3410, column: 9)
!924 = !DILocation(line: 3410, column: 14, scope: !923)
!925 = !DILocation(line: 3410, column: 21, scope: !926)
!926 = distinct !DILexicalBlock(scope: !923, file: !424, line: 3410, column: 9)
!927 = !DILocation(line: 3410, column: 25, scope: !926)
!928 = !DILocation(line: 3410, column: 23, scope: !926)
!929 = !DILocation(line: 3410, column: 9, scope: !923)
!930 = !DILocation(line: 3411, column: 27, scope: !931)
!931 = distinct !DILexicalBlock(scope: !926, file: !424, line: 3410, column: 36)
!932 = !DILocation(line: 3411, column: 38, scope: !931)
!933 = !DILocation(line: 3411, column: 13, scope: !931)
!934 = !DILocation(line: 3412, column: 9, scope: !931)
!935 = !DILocation(line: 3410, column: 32, scope: !926)
!936 = !DILocation(line: 3410, column: 9, scope: !926)
!937 = distinct !{!937, !929, !938, !909}
!938 = !DILocation(line: 3412, column: 9, scope: !923)
!939 = !DILocation(line: 3413, column: 14, scope: !842)
!940 = !DILocation(line: 3413, column: 9, scope: !842)
!941 = !DILocation(line: 3414, column: 14, scope: !842)
!942 = !DILocation(line: 3414, column: 9, scope: !842)
!943 = !DILocation(line: 3415, column: 16, scope: !842)
!944 = !DILocation(line: 3415, column: 9, scope: !842)
!945 = !DILocation(line: 3417, column: 1, scope: !827)
!946 = distinct !DISubprogram(name: "__Pyx_main", scope: !424, file: !424, line: 3328, type: !947, scopeLine: 3330, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !577)
!947 = !DISubroutineType(types: !948)
!948 = !{!7, !7, !29}
!949 = !DILocalVariable(name: "argc", arg: 1, scope: !946, file: !424, line: 3328, type: !7)
!950 = !DILocation(line: 3328, column: 27, scope: !946)
!951 = !DILocalVariable(name: "argv", arg: 2, scope: !946, file: !424, line: 3328, type: !29)
!952 = !DILocation(line: 3328, column: 43, scope: !946)
!953 = !DILocation(line: 3341, column: 9, scope: !954)
!954 = distinct !DILexicalBlock(scope: !946, file: !424, line: 3341, column: 9)
!955 = !DILocation(line: 3341, column: 61, scope: !954)
!956 = !DILocation(line: 3341, column: 66, scope: !954)
!957 = !DILocalVariable(name: "status", scope: !958, file: !424, line: 3343, type: !959)
!958 = distinct !DILexicalBlock(scope: !946, file: !424, line: 3342, column: 5)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyStatus", file: !13, line: 19, baseType: !14)
!960 = !DILocation(line: 3343, column: 18, scope: !958)
!961 = !DILocalVariable(name: "config", scope: !958, file: !424, line: 3344, type: !962)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyConfig", file: !13, line: 244, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyConfig", file: !13, line: 134, size: 3648, elements: !964)
!964 = !{!965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_config_init", scope: !963, file: !13, line: 135, baseType: !7, size: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "isolated", scope: !963, file: !13, line: 137, baseType: !7, size: 32, offset: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "use_environment", scope: !963, file: !13, line: 138, baseType: !7, size: 32, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "dev_mode", scope: !963, file: !13, line: 139, baseType: !7, size: 32, offset: 96)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "install_signal_handlers", scope: !963, file: !13, line: 140, baseType: !7, size: 32, offset: 128)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "use_hash_seed", scope: !963, file: !13, line: 141, baseType: !7, size: 32, offset: 160)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "hash_seed", scope: !963, file: !13, line: 142, baseType: !38, size: 64, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "faulthandler", scope: !963, file: !13, line: 143, baseType: !7, size: 32, offset: 256)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "tracemalloc", scope: !963, file: !13, line: 144, baseType: !7, size: 32, offset: 288)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "perf_profiling", scope: !963, file: !13, line: 145, baseType: !7, size: 32, offset: 320)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "remote_debug", scope: !963, file: !13, line: 146, baseType: !7, size: 32, offset: 352)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "import_time", scope: !963, file: !13, line: 147, baseType: !7, size: 32, offset: 384)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "code_debug_ranges", scope: !963, file: !13, line: 148, baseType: !7, size: 32, offset: 416)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "show_ref_count", scope: !963, file: !13, line: 149, baseType: !7, size: 32, offset: 448)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "dump_refs", scope: !963, file: !13, line: 150, baseType: !7, size: 32, offset: 480)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "dump_refs_file", scope: !963, file: !13, line: 151, baseType: !30, size: 64, offset: 512)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_stats", scope: !963, file: !13, line: 152, baseType: !7, size: 32, offset: 576)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "filesystem_encoding", scope: !963, file: !13, line: 153, baseType: !30, size: 64, offset: 640)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "filesystem_errors", scope: !963, file: !13, line: 154, baseType: !30, size: 64, offset: 704)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "pycache_prefix", scope: !963, file: !13, line: 155, baseType: !30, size: 64, offset: 768)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "parse_argv", scope: !963, file: !13, line: 156, baseType: !7, size: 32, offset: 832)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "orig_argv", scope: !963, file: !13, line: 157, baseType: !987, size: 128, offset: 896)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyWideStringList", file: !13, line: 36, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 31, size: 128, elements: !989)
!989 = !{!990, !991}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !988, file: !13, line: 34, baseType: !75, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !988, file: !13, line: 35, baseType: !29, size: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !963, file: !13, line: 158, baseType: !987, size: 128, offset: 1024)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "xoptions", scope: !963, file: !13, line: 159, baseType: !987, size: 128, offset: 1152)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "warnoptions", scope: !963, file: !13, line: 160, baseType: !987, size: 128, offset: 1280)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "site_import", scope: !963, file: !13, line: 161, baseType: !7, size: 32, offset: 1408)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_warning", scope: !963, file: !13, line: 162, baseType: !7, size: 32, offset: 1440)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "warn_default_encoding", scope: !963, file: !13, line: 163, baseType: !7, size: 32, offset: 1472)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "inspect", scope: !963, file: !13, line: 164, baseType: !7, size: 32, offset: 1504)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !963, file: !13, line: 165, baseType: !7, size: 32, offset: 1536)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "optimization_level", scope: !963, file: !13, line: 166, baseType: !7, size: 32, offset: 1568)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "parser_debug", scope: !963, file: !13, line: 167, baseType: !7, size: 32, offset: 1600)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "write_bytecode", scope: !963, file: !13, line: 168, baseType: !7, size: 32, offset: 1632)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !963, file: !13, line: 169, baseType: !7, size: 32, offset: 1664)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !963, file: !13, line: 170, baseType: !7, size: 32, offset: 1696)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "user_site_directory", scope: !963, file: !13, line: 171, baseType: !7, size: 32, offset: 1728)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "configure_c_stdio", scope: !963, file: !13, line: 172, baseType: !7, size: 32, offset: 1760)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "buffered_stdio", scope: !963, file: !13, line: 173, baseType: !7, size: 32, offset: 1792)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "stdio_encoding", scope: !963, file: !13, line: 174, baseType: !30, size: 64, offset: 1856)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "stdio_errors", scope: !963, file: !13, line: 175, baseType: !30, size: 64, offset: 1920)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "check_hash_pycs_mode", scope: !963, file: !13, line: 179, baseType: !30, size: 64, offset: 1984)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "use_frozen_modules", scope: !963, file: !13, line: 180, baseType: !7, size: 32, offset: 2048)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "safe_path", scope: !963, file: !13, line: 181, baseType: !7, size: 32, offset: 2080)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "int_max_str_digits", scope: !963, file: !13, line: 182, baseType: !7, size: 32, offset: 2112)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "thread_inherit_context", scope: !963, file: !13, line: 183, baseType: !7, size: 32, offset: 2144)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "context_aware_warnings", scope: !963, file: !13, line: 184, baseType: !7, size: 32, offset: 2176)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "use_system_logger", scope: !963, file: !13, line: 186, baseType: !7, size: 32, offset: 2208)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_count", scope: !963, file: !13, line: 189, baseType: !7, size: 32, offset: 2240)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "pathconfig_warnings", scope: !963, file: !13, line: 196, baseType: !7, size: 32, offset: 2272)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "program_name", scope: !963, file: !13, line: 197, baseType: !30, size: 64, offset: 2304)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "pythonpath_env", scope: !963, file: !13, line: 198, baseType: !30, size: 64, offset: 2368)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "home", scope: !963, file: !13, line: 199, baseType: !30, size: 64, offset: 2432)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "platlibdir", scope: !963, file: !13, line: 200, baseType: !30, size: 64, offset: 2496)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "module_search_paths_set", scope: !963, file: !13, line: 203, baseType: !7, size: 32, offset: 2560)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "module_search_paths", scope: !963, file: !13, line: 204, baseType: !987, size: 128, offset: 2624)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "stdlib_dir", scope: !963, file: !13, line: 205, baseType: !30, size: 64, offset: 2752)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "executable", scope: !963, file: !13, line: 206, baseType: !30, size: 64, offset: 2816)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "base_executable", scope: !963, file: !13, line: 207, baseType: !30, size: 64, offset: 2880)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !963, file: !13, line: 208, baseType: !30, size: 64, offset: 2944)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "base_prefix", scope: !963, file: !13, line: 209, baseType: !30, size: 64, offset: 3008)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "exec_prefix", scope: !963, file: !13, line: 210, baseType: !30, size: 64, offset: 3072)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "base_exec_prefix", scope: !963, file: !13, line: 211, baseType: !30, size: 64, offset: 3136)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "skip_source_first_line", scope: !963, file: !13, line: 214, baseType: !7, size: 32, offset: 3200)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "run_command", scope: !963, file: !13, line: 215, baseType: !30, size: 64, offset: 3264)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "run_module", scope: !963, file: !13, line: 216, baseType: !30, size: 64, offset: 3328)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "run_filename", scope: !963, file: !13, line: 217, baseType: !30, size: 64, offset: 3392)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "sys_path_0", scope: !963, file: !13, line: 220, baseType: !30, size: 64, offset: 3456)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "_install_importlib", scope: !963, file: !13, line: 226, baseType: !7, size: 32, offset: 3520)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "_init_main", scope: !963, file: !13, line: 229, baseType: !7, size: 32, offset: 3552)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "_is_python_build", scope: !963, file: !13, line: 232, baseType: !7, size: 32, offset: 3584)
!1040 = !DILocation(line: 3344, column: 18, scope: !958)
!1041 = !DILocation(line: 3345, column: 9, scope: !958)
!1042 = !DILocation(line: 3346, column: 16, scope: !958)
!1043 = !DILocation(line: 3346, column: 27, scope: !958)
!1044 = !DILocation(line: 3347, column: 13, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !958, file: !424, line: 3347, column: 13)
!1046 = !DILocation(line: 3347, column: 18, scope: !1045)
!1047 = !DILocation(line: 3347, column: 21, scope: !1045)
!1048 = !DILocation(line: 3348, column: 58, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !1045, file: !424, line: 3347, column: 27)
!1050 = !DILocation(line: 3348, column: 72, scope: !1049)
!1051 = !DILocation(line: 3348, column: 22, scope: !1049)
!1052 = !DILocation(line: 3349, column: 17, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1049, file: !424, line: 3349, column: 17)
!1054 = !DILocation(line: 3350, column: 17, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1053, file: !424, line: 3349, column: 45)
!1056 = !DILocation(line: 3351, column: 17, scope: !1055)
