; ModuleID = 'dataset/cases/goeq-ojva-0009/artifacts/cython-clang-llvm-o0-embed-v1/prog_a/program.c'
source_filename = "dataset/cases/goeq-ojva-0009/artifacts/cython-clang-llvm-o0-embed-v1/prog_a/program.c"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx14.0.0"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr }
%struct.PyModuleDef_Base = type { %struct._object, ptr, i64, ptr }
%struct._object = type { %union.anon, ptr }
%union.anon = type { i64 }
%struct.PyMethodDef = type { ptr, ptr, i32, ptr }
%struct.__pyx_mstatetype = type { ptr, ptr, ptr, ptr, ptr, ptr, [21 x ptr], [5 x ptr], %struct.__Pyx_CodeObjectCache }
%struct.__Pyx_CodeObjectCache = type { i32, i32, ptr }
%struct._typeobject = type { %struct.PyVarObject, ptr, i64, i64, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, ptr, i8, i16 }
%struct.PyVarObject = type { %struct._object, i64 }
%struct.anon.1 = type { i8, [3 x i8] }
%struct._longobject = type { %struct._object, %struct._PyLongValue }
%struct._PyLongValue = type { i64, [1 x i32] }
%struct.PyStatus = type { i32, ptr, ptr, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__pyx_module_is_main_original", scope: !2, file: !505, line: 1933, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Homebrew clang version 20.1.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !34, globals: !567, splitDebugInlining: false, nameTableKind: Apple, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk", sdk: "MacOSX14.sdk")
!3 = !DIFile(filename: "dataset/cases/goeq-ojva-0009/artifacts/cython-clang-llvm-o0-embed-v1/prog_a/program.c", directory: ".")
!4 = !{!5, !12, !19}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 695, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/object.h", directory: "")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "PYGEN_RETURN", value: 0)
!10 = !DIEnumerator(name: "PYGEN_ERROR", value: -1)
!11 = !DIEnumerator(name: "PYGEN_NEXT", value: 1)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !13, line: 245, baseType: !14, size: 32, elements: !15)
!13 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/unicodeobject.h", directory: "")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16, !17, !18}
!16 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!17 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!18 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !21, file: !20, line: 11, baseType: !14, size: 32, elements: !30)
!20 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/initconfig.h", directory: "")
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !20, line: 10, size: 256, elements: !22)
!22 = !{!23, !24, !28, !29}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_type", scope: !21, file: !20, line: 15, baseType: !19, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !21, file: !20, line: 16, baseType: !25, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!27 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "err_msg", scope: !21, file: !20, line: 17, baseType: !25, size: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "exitcode", scope: !21, file: !20, line: 18, baseType: !7, size: 32, offset: 192)
!30 = !{!31, !32, !33}
!31 = !DIEnumerator(name: "_PyStatus_TYPE_OK", value: 0)
!32 = !DIEnumerator(name: "_PyStatus_TYPE_ERROR", value: 1)
!33 = !DIEnumerator(name: "_PyStatus_TYPE_EXIT", value: 2)
!34 = !{!35, !41, !45, !46, !373, !81, !7, !25, !101, !375, !386, !397, !70, !412, !421, !422, !438, !446, !448, !455, !476, !478, !480, !86, !44, !482, !483, !490, !503}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !38, line: 34, baseType: !39)
!38 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_wchar_t.h", directory: "")
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wchar_t", file: !40, line: 82, baseType: !7)
!40 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/arm/_types.h", directory: "")
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !42, line: 31, baseType: !43)
!42 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !40, line: 70, baseType: !44)
!44 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !48, line: 18, baseType: !49)
!48 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pytypedefs.h", directory: "")
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !6, line: 110, size: 128, elements: !50)
!50 = !{!51, !69}
!51 = !DIDerivedType(tag: DW_TAG_member, scope: !49, file: !6, line: 122, baseType: !52, size: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !49, file: !6, line: 122, size: 64, elements: !53)
!53 = !{!54, !58}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt_full", scope: !52, file: !6, line: 124, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !56, line: 30, baseType: !57)
!56 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_int64_t.h", directory: "")
!57 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, scope: !52, file: !6, line: 125, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !52, file: !6, line: 125, size: 64, elements: !60)
!60 = !{!61, !64, !68}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !59, file: !6, line: 131, baseType: !62, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !63, line: 31, baseType: !14)
!63 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint32_t.h", directory: "")
!64 = !DIDerivedType(tag: DW_TAG_member, name: "ob_overflow", scope: !59, file: !6, line: 132, baseType: !65, size: 16, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !66, line: 31, baseType: !67)
!66 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint16_t.h", directory: "")
!67 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ob_flags", scope: !59, file: !6, line: 133, baseType: !65, size: 16, offset: 48)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !49, file: !6, line: 144, baseType: !70, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !48, line: 20, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !73, line: 148, size: 3328, elements: !74)
!73 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/object.h", directory: "")
!74 = !{!75, !87, !88, !89, !90, !95, !96, !102, !107, !126, !128, !181, !212, !224, !230, !231, !232, !234, !236, !268, !269, !270, !279, !280, !285, !286, !288, !290, !301, !312, !330, !331, !332, !334, !336, !337, !339, !344, !349, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !370, !372}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !72, file: !73, line: 149, baseType: !76, size: 192)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !6, line: 172, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 169, size: 192, elements: !78)
!78 = !{!79, !80}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !77, file: !6, line: 170, baseType: !47, size: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !77, file: !6, line: 171, baseType: !81, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !82, line: 156, baseType: !83)
!82 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pyport.h", directory: "")
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !84, line: 31, baseType: !85)
!84 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_ssize_t.h", directory: "")
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ssize_t", file: !40, line: 97, baseType: !86)
!86 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !72, file: !73, line: 150, baseType: !25, size: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !72, file: !73, line: 151, baseType: !81, size: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !72, file: !73, line: 151, baseType: !81, size: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !72, file: !73, line: 155, baseType: !91, size: 64, offset: 384)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !6, line: 353, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !46}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall_offset", scope: !72, file: !73, line: 156, baseType: !81, size: 64, offset: 448)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !72, file: !73, line: 157, baseType: !97, size: 64, offset: 512)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !6, line: 354, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!46, !46, !101}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !72, file: !73, line: 158, baseType: !103, size: 64, offset: 576)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !6, line: 356, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!7, !46, !101, !46}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_async", scope: !72, file: !73, line: 159, baseType: !108, size: 64, offset: 640)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyAsyncMethods", file: !73, line: 135, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 130, size: 256, elements: !111)
!111 = !{!112, !117, !118, !119}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "am_await", scope: !110, file: !73, line: 131, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !6, line: 336, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!46, !46}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "am_aiter", scope: !110, file: !73, line: 132, baseType: !113, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "am_anext", scope: !110, file: !73, line: 133, baseType: !113, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "am_send", scope: !110, file: !73, line: 134, baseType: !120, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "sendfunc", file: !73, line: 128, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!124, !46, !46, !125}
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySendResult", file: !6, line: 699, baseType: !5)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !72, file: !73, line: 161, baseType: !127, size: 64, offset: 704)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !6, line: 358, baseType: !114)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !72, file: !73, line: 165, baseType: !129, size: 64, offset: 768)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !73, line: 106, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 61, size: 2304, elements: !132)
!132 = !{!133, !138, !139, !140, !141, !142, !147, !148, !149, !150, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !131, file: !73, line: 66, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !6, line: 337, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!46, !46, !46}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !131, file: !73, line: 67, baseType: !134, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !131, file: !73, line: 68, baseType: !134, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !131, file: !73, line: 69, baseType: !134, size: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !131, file: !73, line: 70, baseType: !134, size: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !131, file: !73, line: 71, baseType: !143, size: 64, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !6, line: 338, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!46, !46, !46, !46}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !131, file: !73, line: 72, baseType: !113, size: 64, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !131, file: !73, line: 73, baseType: !113, size: 64, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !131, file: !73, line: 74, baseType: !113, size: 64, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !131, file: !73, line: 75, baseType: !151, size: 64, offset: 576)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !6, line: 339, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!7, !46}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !131, file: !73, line: 76, baseType: !113, size: 64, offset: 640)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !131, file: !73, line: 77, baseType: !134, size: 64, offset: 704)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !131, file: !73, line: 78, baseType: !134, size: 64, offset: 768)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !131, file: !73, line: 79, baseType: !134, size: 64, offset: 832)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !131, file: !73, line: 80, baseType: !134, size: 64, offset: 896)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !131, file: !73, line: 81, baseType: !134, size: 64, offset: 960)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !131, file: !73, line: 82, baseType: !113, size: 64, offset: 1024)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !131, file: !73, line: 83, baseType: !45, size: 64, offset: 1088)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !131, file: !73, line: 84, baseType: !113, size: 64, offset: 1152)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !131, file: !73, line: 86, baseType: !134, size: 64, offset: 1216)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !131, file: !73, line: 87, baseType: !134, size: 64, offset: 1280)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !131, file: !73, line: 88, baseType: !134, size: 64, offset: 1344)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !131, file: !73, line: 89, baseType: !134, size: 64, offset: 1408)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !131, file: !73, line: 90, baseType: !143, size: 64, offset: 1472)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !131, file: !73, line: 91, baseType: !134, size: 64, offset: 1536)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !131, file: !73, line: 92, baseType: !134, size: 64, offset: 1600)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !131, file: !73, line: 93, baseType: !134, size: 64, offset: 1664)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !131, file: !73, line: 94, baseType: !134, size: 64, offset: 1728)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !131, file: !73, line: 95, baseType: !134, size: 64, offset: 1792)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !131, file: !73, line: 97, baseType: !134, size: 64, offset: 1856)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !131, file: !73, line: 98, baseType: !134, size: 64, offset: 1920)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !131, file: !73, line: 99, baseType: !134, size: 64, offset: 1984)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !131, file: !73, line: 100, baseType: !134, size: 64, offset: 2048)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !131, file: !73, line: 102, baseType: !113, size: 64, offset: 2112)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_matrix_multiply", scope: !131, file: !73, line: 104, baseType: !134, size: 64, offset: 2176)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_matrix_multiply", scope: !131, file: !73, line: 105, baseType: !134, size: 64, offset: 2240)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !72, file: !73, line: 166, baseType: !182, size: 64, offset: 832)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !73, line: 120, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 108, size: 640, elements: !185)
!185 = !{!186, !191, !192, !197, !198, !199, !204, !205, !210, !211}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !184, file: !73, line: 109, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !6, line: 340, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!81, !46}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !184, file: !73, line: 110, baseType: !134, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !184, file: !73, line: 111, baseType: !193, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !6, line: 341, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!46, !46, !81}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !184, file: !73, line: 112, baseType: !193, size: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !184, file: !73, line: 113, baseType: !45, size: 64, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !184, file: !73, line: 114, baseType: !200, size: 64, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !6, line: 343, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!7, !46, !81, !46}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !184, file: !73, line: 115, baseType: !45, size: 64, offset: 384)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !184, file: !73, line: 116, baseType: !206, size: 64, offset: 448)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !6, line: 347, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!7, !46, !46}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !184, file: !73, line: 118, baseType: !134, size: 64, offset: 512)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !184, file: !73, line: 119, baseType: !193, size: 64, offset: 576)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !72, file: !73, line: 167, baseType: !213, size: 64, offset: 896)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !73, line: 126, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 122, size: 192, elements: !216)
!216 = !{!217, !218, !219}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !215, file: !73, line: 123, baseType: !187, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !215, file: !73, line: 124, baseType: !134, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !215, file: !73, line: 125, baseType: !220, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !6, line: 345, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!7, !46, !46, !46}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !72, file: !73, line: 171, baseType: !225, size: 64, offset: 960)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !6, line: 359, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!229, !46}
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !82, line: 170, baseType: !81)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !72, file: !73, line: 172, baseType: !143, size: 64, offset: 1024)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !72, file: !73, line: 173, baseType: !127, size: 64, offset: 1088)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !72, file: !73, line: 174, baseType: !233, size: 64, offset: 1152)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !6, line: 355, baseType: !135)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !72, file: !73, line: 175, baseType: !235, size: 64, offset: 1216)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !6, line: 357, baseType: !221)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !72, file: !73, line: 178, baseType: !237, size: 64, offset: 1280)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !73, line: 140, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 137, size: 128, elements: !240)
!240 = !{!241, !263}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !239, file: !73, line: 138, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !243, line: 35, baseType: !244)
!243 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pybuffer.h", directory: "")
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!7, !46, !247, !7}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !243, line: 33, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !243, line: 20, size: 640, elements: !250)
!250 = !{!251, !252, !253, !254, !255, !256, !257, !258, !260, !261, !262}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !249, file: !243, line: 21, baseType: !45, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !249, file: !243, line: 22, baseType: !46, size: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !249, file: !243, line: 23, baseType: !81, size: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !249, file: !243, line: 24, baseType: !81, size: 64, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !249, file: !243, line: 26, baseType: !7, size: 32, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !249, file: !243, line: 27, baseType: !7, size: 32, offset: 288)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !249, file: !243, line: 28, baseType: !101, size: 64, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !249, file: !243, line: 29, baseType: !259, size: 64, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !249, file: !243, line: 30, baseType: !259, size: 64, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !249, file: !243, line: 31, baseType: !259, size: 64, offset: 512)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !249, file: !243, line: 32, baseType: !45, size: 64, offset: 576)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !239, file: !73, line: 139, baseType: !264, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !243, line: 36, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !46, !247}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !72, file: !73, line: 181, baseType: !44, size: 64, offset: 1344)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !72, file: !73, line: 183, baseType: !25, size: 64, offset: 1408)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !72, file: !73, line: 187, baseType: !271, size: 64, offset: 1472)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !6, line: 349, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!7, !46, !275, !45}
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !6, line: 348, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!7, !46, !45}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !72, file: !73, line: 190, baseType: !151, size: 64, offset: 1536)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !72, file: !73, line: 194, baseType: !281, size: 64, offset: 1600)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !6, line: 360, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!46, !46, !46, !7}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !72, file: !73, line: 197, baseType: !81, size: 64, offset: 1664)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !72, file: !73, line: 200, baseType: !287, size: 64, offset: 1728)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !6, line: 361, baseType: !114)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !72, file: !73, line: 201, baseType: !289, size: 64, offset: 1792)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !6, line: 362, baseType: !114)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !72, file: !73, line: 204, baseType: !291, size: 64, offset: 1856)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !48, line: 14, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !294, line: 68, size: 256, elements: !295)
!294 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/methodobject.h", directory: "")
!295 = !{!296, !297, !299, !300}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !293, file: !294, line: 69, baseType: !25, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !293, file: !294, line: 70, baseType: !298, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !294, line: 19, baseType: !135)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !293, file: !294, line: 71, baseType: !7, size: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !293, file: !294, line: 73, baseType: !25, size: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !72, file: !73, line: 205, baseType: !302, size: 64, offset: 1920)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !48, line: 16, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !305, line: 41, size: 320, elements: !306)
!305 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/descrobject.h", directory: "")
!306 = !{!307, !308, !309, !310, !311}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !304, file: !305, line: 42, baseType: !25, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !304, file: !305, line: 43, baseType: !7, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !304, file: !305, line: 44, baseType: !81, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !304, file: !305, line: 45, baseType: !7, size: 32, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !304, file: !305, line: 46, baseType: !25, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !72, file: !73, line: 206, baseType: !313, size: 64, offset: 1984)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGetSetDef", file: !48, line: 15, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !305, line: 11, size: 320, elements: !316)
!316 = !{!317, !318, !323, !328, !329}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !315, file: !305, line: 12, baseType: !25, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !315, file: !305, line: 13, baseType: !319, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !305, line: 8, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!46, !46, !45}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !315, file: !305, line: 14, baseType: !324, size: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !305, line: 9, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!7, !46, !46, !45}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !315, file: !305, line: 15, baseType: !25, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !315, file: !305, line: 16, baseType: !45, size: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !72, file: !73, line: 208, baseType: !70, size: 64, offset: 2048)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !72, file: !73, line: 209, baseType: !46, size: 64, offset: 2112)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !72, file: !73, line: 210, baseType: !333, size: 64, offset: 2176)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !6, line: 363, baseType: !144)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !72, file: !73, line: 211, baseType: !335, size: 64, offset: 2240)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !6, line: 364, baseType: !221)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !72, file: !73, line: 212, baseType: !81, size: 64, offset: 2304)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !72, file: !73, line: 213, baseType: !338, size: 64, offset: 2368)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !6, line: 365, baseType: !221)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !72, file: !73, line: 214, baseType: !340, size: 64, offset: 2432)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !6, line: 367, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!46, !70, !81}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !72, file: !73, line: 215, baseType: !345, size: 64, offset: 2496)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !6, line: 366, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!46, !70, !46, !46}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !72, file: !73, line: 216, baseType: !350, size: 64, offset: 2560)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !6, line: 352, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !45}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !72, file: !73, line: 217, baseType: !151, size: 64, offset: 2624)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !72, file: !73, line: 218, baseType: !46, size: 64, offset: 2688)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !72, file: !73, line: 219, baseType: !46, size: 64, offset: 2752)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !72, file: !73, line: 220, baseType: !46, size: 64, offset: 2816)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !72, file: !73, line: 221, baseType: !45, size: 64, offset: 2880)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !72, file: !73, line: 222, baseType: !46, size: 64, offset: 2944)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !72, file: !73, line: 223, baseType: !91, size: 64, offset: 3008)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !72, file: !73, line: 228, baseType: !14, size: 32, offset: 3072)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !72, file: !73, line: 230, baseType: !91, size: 64, offset: 3136)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall", scope: !72, file: !73, line: 231, baseType: !364, size: 64, offset: 3200)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "vectorcallfunc", file: !6, line: 370, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!46, !46, !368, !41, !46}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tp_watched", scope: !72, file: !73, line: 234, baseType: !371, size: 8, offset: 3264)
!371 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tp_versions_used", scope: !72, file: !73, line: 241, baseType: !65, size: 16, offset: 3280)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !374, line: 30, baseType: !7)
!374 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_int32_t.h", directory: "")
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !377, line: 15, baseType: !378)
!377 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/bytesobject.h", directory: "")
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !377, line: 5, size: 320, elements: !379)
!379 = !{!380, !381, !382}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !378, file: !377, line: 6, baseType: !76, size: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !378, file: !377, line: 7, baseType: !229, size: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !378, file: !377, line: 8, baseType: !383, size: 8, offset: 256)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 1)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunctionObject", file: !388, line: 14, baseType: !389)
!388 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/methodobject.h", directory: "")
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !388, line: 7, size: 448, elements: !390)
!390 = !{!391, !392, !393, !394, !395, !396}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !389, file: !388, line: 8, baseType: !47, size: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "m_ml", scope: !389, file: !388, line: 9, baseType: !291, size: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "m_self", scope: !389, file: !388, line: 10, baseType: !46, size: 64, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "m_module", scope: !389, file: !388, line: 11, baseType: !46, size: 64, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "m_weakreflist", scope: !389, file: !388, line: 12, baseType: !46, size: 64, offset: 320)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "vectorcall", scope: !389, file: !388, line: 13, baseType: !364, size: 64, offset: 384)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !13, line: 163, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 54, size: 320, elements: !400)
!400 = !{!401, !402, !403, !404}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !399, file: !13, line: 99, baseType: !47, size: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !399, file: !13, line: 100, baseType: !81, size: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !399, file: !13, line: 101, baseType: !229, size: 64, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !399, file: !13, line: 162, baseType: !405, size: 32, offset: 256)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !399, file: !13, line: 107, size: 32, elements: !406)
!406 = !{!407, !408, !409, !410, !411}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !405, file: !13, line: 121, baseType: !14, size: 2, flags: DIFlagBitField, extraData: i64 0)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !405, file: !13, line: 145, baseType: !14, size: 3, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !405, file: !13, line: 150, baseType: !14, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !405, file: !13, line: 154, baseType: !14, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "statically_allocated", scope: !405, file: !13, line: 156, baseType: !14, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !414, line: 13, baseType: !415)
!414 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/tupleobject.h", directory: "")
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !414, line: 5, size: 320, elements: !416)
!416 = !{!417, !418, !419}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !415, file: !414, line: 6, baseType: !76, size: 192)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ob_hash", scope: !415, file: !414, line: 8, baseType: !229, size: 64, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !415, file: !414, line: 12, baseType: !420, size: 64, offset: 256)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 64, elements: !384)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyLongObject", file: !48, line: 19, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_longobject", file: !425, line: 98, size: 256, elements: !426)
!425 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/longintrepr.h", directory: "")
!426 = !{!427, !428}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !424, file: !425, line: 99, baseType: !47, size: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "long_value", scope: !424, file: !425, line: 100, baseType: !429, size: 128, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyLongValue", file: !425, line: 96, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PyLongValue", file: !425, line: 93, size: 128, elements: !431)
!431 = !{!432, !435}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "lv_tag", scope: !430, file: !425, line: 94, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !434, line: 34, baseType: !44)
!434 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ob_digit", scope: !430, file: !425, line: 95, baseType: !436, size: 32, offset: 64)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 32, elements: !384)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "digit", file: !425, line: 43, baseType: !62)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !440, line: 22, baseType: !441)
!440 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/listobject.h", directory: "")
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !440, line: 5, size: 320, elements: !442)
!442 = !{!443, !444, !445}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !441, file: !440, line: 6, baseType: !76, size: 192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !441, file: !440, line: 8, baseType: !125, size: 64, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !441, file: !440, line: 21, baseType: !81, size: 64, offset: 256)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !13, line: 173, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 168, size: 448, elements: !451)
!451 = !{!452, !453, !454}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !450, file: !13, line: 169, baseType: !398, size: 320)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !450, file: !13, line: 170, baseType: !81, size: 64, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !450, file: !13, line: 172, baseType: !101, size: 64, offset: 384)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !13, line: 184, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 176, size: 512, elements: !458)
!458 = !{!459, !460}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !457, file: !13, line: 177, baseType: !449, size: 448)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !457, file: !13, line: 183, baseType: !461, size: 64, offset: 448)
!461 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !457, file: !13, line: 178, size: 64, elements: !462)
!462 = !{!463, !464, !470, !473}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !461, file: !13, line: 179, baseType: !45, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !461, file: !13, line: 180, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !467, line: 96, baseType: !468)
!467 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/unicodeobject.h", directory: "")
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !469, line: 31, baseType: !371)
!469 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint8_t.h", directory: "")
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !461, file: !13, line: 181, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !467, line: 95, baseType: !65)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !461, file: !13, line: 182, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !467, line: 94, baseType: !62)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !472)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !475)
!482 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFloatObject", file: !485, line: 8, baseType: !486)
!485 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/floatobject.h", directory: "")
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !485, line: 5, size: 192, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !486, file: !485, line: 6, baseType: !47, size: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ob_fval", scope: !486, file: !485, line: 7, baseType: !482, size: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBaseExceptionObject", file: !492, line: 15, baseType: !493)
!492 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/pyerrors.h", directory: "")
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !492, line: 13, size: 576, elements: !494)
!494 = !{!495, !496, !497, !498, !499, !500, !501, !502}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !493, file: !492, line: 14, baseType: !47, size: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !493, file: !492, line: 14, baseType: !46, size: 64, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !493, file: !492, line: 14, baseType: !46, size: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !493, file: !492, line: 14, baseType: !46, size: 64, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", scope: !493, file: !492, line: 14, baseType: !46, size: 64, offset: 320)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !493, file: !492, line: 14, baseType: !46, size: 64, offset: 384)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "cause", scope: !493, file: !492, line: 14, baseType: !46, size: 64, offset: 448)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_context", scope: !493, file: !492, line: 14, baseType: !27, size: 8, offset: 512)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CodeObjectCacheEntry", file: !505, line: 1767, baseType: !506)
!505 = !DIFile(filename: "dataset/cases/goeq-ojva-0009/artifacts/cython-clang-llvm-o0-embed-v1/prog_a/program.c", directory: ".")
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !505, line: 1764, size: 128, elements: !507)
!507 = !{!508, !566}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "code_object", scope: !506, file: !505, line: 1765, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CachedCodeObjectType", file: !505, line: 1762, baseType: !511)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !48, line: 21, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyCodeObject", file: !513, line: 115, size: 1728, elements: !514)
!513 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/code.h", directory: "")
!514 = !{!515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !549, !558, !559, !562, !563, !564, !565}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !512, file: !513, line: 115, baseType: !76, size: 192)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !512, file: !513, line: 115, baseType: !46, size: 64, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !512, file: !513, line: 115, baseType: !46, size: 64, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "co_exceptiontable", scope: !512, file: !513, line: 115, baseType: !46, size: 64, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !512, file: !513, line: 115, baseType: !7, size: 32, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !512, file: !513, line: 115, baseType: !7, size: 32, offset: 416)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "co_posonlyargcount", scope: !512, file: !513, line: 115, baseType: !7, size: 32, offset: 448)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !512, file: !513, line: 115, baseType: !7, size: 32, offset: 480)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !512, file: !513, line: 115, baseType: !7, size: 32, offset: 512)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !512, file: !513, line: 115, baseType: !7, size: 32, offset: 544)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocalsplus", scope: !512, file: !513, line: 115, baseType: !7, size: 32, offset: 576)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "co_framesize", scope: !512, file: !513, line: 115, baseType: !7, size: 32, offset: 608)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !512, file: !513, line: 115, baseType: !7, size: 32, offset: 640)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "co_ncellvars", scope: !512, file: !513, line: 115, baseType: !7, size: 32, offset: 672)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "co_nfreevars", scope: !512, file: !513, line: 115, baseType: !7, size: 32, offset: 704)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "co_version", scope: !512, file: !513, line: 115, baseType: !62, size: 32, offset: 736)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "co_localsplusnames", scope: !512, file: !513, line: 115, baseType: !46, size: 64, offset: 768)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "co_localspluskinds", scope: !512, file: !513, line: 115, baseType: !46, size: 64, offset: 832)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !512, file: !513, line: 115, baseType: !46, size: 64, offset: 896)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !512, file: !513, line: 115, baseType: !46, size: 64, offset: 960)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "co_qualname", scope: !512, file: !513, line: 115, baseType: !46, size: 64, offset: 1024)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "co_linetable", scope: !512, file: !513, line: 115, baseType: !46, size: 64, offset: 1088)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !512, file: !513, line: 115, baseType: !46, size: 64, offset: 1152)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "co_executors", scope: !512, file: !513, line: 115, baseType: !539, size: 64, offset: 1216)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyExecutorArray", file: !513, line: 22, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !513, line: 18, size: 128, elements: !542)
!542 = !{!543, !544, !545}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !541, file: !513, line: 19, baseType: !7, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !541, file: !513, line: 20, baseType: !7, size: 32, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "executors", scope: !541, file: !513, line: 21, baseType: !546, size: 64, offset: 64)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 64, elements: !384)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyExecutorObject", file: !513, line: 21, flags: DIFlagFwdDecl)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_co_cached", scope: !512, file: !513, line: 115, baseType: !550, size: 64, offset: 1280)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyCoCached", file: !513, line: 16, baseType: !552)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !513, line: 11, size: 256, elements: !553)
!553 = !{!554, !555, !556, !557}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_co_code", scope: !552, file: !513, line: 12, baseType: !46, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_co_varnames", scope: !552, file: !513, line: 13, baseType: !46, size: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_co_cellvars", scope: !552, file: !513, line: 14, baseType: !46, size: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_co_freevars", scope: !552, file: !513, line: 15, baseType: !46, size: 64, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_co_instrumentation_version", scope: !512, file: !513, line: 115, baseType: !433, size: 64, offset: 1344)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_co_monitoring", scope: !512, file: !513, line: 115, baseType: !560, size: 64, offset: 1408)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyCoMonitoringData", file: !513, line: 115, flags: DIFlagFwdDecl)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_co_unique_id", scope: !512, file: !513, line: 115, baseType: !81, size: 64, offset: 1472)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_co_firsttraceable", scope: !512, file: !513, line: 115, baseType: !7, size: 32, offset: 1536)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "co_extra", scope: !512, file: !513, line: 115, baseType: !45, size: 64, offset: 1600)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "co_code_adaptive", scope: !512, file: !513, line: 115, baseType: !383, size: 8, offset: 1664)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "code_line", scope: !506, file: !505, line: 1766, baseType: !7, size: 32, offset: 64)
!567 = !{!0, !568, !573, !575, !580, !610, !613, !618, !623, !628, !633, !635, !637, !639, !644, !649, !651, !657, !662, !664, !669, !694, !696, !701, !706, !711, !713, !718, !722, !727, !729, !731, !736, !741, !746, !748, !750, !752, !757, !759, !761, !763, !768, !770, !773, !778, !783, !788, !793, !798, !800, !802, !804, !809, !814, !817, !819, !821, !826, !828, !831, !833, !836, !841, !846, !849, !854, !856, !858, !863, !866, !871, !876, !878, !880, !882, !884, !886, !891, !896, !899, !901, !903, !905, !907, !909, !914, !917, !920, !925, !927, !930, !932, !937, !939, !941, !943, !945, !947, !949, !954, !956, !958}
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !505, line: 4131, type: !570, isLocal: true, isDefinition: true)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 128, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 16)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !505, line: 4138, type: !383, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !505, line: 2165, type: !577, isLocal: true, isDefinition: true)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 72, elements: !578)
!578 = !{!579}
!579 = !DISubrange(count: 9)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "__pyx_moduledef", scope: !2, file: !505, line: 2161, type: !582, isLocal: true, isDefinition: true)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !583, line: 107, size: 832, elements: !584)
!583 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/moduleobject.h", directory: "")
!584 = !{!585, !596, !597, !598, !599, !600, !607, !608, !609}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !582, file: !583, line: 108, baseType: !586, size: 320)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !583, line: 58, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !583, line: 39, size: 320, elements: !588)
!588 = !{!589, !590, !594, !595}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !587, file: !583, line: 40, baseType: !47, size: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !587, file: !583, line: 47, baseType: !591, size: 64, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!46}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !587, file: !583, line: 52, baseType: !81, size: 64, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !587, file: !583, line: 57, baseType: !46, size: 64, offset: 256)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !582, file: !583, line: 109, baseType: !25, size: 64, offset: 320)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !582, file: !583, line: 110, baseType: !25, size: 64, offset: 384)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !582, file: !583, line: 111, baseType: !81, size: 64, offset: 448)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !582, file: !583, line: 112, baseType: !291, size: 64, offset: 512)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "m_slots", scope: !582, file: !583, line: 113, baseType: !601, size: 64, offset: 576)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Slot", file: !48, line: 13, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Slot", file: !583, line: 69, size: 128, elements: !604)
!604 = !{!605, !606}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !603, file: !583, line: 70, baseType: !7, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !603, file: !583, line: 71, baseType: !45, size: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !582, file: !583, line: 114, baseType: !271, size: 64, offset: 640)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !582, file: !583, line: 115, baseType: !151, size: 64, offset: 704)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !582, file: !583, line: 116, baseType: !350, size: 64, offset: 768)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "__pyx_methods", scope: !2, file: !505, line: 2060, type: !612, isLocal: true, isDefinition: true)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 256, elements: !384)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "__pyx_moduledef_slots", scope: !2, file: !505, line: 2144, type: !615, isLocal: true, isDefinition: true)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 384, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 3)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !505, line: 2293, type: !620, isLocal: true, isDefinition: true)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 40, elements: !621)
!621 = !{!622}
!622 = !DISubrange(count: 5)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !505, line: 2300, type: !625, isLocal: true, isDefinition: true)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 56, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 7)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !505, line: 2300, type: !630, isLocal: true, isDefinition: true)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 88, elements: !631)
!631 = !{!632}
!632 = !DISubrange(count: 11)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !505, line: 2301, type: !625, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !505, line: 2301, type: !577, isLocal: true, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !505, line: 2302, type: !625, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !505, line: 2302, type: !641, isLocal: true, isDefinition: true)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 96, elements: !642)
!642 = !{!643}
!643 = !DISubrange(count: 12)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !505, line: 2303, type: !646, isLocal: true, isDefinition: true)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 216, elements: !647)
!647 = !{!648}
!648 = !DISubrange(count: 27)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !505, line: 2303, type: !577, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "main_interpreter_id", scope: !653, file: !505, line: 2240, type: !55, isLocal: true, isDefinition: true)
!653 = distinct !DISubprogram(name: "__Pyx_check_single_interpreter", scope: !505, file: !505, line: 2239, type: !654, scopeLine: 2239, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !656)
!654 = !DISubroutineType(types: !655)
!655 = !{!7}
!656 = !{}
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(scope: null, file: !505, line: 2262, type: !659, isLocal: true, isDefinition: true)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 760, elements: !660)
!660 = !{!661}
!661 = !DISubrange(count: 95)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "__pyx_m", scope: !2, file: !505, line: 1326, type: !46, isLocal: true, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !505, line: 2337, type: !666, isLocal: true, isDefinition: true)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 648, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 81)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "__pyx_mstate_global", scope: !2, file: !505, line: 1989, type: !671, isLocal: true, isDefinition: true)
!671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !672)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pyx_mstatetype", file: !505, line: 1968, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !505, line: 1954, size: 2176, elements: !675)
!675 = !{!676, !677, !678, !679, !680, !681, !682, !686, !688}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_d", scope: !674, file: !505, line: 1955, baseType: !46, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_b", scope: !674, file: !505, line: 1956, baseType: !46, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_cython_runtime", scope: !674, file: !505, line: 1957, baseType: !46, size: 64, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_tuple", scope: !674, file: !505, line: 1958, baseType: !46, size: 64, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_bytes", scope: !674, file: !505, line: 1959, baseType: !46, size: 64, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_unicode", scope: !674, file: !505, line: 1960, baseType: !46, size: 64, offset: 320)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_string_tab", scope: !674, file: !505, line: 1961, baseType: !683, size: 1344, offset: 384)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 1344, elements: !684)
!684 = !{!685}
!685 = !DISubrange(count: 21)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_number_tab", scope: !674, file: !505, line: 1962, baseType: !687, size: 320, offset: 1728)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 320, elements: !621)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_code_cache", scope: !674, file: !505, line: 1965, baseType: !689, size: 128, offset: 2048)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__Pyx_CodeObjectCache", file: !505, line: 1768, size: 128, elements: !690)
!690 = !{!691, !692, !693}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !689, file: !505, line: 1769, baseType: !7, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "max_count", scope: !689, file: !505, line: 1770, baseType: !7, size: 32, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !689, file: !505, line: 1771, baseType: !503, size: 64, offset: 64)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !505, line: 2367, type: !577, isLocal: true, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(scope: null, file: !505, line: 2368, type: !698, isLocal: true, isDefinition: true)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 120, elements: !699)
!699 = !{!700}
!700 = !DISubrange(count: 15)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !505, line: 2369, type: !703, isLocal: true, isDefinition: true)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 104, elements: !704)
!704 = !{!705}
!705 = !DISubrange(count: 13)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !505, line: 2801, type: !708, isLocal: true, isDefinition: true)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 112, elements: !709)
!709 = !{!710}
!710 = !DISubrange(count: 14)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "__pyx_mstate_global_static", scope: !2, file: !505, line: 1983, type: !673, isLocal: true, isDefinition: true)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(scope: null, file: !505, line: 1336, type: !715, isLocal: true, isDefinition: true)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 440, elements: !716)
!716 = !{!717}
!717 = !DISubrange(count: 55)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "__pyx_f", scope: !2, file: !505, line: 1335, type: !720, isLocal: true, isDefinition: true)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !721, size: 64, elements: !384)
!721 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !505, line: 4994, type: !724, isLocal: true, isDefinition: true)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 624, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 78)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(scope: null, file: !505, line: 5000, type: !698, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !505, line: 5000, type: !698, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !505, line: 2860, type: !733, isLocal: true, isDefinition: true)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 744, elements: !734)
!734 = !{!735}
!735 = !DISubrange(count: 93)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(scope: null, file: !505, line: 5010, type: !738, isLocal: true, isDefinition: true)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 136, elements: !739)
!739 = !{!740}
!740 = !DISubrange(count: 17)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !505, line: 5010, type: !743, isLocal: true, isDefinition: true)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 32, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 4)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !505, line: 5010, type: !620, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !505, line: 5011, type: !630, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !505, line: 5015, type: !743, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !505, line: 5062, type: !754, isLocal: true, isDefinition: true)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1224, elements: !755)
!755 = !{!756}
!756 = !DISubrange(count: 153)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "__pyx_filename", scope: !2, file: !505, line: 1331, type: !25, isLocal: true, isDefinition: true)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(name: "__pyx_lineno", scope: !2, file: !505, line: 1328, type: !7, isLocal: true, isDefinition: true)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "__pyx_clineno", scope: !2, file: !505, line: 1329, type: !7, isLocal: true, isDefinition: true)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(scope: null, file: !377, line: 25, type: !765, isLocal: true, isDefinition: true)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 144, elements: !766)
!766 = !{!767}
!767 = !DISubrange(count: 18)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(scope: null, file: !377, line: 25, type: !708, isLocal: true, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !377, line: 25, type: !772, isLocal: true, isDefinition: true)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 144, elements: !766)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(scope: null, file: !505, line: 3120, type: !775, isLocal: true, isDefinition: true)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 200, elements: !776)
!776 = !{!777}
!777 = !DISubrange(count: 25)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(scope: null, file: !505, line: 3152, type: !780, isLocal: true, isDefinition: true)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 248, elements: !781)
!781 = !{!782}
!782 = !DISubrange(count: 31)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(scope: null, file: !505, line: 3159, type: !785, isLocal: true, isDefinition: true)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 344, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 43)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !505, line: 3197, type: !790, isLocal: true, isDefinition: true)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 224, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 28)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(scope: null, file: !505, line: 3197, type: !795, isLocal: true, isDefinition: true)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 80, elements: !796)
!796 = !{!797}
!797 = !DISubrange(count: 10)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(scope: null, file: !505, line: 3197, type: !646, isLocal: true, isDefinition: true)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(scope: null, file: !505, line: 3199, type: !630, isLocal: true, isDefinition: true)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "__pyx_builtin_input", scope: !2, file: !505, line: 1937, type: !46, isLocal: true, isDefinition: true)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(scope: null, file: !505, line: 4852, type: !806, isLocal: true, isDefinition: true)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 160, elements: !807)
!807 = !{!808}
!808 = !DISubrange(count: 20)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(scope: null, file: !505, line: 4852, type: !811, isLocal: true, isDefinition: true)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 152, elements: !812)
!812 = !{!813}
!813 = !DISubrange(count: 19)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(scope: null, file: !414, line: 24, type: !816, isLocal: true, isDefinition: true)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 136, elements: !739)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(scope: null, file: !414, line: 24, type: !708, isLocal: true, isDefinition: true)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(scope: null, file: !414, line: 24, type: !772, isLocal: true, isDefinition: true)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(scope: null, file: !6, line: 284, type: !823, isLocal: true, isDefinition: true)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 64, elements: !824)
!824 = !{!825}
!825 = !DISubrange(count: 8)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(scope: null, file: !6, line: 284, type: !577, isLocal: true, isDefinition: true)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(scope: null, file: !6, line: 284, type: !830, isLocal: true, isDefinition: true)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 224, elements: !791)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(scope: null, file: !6, line: 285, type: !830, isLocal: true, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(scope: null, file: !505, line: 4837, type: !835, isLocal: true, isDefinition: true)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 128, elements: !571)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(scope: null, file: !505, line: 4869, type: !838, isLocal: true, isDefinition: true)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 312, elements: !839)
!839 = !{!840}
!840 = !DISubrange(count: 39)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(scope: null, file: !505, line: 4869, type: !843, isLocal: true, isDefinition: true)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 264, elements: !844)
!844 = !{!845}
!845 = !DISubrange(count: 33)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(scope: null, file: !505, line: 4872, type: !848, isLocal: true, isDefinition: true)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 168, elements: !684)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(scope: null, file: !505, line: 3426, type: !851, isLocal: true, isDefinition: true)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 384, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 48)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(scope: null, file: !425, line: 123, type: !765, isLocal: true, isDefinition: true)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(scope: null, file: !425, line: 123, type: !708, isLocal: true, isDefinition: true)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(scope: null, file: !425, line: 123, type: !860, isLocal: true, isDefinition: true)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 520, elements: !861)
!861 = !{!862}
!862 = !DISubrange(count: 65)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(scope: null, file: !425, line: 133, type: !865, isLocal: true, isDefinition: true)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 168, elements: !684)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(scope: null, file: !425, line: 134, type: !868, isLocal: true, isDefinition: true)
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 240, elements: !869)
!869 = !{!870}
!870 = !DISubrange(count: 30)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(scope: null, file: !505, line: 3360, type: !873, isLocal: true, isDefinition: true)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 176, elements: !874)
!874 = !{!875}
!875 = !DISubrange(count: 22)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(scope: null, file: !505, line: 3360, type: !570, isLocal: true, isDefinition: true)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(scope: null, file: !505, line: 3367, type: !738, isLocal: true, isDefinition: true)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(scope: null, file: !440, line: 31, type: !835, isLocal: true, isDefinition: true)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(scope: null, file: !440, line: 31, type: !703, isLocal: true, isDefinition: true)
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(scope: null, file: !440, line: 31, type: !738, isLocal: true, isDefinition: true)
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(scope: null, file: !505, line: 3445, type: !888, isLocal: true, isDefinition: true)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 296, elements: !889)
!889 = !{!890}
!890 = !DISubrange(count: 37)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(scope: null, file: !505, line: 3551, type: !893, isLocal: true, isDefinition: true)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 184, elements: !894)
!894 = !{!895}
!895 = !DISubrange(count: 23)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(scope: null, file: !505, line: 3551, type: !898, isLocal: true, isDefinition: true)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 160, elements: !807)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(scope: null, file: !505, line: 3552, type: !898, isLocal: true, isDefinition: true)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(scope: null, file: !13, line: 299, type: !865, isLocal: true, isDefinition: true)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(scope: null, file: !13, line: 299, type: !570, isLocal: true, isDefinition: true)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(scope: null, file: !13, line: 299, type: !898, isLocal: true, isDefinition: true)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(scope: null, file: !13, line: 234, type: !865, isLocal: true, isDefinition: true)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !13, line: 265, type: !911, isLocal: true, isDefinition: true)
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 192, elements: !912)
!912 = !{!913}
!913 = !DISubrange(count: 24)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(scope: null, file: !13, line: 227, type: !916, isLocal: true, isDefinition: true)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 152, elements: !812)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(scope: null, file: !13, line: 272, type: !919, isLocal: true, isDefinition: true)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 216, elements: !647)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(scope: null, file: !13, line: 272, type: !922, isLocal: true, isDefinition: true)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 208, elements: !923)
!923 = !{!924}
!924 = !DISubrange(count: 26)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(scope: null, file: !13, line: 274, type: !703, isLocal: true, isDefinition: true)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(scope: null, file: !13, line: 335, type: !929, isLocal: true, isDefinition: true)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 120, elements: !699)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(scope: null, file: !13, line: 335, type: !630, isLocal: true, isDefinition: true)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(scope: null, file: !13, line: 342, type: !934, isLocal: true, isDefinition: true)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 232, elements: !935)
!935 = !{!936}
!936 = !DISubrange(count: 29)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(scope: null, file: !485, line: 16, type: !765, isLocal: true, isDefinition: true)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(scope: null, file: !485, line: 16, type: !708, isLocal: true, isDefinition: true)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(scope: null, file: !485, line: 16, type: !772, isLocal: true, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(scope: null, file: !505, line: 3740, type: !780, isLocal: true, isDefinition: true)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(name: "__pyx_builtin_print", scope: !2, file: !505, line: 1938, type: !46, isLocal: true, isDefinition: true)
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(scope: null, file: !505, line: 4006, type: !630, isLocal: true, isDefinition: true)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(scope: null, file: !505, line: 1330, type: !951, isLocal: true, isDefinition: true)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 952, elements: !952)
!952 = !{!953}
!953 = !DISubrange(count: 119)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(name: "__pyx_cfilenm", scope: !2, file: !505, line: 1330, type: !721, isLocal: true, isDefinition: true)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(scope: null, file: !505, line: 3022, type: !911, isLocal: true, isDefinition: true)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(scope: null, file: !505, line: 3022, type: !960, isLocal: true, isDefinition: true)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 560, elements: !961)
!961 = !{!962}
!962 = !DISubrange(count: 70)
!963 = !{i32 2, !"SDK Version", [2 x i32] [i32 14, i32 4]}
!964 = !{i32 7, !"Dwarf Version", i32 4}
!965 = !{i32 2, !"Debug Info Version", i32 3}
!966 = !{i32 1, !"wchar_size", i32 4}
!967 = !{i32 8, !"PIC Level", i32 2}
!968 = !{i32 7, !"uwtable", i32 1}
!969 = !{i32 7, !"frame-pointer", i32 1}
!970 = !{!"Homebrew clang version 20.1.8"}
!971 = distinct !DISubprogram(name: "PyInit_original", scope: !505, file: !505, line: 2204, type: !592, scopeLine: 2206, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2)
!972 = !DILocation(line: 2207, column: 10, scope: !971)
!973 = !DILocation(line: 2207, column: 3, scope: !971)
!974 = distinct !DISubprogram(name: "main", scope: !505, file: !505, line: 4120, type: !975, scopeLine: 4121, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !656)
!975 = !DISubroutineType(types: !976)
!976 = !{!7, !7, !977}
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!978 = !DILocalVariable(name: "argc", arg: 1, scope: !974, file: !505, line: 4120, type: !7)
!979 = !DILocation(line: 4120, column: 10, scope: !974)
!980 = !DILocalVariable(name: "argv", arg: 2, scope: !974, file: !505, line: 4120, type: !977)
!981 = !DILocation(line: 4120, column: 23, scope: !974)
!982 = !DILocation(line: 4122, column: 10, scope: !983)
!983 = distinct !DILexicalBlock(scope: !974, file: !505, line: 4122, column: 9)
!984 = !DILocation(line: 4122, column: 9, scope: !983)
!985 = !DILocation(line: 4123, column: 16, scope: !986)
!986 = distinct !DILexicalBlock(scope: !983, file: !505, line: 4122, column: 16)
!987 = !DILocation(line: 4123, column: 9, scope: !986)
!988 = !DILocalVariable(name: "i", scope: !989, file: !505, line: 4126, type: !7)
!989 = distinct !DILexicalBlock(scope: !983, file: !505, line: 4125, column: 10)
!990 = !DILocation(line: 4126, column: 13, scope: !989)
!991 = !DILocalVariable(name: "res", scope: !989, file: !505, line: 4126, type: !7)
!992 = !DILocation(line: 4126, column: 16, scope: !989)
!993 = !DILocalVariable(name: "argv_copy", scope: !989, file: !505, line: 4127, type: !35)
!994 = !DILocation(line: 4127, column: 19, scope: !989)
!995 = !DILocation(line: 4127, column: 78, scope: !989)
!996 = !DILocation(line: 4127, column: 69, scope: !989)
!997 = !DILocation(line: 4127, column: 67, scope: !989)
!998 = !DILocation(line: 4127, column: 43, scope: !989)
!999 = !DILocalVariable(name: "argv_copy2", scope: !989, file: !505, line: 4128, type: !35)
!1000 = !DILocation(line: 4128, column: 19, scope: !989)
!1001 = !DILocation(line: 4128, column: 79, scope: !989)
!1002 = !DILocation(line: 4128, column: 70, scope: !989)
!1003 = !DILocation(line: 4128, column: 68, scope: !989)
!1004 = !DILocation(line: 4128, column: 44, scope: !989)
!1005 = !DILocalVariable(name: "oldloc", scope: !989, file: !505, line: 4129, type: !101)
!1006 = !DILocation(line: 4129, column: 15, scope: !989)
!1007 = !DILocation(line: 4129, column: 31, scope: !989)
!1008 = !DILocation(line: 4129, column: 24, scope: !989)
!1009 = !DILocation(line: 4130, column: 14, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !989, file: !505, line: 4130, column: 13)
!1011 = !DILocation(line: 4130, column: 24, scope: !1010)
!1012 = !DILocation(line: 4130, column: 28, scope: !1010)
!1013 = !DILocation(line: 4130, column: 39, scope: !1010)
!1014 = !DILocation(line: 4130, column: 43, scope: !1010)
!1015 = !DILocation(line: 4131, column: 21, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1010, file: !505, line: 4130, column: 51)
!1017 = !DILocation(line: 4131, column: 13, scope: !1016)
!1018 = !DILocation(line: 4132, column: 18, scope: !1016)
!1019 = !DILocation(line: 4132, column: 13, scope: !1016)
!1020 = !DILocation(line: 4133, column: 18, scope: !1016)
!1021 = !DILocation(line: 4133, column: 13, scope: !1016)
!1022 = !DILocation(line: 4134, column: 18, scope: !1016)
!1023 = !DILocation(line: 4134, column: 13, scope: !1016)
!1024 = !DILocation(line: 4135, column: 13, scope: !1016)
!1025 = !DILocation(line: 4137, column: 13, scope: !989)
!1026 = !DILocation(line: 4138, column: 9, scope: !989)
!1027 = !DILocation(line: 4139, column: 16, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !989, file: !505, line: 4139, column: 9)
!1029 = !DILocation(line: 4139, column: 14, scope: !1028)
!1030 = !DILocation(line: 4139, column: 21, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1028, file: !505, line: 4139, column: 9)
!1032 = !DILocation(line: 4139, column: 25, scope: !1031)
!1033 = !DILocation(line: 4139, column: 23, scope: !1031)
!1034 = !DILocation(line: 4139, column: 9, scope: !1028)
!1035 = !DILocation(line: 4140, column: 60, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1031, file: !505, line: 4139, column: 36)
!1037 = !DILocation(line: 4140, column: 65, scope: !1036)
!1038 = !DILocation(line: 4140, column: 44, scope: !1036)
!1039 = !DILocation(line: 4140, column: 29, scope: !1036)
!1040 = !DILocation(line: 4140, column: 39, scope: !1036)
!1041 = !DILocation(line: 4140, column: 42, scope: !1036)
!1042 = !DILocation(line: 4140, column: 13, scope: !1036)
!1043 = !DILocation(line: 4140, column: 24, scope: !1036)
!1044 = !DILocation(line: 4140, column: 27, scope: !1036)
!1045 = !DILocation(line: 4141, column: 18, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1036, file: !505, line: 4141, column: 17)
!1047 = !DILocation(line: 4141, column: 28, scope: !1046)
!1048 = !DILocation(line: 4141, column: 17, scope: !1046)
!1049 = !DILocation(line: 4141, column: 36, scope: !1046)
!1050 = !DILocation(line: 4141, column: 32, scope: !1046)
!1051 = !DILocation(line: 4142, column: 9, scope: !1036)
!1052 = !DILocation(line: 4139, column: 32, scope: !1031)
!1053 = !DILocation(line: 4139, column: 9, scope: !1031)
!1054 = distinct !{!1054, !1034, !1055, !1056}
!1055 = !DILocation(line: 4142, column: 9, scope: !1028)
!1056 = !{!"llvm.loop.mustprogress"}
!1057 = !DILocation(line: 4143, column: 27, scope: !989)
!1058 = !DILocation(line: 4143, column: 9, scope: !989)
!1059 = !DILocation(line: 4144, column: 14, scope: !989)
!1060 = !DILocation(line: 4144, column: 9, scope: !989)
!1061 = !DILocation(line: 4145, column: 13, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !989, file: !505, line: 4145, column: 13)
!1063 = !DILocation(line: 4145, column: 17, scope: !1062)
!1064 = !DILocation(line: 4146, column: 30, scope: !1062)
!1065 = !DILocation(line: 4146, column: 36, scope: !1062)
!1066 = !DILocation(line: 4146, column: 19, scope: !1062)
!1067 = !DILocation(line: 4146, column: 17, scope: !1062)
!1068 = !DILocation(line: 4146, column: 13, scope: !1062)
!1069 = !DILocation(line: 4147, column: 16, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !989, file: !505, line: 4147, column: 9)
!1071 = !DILocation(line: 4147, column: 14, scope: !1070)
!1072 = !DILocation(line: 4147, column: 21, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1070, file: !505, line: 4147, column: 9)
!1074 = !DILocation(line: 4147, column: 25, scope: !1073)
!1075 = !DILocation(line: 4147, column: 23, scope: !1073)
!1076 = !DILocation(line: 4147, column: 9, scope: !1070)
!1077 = !DILocation(line: 4148, column: 27, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1073, file: !505, line: 4147, column: 36)
!1079 = !DILocation(line: 4148, column: 38, scope: !1078)
!1080 = !DILocation(line: 4148, column: 13, scope: !1078)
!1081 = !DILocation(line: 4149, column: 9, scope: !1078)
!1082 = !DILocation(line: 4147, column: 32, scope: !1073)
