; ModuleID = 'dataset/cases/goeq-oja-0005/artifacts/cython-clang-llvm-o0-embed-v1/prog_a/program.c'
source_filename = "dataset/cases/goeq-oja-0005/artifacts/cython-clang-llvm-o0-embed-v1/prog_a/program.c"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx14.0.0"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr }
%struct.PyModuleDef_Base = type { %struct._object, ptr, i64, ptr }
%struct._object = type { %union.anon, ptr }
%union.anon = type { i64 }
%struct.PyMethodDef = type { ptr, ptr, i32, ptr }
%struct.__pyx_mstatetype = type { ptr, ptr, ptr, ptr, ptr, ptr, [15 x ptr], [2 x ptr], %struct.__Pyx_CodeObjectCache }
%struct.__Pyx_CodeObjectCache = type { i32, i32, ptr }
%struct._typeobject = type { %struct.PyVarObject, ptr, i64, i64, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, ptr, i8, i16 }
%struct.PyVarObject = type { %struct._object, i64 }
%struct.anon.1 = type { i8, [3 x i8] }
%struct._longobject = type { %struct._object, %struct._PyLongValue }
%struct._PyLongValue = type { i64, [1 x i32] }
%struct.PyStatus = type { i32, ptr, ptr, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__pyx_module_is_main_original", scope: !2, file: !456, line: 1877, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Homebrew clang version 20.1.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !28, globals: !518, splitDebugInlining: false, nameTableKind: Apple, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk", sdk: "MacOSX14.sdk")
!3 = !DIFile(filename: "dataset/cases/goeq-oja-0005/artifacts/cython-clang-llvm-o0-embed-v1/prog_a/program.c", directory: ".")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 695, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/object.h", directory: "")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "PYGEN_RETURN", value: 0)
!10 = !DIEnumerator(name: "PYGEN_ERROR", value: -1)
!11 = !DIEnumerator(name: "PYGEN_NEXT", value: 1)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !14, file: !13, line: 11, baseType: !23, size: 32, elements: !24)
!13 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/initconfig.h", directory: "")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 10, size: 256, elements: !15)
!15 = !{!16, !17, !21, !22}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_type", scope: !14, file: !13, line: 15, baseType: !12, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !14, file: !13, line: 16, baseType: !18, size: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "err_msg", scope: !14, file: !13, line: 17, baseType: !18, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "exitcode", scope: !14, file: !13, line: 18, baseType: !7, size: 32, offset: 192)
!23 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!24 = !{!25, !26, !27}
!25 = !DIEnumerator(name: "_PyStatus_TYPE_OK", value: 0)
!26 = !DIEnumerator(name: "_PyStatus_TYPE_ERROR", value: 1)
!27 = !DIEnumerator(name: "_PyStatus_TYPE_EXIT", value: 2)
!28 = !{!29, !35, !39, !40, !367, !7, !18, !95, !369, !380, !391, !75, !407, !38, !422, !423, !424, !64, !431, !440, !441, !454}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !32, line: 34, baseType: !33)
!32 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_wchar_t.h", directory: "")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wchar_t", file: !34, line: 82, baseType: !7)
!34 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/arm/_types.h", directory: "")
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !36, line: 31, baseType: !37)
!36 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !34, line: 70, baseType: !38)
!38 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !42, line: 18, baseType: !43)
!42 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pytypedefs.h", directory: "")
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !6, line: 110, size: 128, elements: !44)
!44 = !{!45, !63}
!45 = !DIDerivedType(tag: DW_TAG_member, scope: !43, file: !6, line: 122, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !43, file: !6, line: 122, size: 64, elements: !47)
!47 = !{!48, !52}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt_full", scope: !46, file: !6, line: 124, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !50, line: 30, baseType: !51)
!50 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_int64_t.h", directory: "")
!51 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, scope: !46, file: !6, line: 125, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !46, file: !6, line: 125, size: 64, elements: !54)
!54 = !{!55, !58, !62}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !53, file: !6, line: 131, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !57, line: 31, baseType: !23)
!57 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint32_t.h", directory: "")
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ob_overflow", scope: !53, file: !6, line: 132, baseType: !59, size: 16, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !60, line: 31, baseType: !61)
!60 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/_types/_uint16_t.h", directory: "")
!61 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ob_flags", scope: !53, file: !6, line: 133, baseType: !59, size: 16, offset: 48)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !43, file: !6, line: 144, baseType: !64, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !42, line: 20, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !67, line: 148, size: 3328, elements: !68)
!67 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/object.h", directory: "")
!68 = !{!69, !81, !82, !83, !84, !89, !90, !96, !101, !120, !122, !175, !206, !218, !224, !225, !226, !228, !230, !262, !263, !264, !273, !274, !279, !280, !282, !284, !295, !306, !324, !325, !326, !328, !330, !331, !333, !338, !343, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !364, !366}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !66, file: !67, line: 149, baseType: !70, size: 192)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !6, line: 172, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 169, size: 192, elements: !72)
!72 = !{!73, !74}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !71, file: !6, line: 170, baseType: !41, size: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !71, file: !6, line: 171, baseType: !75, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !76, line: 156, baseType: !77)
!76 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pyport.h", directory: "")
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !78, line: 31, baseType: !79)
!78 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_ssize_t.h", directory: "")
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ssize_t", file: !34, line: 97, baseType: !80)
!80 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !66, file: !67, line: 150, baseType: !18, size: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !66, file: !67, line: 151, baseType: !75, size: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !66, file: !67, line: 151, baseType: !75, size: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !66, file: !67, line: 155, baseType: !85, size: 64, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !6, line: 353, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !40}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall_offset", scope: !66, file: !67, line: 156, baseType: !75, size: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !66, file: !67, line: 157, baseType: !91, size: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !6, line: 354, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!40, !40, !95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !66, file: !67, line: 158, baseType: !97, size: 64, offset: 576)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !6, line: 356, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!7, !40, !95, !40}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_async", scope: !66, file: !67, line: 159, baseType: !102, size: 64, offset: 640)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyAsyncMethods", file: !67, line: 135, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 130, size: 256, elements: !105)
!105 = !{!106, !111, !112, !113}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "am_await", scope: !104, file: !67, line: 131, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !6, line: 336, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!40, !40}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "am_aiter", scope: !104, file: !67, line: 132, baseType: !107, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "am_anext", scope: !104, file: !67, line: 133, baseType: !107, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "am_send", scope: !104, file: !67, line: 134, baseType: !114, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "sendfunc", file: !67, line: 128, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!118, !40, !40, !119}
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySendResult", file: !6, line: 699, baseType: !5)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !66, file: !67, line: 161, baseType: !121, size: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !6, line: 358, baseType: !108)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !66, file: !67, line: 165, baseType: !123, size: 64, offset: 768)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !67, line: 106, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 61, size: 2304, elements: !126)
!126 = !{!127, !132, !133, !134, !135, !136, !141, !142, !143, !144, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !125, file: !67, line: 66, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !6, line: 337, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!40, !40, !40}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !125, file: !67, line: 67, baseType: !128, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !125, file: !67, line: 68, baseType: !128, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !125, file: !67, line: 69, baseType: !128, size: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !125, file: !67, line: 70, baseType: !128, size: 64, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !125, file: !67, line: 71, baseType: !137, size: 64, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !6, line: 338, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!40, !40, !40, !40}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !125, file: !67, line: 72, baseType: !107, size: 64, offset: 384)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !125, file: !67, line: 73, baseType: !107, size: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !125, file: !67, line: 74, baseType: !107, size: 64, offset: 512)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !125, file: !67, line: 75, baseType: !145, size: 64, offset: 576)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !6, line: 339, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!7, !40}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !125, file: !67, line: 76, baseType: !107, size: 64, offset: 640)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !125, file: !67, line: 77, baseType: !128, size: 64, offset: 704)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !125, file: !67, line: 78, baseType: !128, size: 64, offset: 768)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !125, file: !67, line: 79, baseType: !128, size: 64, offset: 832)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !125, file: !67, line: 80, baseType: !128, size: 64, offset: 896)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !125, file: !67, line: 81, baseType: !128, size: 64, offset: 960)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !125, file: !67, line: 82, baseType: !107, size: 64, offset: 1024)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !125, file: !67, line: 83, baseType: !39, size: 64, offset: 1088)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !125, file: !67, line: 84, baseType: !107, size: 64, offset: 1152)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !125, file: !67, line: 86, baseType: !128, size: 64, offset: 1216)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !125, file: !67, line: 87, baseType: !128, size: 64, offset: 1280)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !125, file: !67, line: 88, baseType: !128, size: 64, offset: 1344)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !125, file: !67, line: 89, baseType: !128, size: 64, offset: 1408)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !125, file: !67, line: 90, baseType: !137, size: 64, offset: 1472)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !125, file: !67, line: 91, baseType: !128, size: 64, offset: 1536)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !125, file: !67, line: 92, baseType: !128, size: 64, offset: 1600)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !125, file: !67, line: 93, baseType: !128, size: 64, offset: 1664)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !125, file: !67, line: 94, baseType: !128, size: 64, offset: 1728)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !125, file: !67, line: 95, baseType: !128, size: 64, offset: 1792)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !125, file: !67, line: 97, baseType: !128, size: 64, offset: 1856)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !125, file: !67, line: 98, baseType: !128, size: 64, offset: 1920)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !125, file: !67, line: 99, baseType: !128, size: 64, offset: 1984)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !125, file: !67, line: 100, baseType: !128, size: 64, offset: 2048)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !125, file: !67, line: 102, baseType: !107, size: 64, offset: 2112)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_matrix_multiply", scope: !125, file: !67, line: 104, baseType: !128, size: 64, offset: 2176)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_matrix_multiply", scope: !125, file: !67, line: 105, baseType: !128, size: 64, offset: 2240)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !66, file: !67, line: 166, baseType: !176, size: 64, offset: 832)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !67, line: 120, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 108, size: 640, elements: !179)
!179 = !{!180, !185, !186, !191, !192, !193, !198, !199, !204, !205}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !178, file: !67, line: 109, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !6, line: 340, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!75, !40}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !178, file: !67, line: 110, baseType: !128, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !178, file: !67, line: 111, baseType: !187, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !6, line: 341, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!40, !40, !75}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !178, file: !67, line: 112, baseType: !187, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !178, file: !67, line: 113, baseType: !39, size: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !178, file: !67, line: 114, baseType: !194, size: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !6, line: 343, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!7, !40, !75, !40}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !178, file: !67, line: 115, baseType: !39, size: 64, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !178, file: !67, line: 116, baseType: !200, size: 64, offset: 448)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !6, line: 347, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!7, !40, !40}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !178, file: !67, line: 118, baseType: !128, size: 64, offset: 512)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !178, file: !67, line: 119, baseType: !187, size: 64, offset: 576)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !66, file: !67, line: 167, baseType: !207, size: 64, offset: 896)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !67, line: 126, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 122, size: 192, elements: !210)
!210 = !{!211, !212, !213}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !209, file: !67, line: 123, baseType: !181, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !209, file: !67, line: 124, baseType: !128, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !209, file: !67, line: 125, baseType: !214, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !6, line: 345, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!7, !40, !40, !40}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !66, file: !67, line: 171, baseType: !219, size: 64, offset: 960)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !6, line: 359, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!223, !40}
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !76, line: 170, baseType: !75)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !66, file: !67, line: 172, baseType: !137, size: 64, offset: 1024)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !66, file: !67, line: 173, baseType: !121, size: 64, offset: 1088)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !66, file: !67, line: 174, baseType: !227, size: 64, offset: 1152)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !6, line: 355, baseType: !129)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !66, file: !67, line: 175, baseType: !229, size: 64, offset: 1216)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !6, line: 357, baseType: !215)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !66, file: !67, line: 178, baseType: !231, size: 64, offset: 1280)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !67, line: 140, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 137, size: 128, elements: !234)
!234 = !{!235, !257}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !233, file: !67, line: 138, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !237, line: 35, baseType: !238)
!237 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/pybuffer.h", directory: "")
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!7, !40, !241, !7}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !237, line: 33, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !237, line: 20, size: 640, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !254, !255, !256}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !243, file: !237, line: 21, baseType: !39, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !243, file: !237, line: 22, baseType: !40, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !243, file: !237, line: 23, baseType: !75, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !243, file: !237, line: 24, baseType: !75, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !243, file: !237, line: 26, baseType: !7, size: 32, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !243, file: !237, line: 27, baseType: !7, size: 32, offset: 288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !243, file: !237, line: 28, baseType: !95, size: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !243, file: !237, line: 29, baseType: !253, size: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !243, file: !237, line: 30, baseType: !253, size: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !243, file: !237, line: 31, baseType: !253, size: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !243, file: !237, line: 32, baseType: !39, size: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !233, file: !67, line: 139, baseType: !258, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !237, line: 36, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !40, !241}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !66, file: !67, line: 181, baseType: !38, size: 64, offset: 1344)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !66, file: !67, line: 183, baseType: !18, size: 64, offset: 1408)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !66, file: !67, line: 187, baseType: !265, size: 64, offset: 1472)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !6, line: 349, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!7, !40, !269, !39}
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !6, line: 348, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!7, !40, !39}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !66, file: !67, line: 190, baseType: !145, size: 64, offset: 1536)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !66, file: !67, line: 194, baseType: !275, size: 64, offset: 1600)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !6, line: 360, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!40, !40, !40, !7}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !66, file: !67, line: 197, baseType: !75, size: 64, offset: 1664)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !66, file: !67, line: 200, baseType: !281, size: 64, offset: 1728)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !6, line: 361, baseType: !108)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !66, file: !67, line: 201, baseType: !283, size: 64, offset: 1792)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !6, line: 362, baseType: !108)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !66, file: !67, line: 204, baseType: !285, size: 64, offset: 1856)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !42, line: 14, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 68, size: 256, elements: !289)
!288 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/methodobject.h", directory: "")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 69, baseType: !18, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 70, baseType: !292, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 19, baseType: !129)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 71, baseType: !7, size: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 73, baseType: !18, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !66, file: !67, line: 205, baseType: !296, size: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !42, line: 16, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !299, line: 41, size: 320, elements: !300)
!299 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/descrobject.h", directory: "")
!300 = !{!301, !302, !303, !304, !305}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !298, file: !299, line: 42, baseType: !18, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !298, file: !299, line: 43, baseType: !7, size: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !298, file: !299, line: 44, baseType: !75, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !298, file: !299, line: 45, baseType: !7, size: 32, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !298, file: !299, line: 46, baseType: !18, size: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !66, file: !67, line: 206, baseType: !307, size: 64, offset: 1984)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGetSetDef", file: !42, line: 15, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !299, line: 11, size: 320, elements: !310)
!310 = !{!311, !312, !317, !322, !323}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !309, file: !299, line: 12, baseType: !18, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !309, file: !299, line: 13, baseType: !313, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !299, line: 8, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!40, !40, !39}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !309, file: !299, line: 14, baseType: !318, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !299, line: 9, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!7, !40, !40, !39}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !309, file: !299, line: 15, baseType: !18, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !309, file: !299, line: 16, baseType: !39, size: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !66, file: !67, line: 208, baseType: !64, size: 64, offset: 2048)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !66, file: !67, line: 209, baseType: !40, size: 64, offset: 2112)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !66, file: !67, line: 210, baseType: !327, size: 64, offset: 2176)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !6, line: 363, baseType: !138)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !66, file: !67, line: 211, baseType: !329, size: 64, offset: 2240)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !6, line: 364, baseType: !215)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !66, file: !67, line: 212, baseType: !75, size: 64, offset: 2304)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !66, file: !67, line: 213, baseType: !332, size: 64, offset: 2368)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !6, line: 365, baseType: !215)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !66, file: !67, line: 214, baseType: !334, size: 64, offset: 2432)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !6, line: 367, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!40, !64, !75}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !66, file: !67, line: 215, baseType: !339, size: 64, offset: 2496)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !6, line: 366, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!40, !64, !40, !40}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !66, file: !67, line: 216, baseType: !344, size: 64, offset: 2560)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !6, line: 352, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !39}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !66, file: !67, line: 217, baseType: !145, size: 64, offset: 2624)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !66, file: !67, line: 218, baseType: !40, size: 64, offset: 2688)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !66, file: !67, line: 219, baseType: !40, size: 64, offset: 2752)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !66, file: !67, line: 220, baseType: !40, size: 64, offset: 2816)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !66, file: !67, line: 221, baseType: !39, size: 64, offset: 2880)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !66, file: !67, line: 222, baseType: !40, size: 64, offset: 2944)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !66, file: !67, line: 223, baseType: !85, size: 64, offset: 3008)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !66, file: !67, line: 228, baseType: !23, size: 32, offset: 3072)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !66, file: !67, line: 230, baseType: !85, size: 64, offset: 3136)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall", scope: !66, file: !67, line: 231, baseType: !358, size: 64, offset: 3200)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "vectorcallfunc", file: !6, line: 370, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!40, !40, !362, !35, !40}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tp_watched", scope: !66, file: !67, line: 234, baseType: !365, size: 8, offset: 3264)
!365 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tp_versions_used", scope: !66, file: !67, line: 241, baseType: !59, size: 16, offset: 3280)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !368, line: 30, baseType: !7)
!368 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_int32_t.h", directory: "")
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !371, line: 15, baseType: !372)
!371 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/bytesobject.h", directory: "")
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !371, line: 5, size: 320, elements: !373)
!373 = !{!374, !375, !376}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !372, file: !371, line: 6, baseType: !70, size: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !372, file: !371, line: 7, baseType: !223, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !372, file: !371, line: 8, baseType: !377, size: 8, offset: 256)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 1)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunctionObject", file: !382, line: 14, baseType: !383)
!382 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/methodobject.h", directory: "")
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 7, size: 448, elements: !384)
!384 = !{!385, !386, !387, !388, !389, !390}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !383, file: !382, line: 8, baseType: !41, size: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "m_ml", scope: !383, file: !382, line: 9, baseType: !285, size: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "m_self", scope: !383, file: !382, line: 10, baseType: !40, size: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "m_module", scope: !383, file: !382, line: 11, baseType: !40, size: 64, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "m_weakreflist", scope: !383, file: !382, line: 12, baseType: !40, size: 64, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "vectorcall", scope: !383, file: !382, line: 13, baseType: !358, size: 64, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !393, line: 163, baseType: !394)
!393 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/unicodeobject.h", directory: "")
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !393, line: 54, size: 320, elements: !395)
!395 = !{!396, !397, !398, !399}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !394, file: !393, line: 99, baseType: !41, size: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !394, file: !393, line: 100, baseType: !75, size: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !394, file: !393, line: 101, baseType: !223, size: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !394, file: !393, line: 162, baseType: !400, size: 32, offset: 256)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !394, file: !393, line: 107, size: 32, elements: !401)
!401 = !{!402, !403, !404, !405, !406}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !400, file: !393, line: 121, baseType: !23, size: 2, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !400, file: !393, line: 145, baseType: !23, size: 3, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !400, file: !393, line: 150, baseType: !23, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !400, file: !393, line: 154, baseType: !23, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "statically_allocated", scope: !400, file: !393, line: 156, baseType: !23, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyLongObject", file: !42, line: 19, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_longobject", file: !410, line: 98, size: 256, elements: !411)
!410 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/longintrepr.h", directory: "")
!411 = !{!412, !413}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !409, file: !410, line: 99, baseType: !41, size: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "long_value", scope: !409, file: !410, line: 100, baseType: !414, size: 128, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyLongValue", file: !410, line: 96, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PyLongValue", file: !410, line: 93, size: 128, elements: !416)
!416 = !{!417, !420}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "lv_tag", scope: !415, file: !410, line: 94, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !419, line: 34, baseType: !38)
!419 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ob_digit", scope: !415, file: !410, line: 95, baseType: !421, size: 32, offset: 64)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, size: 32, elements: !378)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "digit", file: !410, line: 43, baseType: !56)
!423 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFloatObject", file: !426, line: 8, baseType: !427)
!426 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/floatobject.h", directory: "")
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !426, line: 5, size: 192, elements: !428)
!428 = !{!429, !430}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !427, file: !426, line: 6, baseType: !41, size: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ob_fval", scope: !427, file: !426, line: 7, baseType: !423, size: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !433, line: 13, baseType: !434)
!433 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/tupleobject.h", directory: "")
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !433, line: 5, size: 320, elements: !435)
!435 = !{!436, !437, !438}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !434, file: !433, line: 6, baseType: !70, size: 192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ob_hash", scope: !434, file: !433, line: 8, baseType: !223, size: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !434, file: !433, line: 12, baseType: !439, size: 64, offset: 256)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 64, elements: !378)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBaseExceptionObject", file: !443, line: 15, baseType: !444)
!443 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/pyerrors.h", directory: "")
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !443, line: 13, size: 576, elements: !445)
!445 = !{!446, !447, !448, !449, !450, !451, !452, !453}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !444, file: !443, line: 14, baseType: !41, size: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !444, file: !443, line: 14, baseType: !40, size: 64, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !444, file: !443, line: 14, baseType: !40, size: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !444, file: !443, line: 14, baseType: !40, size: 64, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", scope: !444, file: !443, line: 14, baseType: !40, size: 64, offset: 320)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !444, file: !443, line: 14, baseType: !40, size: 64, offset: 384)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "cause", scope: !444, file: !443, line: 14, baseType: !40, size: 64, offset: 448)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_context", scope: !444, file: !443, line: 14, baseType: !20, size: 8, offset: 512)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CodeObjectCacheEntry", file: !456, line: 1711, baseType: !457)
!456 = !DIFile(filename: "dataset/cases/goeq-oja-0005/artifacts/cython-clang-llvm-o0-embed-v1/prog_a/program.c", directory: ".")
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !456, line: 1708, size: 128, elements: !458)
!458 = !{!459, !517}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "code_object", scope: !457, file: !456, line: 1709, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CachedCodeObjectType", file: !456, line: 1706, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !42, line: 21, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyCodeObject", file: !464, line: 115, size: 1728, elements: !465)
!464 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/cpython/code.h", directory: "")
!465 = !{!466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !500, !509, !510, !513, !514, !515, !516}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !463, file: !464, line: 115, baseType: !70, size: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !463, file: !464, line: 115, baseType: !40, size: 64, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !463, file: !464, line: 115, baseType: !40, size: 64, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "co_exceptiontable", scope: !463, file: !464, line: 115, baseType: !40, size: 64, offset: 320)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !463, file: !464, line: 115, baseType: !7, size: 32, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !463, file: !464, line: 115, baseType: !7, size: 32, offset: 416)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "co_posonlyargcount", scope: !463, file: !464, line: 115, baseType: !7, size: 32, offset: 448)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !463, file: !464, line: 115, baseType: !7, size: 32, offset: 480)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !463, file: !464, line: 115, baseType: !7, size: 32, offset: 512)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !463, file: !464, line: 115, baseType: !7, size: 32, offset: 544)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocalsplus", scope: !463, file: !464, line: 115, baseType: !7, size: 32, offset: 576)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "co_framesize", scope: !463, file: !464, line: 115, baseType: !7, size: 32, offset: 608)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !463, file: !464, line: 115, baseType: !7, size: 32, offset: 640)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "co_ncellvars", scope: !463, file: !464, line: 115, baseType: !7, size: 32, offset: 672)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "co_nfreevars", scope: !463, file: !464, line: 115, baseType: !7, size: 32, offset: 704)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "co_version", scope: !463, file: !464, line: 115, baseType: !56, size: 32, offset: 736)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "co_localsplusnames", scope: !463, file: !464, line: 115, baseType: !40, size: 64, offset: 768)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "co_localspluskinds", scope: !463, file: !464, line: 115, baseType: !40, size: 64, offset: 832)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !463, file: !464, line: 115, baseType: !40, size: 64, offset: 896)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !463, file: !464, line: 115, baseType: !40, size: 64, offset: 960)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "co_qualname", scope: !463, file: !464, line: 115, baseType: !40, size: 64, offset: 1024)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "co_linetable", scope: !463, file: !464, line: 115, baseType: !40, size: 64, offset: 1088)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !463, file: !464, line: 115, baseType: !40, size: 64, offset: 1152)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "co_executors", scope: !463, file: !464, line: 115, baseType: !490, size: 64, offset: 1216)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyExecutorArray", file: !464, line: 22, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !464, line: 18, size: 128, elements: !493)
!493 = !{!494, !495, !496}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !492, file: !464, line: 19, baseType: !7, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !492, file: !464, line: 20, baseType: !7, size: 32, offset: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "executors", scope: !492, file: !464, line: 21, baseType: !497, size: 64, offset: 64)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, size: 64, elements: !378)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyExecutorObject", file: !464, line: 21, flags: DIFlagFwdDecl)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_co_cached", scope: !463, file: !464, line: 115, baseType: !501, size: 64, offset: 1280)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyCoCached", file: !464, line: 16, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !464, line: 11, size: 256, elements: !504)
!504 = !{!505, !506, !507, !508}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_co_code", scope: !503, file: !464, line: 12, baseType: !40, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_co_varnames", scope: !503, file: !464, line: 13, baseType: !40, size: 64, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_co_cellvars", scope: !503, file: !464, line: 14, baseType: !40, size: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_co_freevars", scope: !503, file: !464, line: 15, baseType: !40, size: 64, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_co_instrumentation_version", scope: !463, file: !464, line: 115, baseType: !418, size: 64, offset: 1344)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_co_monitoring", scope: !463, file: !464, line: 115, baseType: !511, size: 64, offset: 1408)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyCoMonitoringData", file: !464, line: 115, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_co_unique_id", scope: !463, file: !464, line: 115, baseType: !75, size: 64, offset: 1472)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_co_firsttraceable", scope: !463, file: !464, line: 115, baseType: !7, size: 32, offset: 1536)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "co_extra", scope: !463, file: !464, line: 115, baseType: !39, size: 64, offset: 1600)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "co_code_adaptive", scope: !463, file: !464, line: 115, baseType: !377, size: 8, offset: 1664)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "code_line", scope: !457, file: !456, line: 1710, baseType: !7, size: 32, offset: 64)
!518 = !{!0, !519, !524, !526, !531, !561, !564, !569, !574, !579, !584, !586, !588, !590, !595, !600, !602, !608, !613, !615, !620, !647, !649, !652, !657, !662, !664, !669, !673, !678, !680, !682, !687, !692, !697, !699, !701, !703, !708, !710, !712, !714, !719, !721, !724, !729, !734, !739, !744, !749, !751, !753, !755, !757, !759, !761, !766, !771, !774, !776, !778, !783, !785, !788, !790, !793, !798, !803, !808, !810, !812, !817, !819, !824}
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !456, line: 3554, type: !521, isLocal: true, isDefinition: true)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 16)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !456, line: 3561, type: !377, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !456, line: 2100, type: !528, isLocal: true, isDefinition: true)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 72, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 9)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "__pyx_moduledef", scope: !2, file: !456, line: 2096, type: !533, isLocal: true, isDefinition: true)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !534, line: 107, size: 832, elements: !535)
!534 = !DIFile(filename: "/opt/homebrew/opt/python@3.14/Frameworks/Python.framework/Versions/3.14/include/python3.14/moduleobject.h", directory: "")
!535 = !{!536, !547, !548, !549, !550, !551, !558, !559, !560}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !533, file: !534, line: 108, baseType: !537, size: 320)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !534, line: 58, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !534, line: 39, size: 320, elements: !539)
!539 = !{!540, !541, !545, !546}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !538, file: !534, line: 40, baseType: !41, size: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !538, file: !534, line: 47, baseType: !542, size: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!40}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !538, file: !534, line: 52, baseType: !75, size: 64, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !538, file: !534, line: 57, baseType: !40, size: 64, offset: 256)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !533, file: !534, line: 109, baseType: !18, size: 64, offset: 320)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !533, file: !534, line: 110, baseType: !18, size: 64, offset: 384)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !533, file: !534, line: 111, baseType: !75, size: 64, offset: 448)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !533, file: !534, line: 112, baseType: !285, size: 64, offset: 512)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "m_slots", scope: !533, file: !534, line: 113, baseType: !552, size: 64, offset: 576)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Slot", file: !42, line: 13, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Slot", file: !534, line: 69, size: 128, elements: !555)
!555 = !{!556, !557}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !554, file: !534, line: 70, baseType: !7, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !554, file: !534, line: 71, baseType: !39, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !533, file: !534, line: 114, baseType: !265, size: 64, offset: 640)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !533, file: !534, line: 115, baseType: !145, size: 64, offset: 704)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !533, file: !534, line: 116, baseType: !344, size: 64, offset: 768)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "__pyx_methods", scope: !2, file: !456, line: 1995, type: !563, isLocal: true, isDefinition: true)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 256, elements: !378)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "__pyx_moduledef_slots", scope: !2, file: !456, line: 2079, type: !566, isLocal: true, isDefinition: true)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 384, elements: !567)
!567 = !{!568}
!568 = !DISubrange(count: 3)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !456, line: 2228, type: !571, isLocal: true, isDefinition: true)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 40, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 5)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !456, line: 2235, type: !576, isLocal: true, isDefinition: true)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 56, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 7)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !456, line: 2235, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 88, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 11)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !456, line: 2236, type: !576, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !456, line: 2236, type: !528, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !456, line: 2237, type: !576, isLocal: true, isDefinition: true)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(scope: null, file: !456, line: 2237, type: !592, isLocal: true, isDefinition: true)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 96, elements: !593)
!593 = !{!594}
!594 = !DISubrange(count: 12)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(scope: null, file: !456, line: 2238, type: !597, isLocal: true, isDefinition: true)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 216, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 27)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !456, line: 2238, type: !528, isLocal: true, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "main_interpreter_id", scope: !604, file: !456, line: 2175, type: !49, isLocal: true, isDefinition: true)
!604 = distinct !DISubprogram(name: "__Pyx_check_single_interpreter", scope: !456, file: !456, line: 2174, type: !605, scopeLine: 2174, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !607)
!605 = !DISubroutineType(types: !606)
!606 = !{!7}
!607 = !{}
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !456, line: 2197, type: !610, isLocal: true, isDefinition: true)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 760, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 95)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "__pyx_m", scope: !2, file: !456, line: 1326, type: !40, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !456, line: 2270, type: !617, isLocal: true, isDefinition: true)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 648, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 81)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "__pyx_mstate_global", scope: !2, file: !456, line: 1933, type: !622, isLocal: true, isDefinition: true)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pyx_mstatetype", file: !456, line: 1912, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !456, line: 1898, size: 1600, elements: !626)
!626 = !{!627, !628, !629, !630, !631, !632, !633, !637, !641}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_d", scope: !625, file: !456, line: 1899, baseType: !40, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_b", scope: !625, file: !456, line: 1900, baseType: !40, size: 64, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_cython_runtime", scope: !625, file: !456, line: 1901, baseType: !40, size: 64, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_tuple", scope: !625, file: !456, line: 1902, baseType: !40, size: 64, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_bytes", scope: !625, file: !456, line: 1903, baseType: !40, size: 64, offset: 256)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_unicode", scope: !625, file: !456, line: 1904, baseType: !40, size: 64, offset: 320)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_string_tab", scope: !625, file: !456, line: 1905, baseType: !634, size: 960, offset: 384)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 960, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 15)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_number_tab", scope: !625, file: !456, line: 1906, baseType: !638, size: 128, offset: 1344)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 128, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 2)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_code_cache", scope: !625, file: !456, line: 1909, baseType: !642, size: 128, offset: 1472)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__Pyx_CodeObjectCache", file: !456, line: 1712, size: 128, elements: !643)
!643 = !{!644, !645, !646}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !642, file: !456, line: 1713, baseType: !7, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "max_count", scope: !642, file: !456, line: 1714, baseType: !7, size: 32, offset: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !642, file: !456, line: 1715, baseType: !454, size: 64, offset: 64)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !456, line: 2300, type: !528, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !456, line: 2301, type: !651, isLocal: true, isDefinition: true)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 120, elements: !635)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !456, line: 2302, type: !654, isLocal: true, isDefinition: true)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 104, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 13)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(scope: null, file: !456, line: 2604, type: !659, isLocal: true, isDefinition: true)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 112, elements: !660)
!660 = !{!661}
!661 = !DISubrange(count: 14)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "__pyx_mstate_global_static", scope: !2, file: !456, line: 1927, type: !624, isLocal: true, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !456, line: 1336, type: !666, isLocal: true, isDefinition: true)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 432, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 54)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "__pyx_f", scope: !2, file: !456, line: 1335, type: !671, isLocal: true, isDefinition: true)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 64, elements: !378)
!672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !456, line: 4417, type: !675, isLocal: true, isDefinition: true)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 624, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 78)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !456, line: 4423, type: !651, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !456, line: 4423, type: !651, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !456, line: 2663, type: !684, isLocal: true, isDefinition: true)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 640, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 80)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !456, line: 4433, type: !689, isLocal: true, isDefinition: true)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 136, elements: !690)
!690 = !{!691}
!691 = !DISubrange(count: 17)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !456, line: 4433, type: !694, isLocal: true, isDefinition: true)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 32, elements: !695)
!695 = !{!696}
!696 = !DISubrange(count: 4)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !456, line: 4433, type: !571, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !456, line: 4434, type: !581, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !456, line: 4438, type: !694, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(scope: null, file: !456, line: 4485, type: !705, isLocal: true, isDefinition: true)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1224, elements: !706)
!706 = !{!707}
!707 = !DISubrange(count: 153)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(name: "__pyx_filename", scope: !2, file: !456, line: 1331, type: !18, isLocal: true, isDefinition: true)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "__pyx_lineno", scope: !2, file: !456, line: 1328, type: !7, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "__pyx_clineno", scope: !2, file: !456, line: 1329, type: !7, isLocal: true, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(scope: null, file: !371, line: 25, type: !716, isLocal: true, isDefinition: true)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 144, elements: !717)
!717 = !{!718}
!718 = !DISubrange(count: 18)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(scope: null, file: !371, line: 25, type: !659, isLocal: true, isDefinition: true)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(scope: null, file: !371, line: 25, type: !723, isLocal: true, isDefinition: true)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 144, elements: !717)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !456, line: 2924, type: !726, isLocal: true, isDefinition: true)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 200, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 25)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !456, line: 2956, type: !731, isLocal: true, isDefinition: true)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 248, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 31)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !456, line: 2963, type: !736, isLocal: true, isDefinition: true)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 344, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 43)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !456, line: 3001, type: !741, isLocal: true, isDefinition: true)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 224, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 28)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !456, line: 3001, type: !746, isLocal: true, isDefinition: true)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 80, elements: !747)
!747 = !{!748}
!748 = !DISubrange(count: 10)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !456, line: 3001, type: !597, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !456, line: 3003, type: !581, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(name: "__pyx_builtin_input", scope: !2, file: !456, line: 1881, type: !40, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !426, line: 16, type: !716, isLocal: true, isDefinition: true)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(scope: null, file: !426, line: 16, type: !659, isLocal: true, isDefinition: true)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !426, line: 16, type: !723, isLocal: true, isDefinition: true)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(scope: null, file: !456, line: 4275, type: !763, isLocal: true, isDefinition: true)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 160, elements: !764)
!764 = !{!765}
!765 = !DISubrange(count: 20)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(scope: null, file: !456, line: 4275, type: !768, isLocal: true, isDefinition: true)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 152, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 19)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(scope: null, file: !433, line: 24, type: !773, isLocal: true, isDefinition: true)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 136, elements: !690)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !433, line: 24, type: !659, isLocal: true, isDefinition: true)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(scope: null, file: !433, line: 24, type: !723, isLocal: true, isDefinition: true)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(scope: null, file: !6, line: 284, type: !780, isLocal: true, isDefinition: true)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 64, elements: !781)
!781 = !{!782}
!782 = !DISubrange(count: 8)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(scope: null, file: !6, line: 284, type: !528, isLocal: true, isDefinition: true)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(scope: null, file: !6, line: 284, type: !787, isLocal: true, isDefinition: true)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 224, elements: !742)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !6, line: 285, type: !787, isLocal: true, isDefinition: true)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(scope: null, file: !456, line: 4260, type: !792, isLocal: true, isDefinition: true)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 128, elements: !522)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(scope: null, file: !456, line: 4292, type: !795, isLocal: true, isDefinition: true)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 312, elements: !796)
!796 = !{!797}
!797 = !DISubrange(count: 39)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(scope: null, file: !456, line: 4292, type: !800, isLocal: true, isDefinition: true)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 264, elements: !801)
!801 = !{!802}
!802 = !DISubrange(count: 33)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(scope: null, file: !456, line: 4295, type: !805, isLocal: true, isDefinition: true)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 168, elements: !806)
!806 = !{!807}
!807 = !DISubrange(count: 21)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(name: "__pyx_builtin_print", scope: !2, file: !456, line: 1882, type: !40, isLocal: true, isDefinition: true)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(scope: null, file: !456, line: 3429, type: !581, isLocal: true, isDefinition: true)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(scope: null, file: !456, line: 1330, type: !814, isLocal: true, isDefinition: true)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 944, elements: !815)
!815 = !{!816}
!816 = !DISubrange(count: 118)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "__pyx_cfilenm", scope: !2, file: !456, line: 1330, type: !672, isLocal: true, isDefinition: true)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(scope: null, file: !456, line: 2826, type: !821, isLocal: true, isDefinition: true)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 192, elements: !822)
!822 = !{!823}
!823 = !DISubrange(count: 24)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(scope: null, file: !456, line: 2826, type: !826, isLocal: true, isDefinition: true)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 560, elements: !827)
!827 = !{!828}
!828 = !DISubrange(count: 70)
!829 = !{i32 2, !"SDK Version", [2 x i32] [i32 14, i32 4]}
!830 = !{i32 7, !"Dwarf Version", i32 4}
!831 = !{i32 2, !"Debug Info Version", i32 3}
!832 = !{i32 1, !"wchar_size", i32 4}
!833 = !{i32 8, !"PIC Level", i32 2}
!834 = !{i32 7, !"uwtable", i32 1}
!835 = !{i32 7, !"frame-pointer", i32 1}
!836 = !{!"Homebrew clang version 20.1.8"}
!837 = distinct !DISubprogram(name: "PyInit_original", scope: !456, file: !456, line: 2139, type: !543, scopeLine: 2141, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2)
!838 = !DILocation(line: 2142, column: 10, scope: !837)
!839 = !DILocation(line: 2142, column: 3, scope: !837)
!840 = distinct !DISubprogram(name: "main", scope: !456, file: !456, line: 3543, type: !841, scopeLine: 3544, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !607)
!841 = !DISubroutineType(types: !842)
!842 = !{!7, !7, !843}
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!844 = !DILocalVariable(name: "argc", arg: 1, scope: !840, file: !456, line: 3543, type: !7)
!845 = !DILocation(line: 3543, column: 10, scope: !840)
!846 = !DILocalVariable(name: "argv", arg: 2, scope: !840, file: !456, line: 3543, type: !843)
!847 = !DILocation(line: 3543, column: 23, scope: !840)
!848 = !DILocation(line: 3545, column: 10, scope: !849)
!849 = distinct !DILexicalBlock(scope: !840, file: !456, line: 3545, column: 9)
!850 = !DILocation(line: 3545, column: 9, scope: !849)
!851 = !DILocation(line: 3546, column: 16, scope: !852)
!852 = distinct !DILexicalBlock(scope: !849, file: !456, line: 3545, column: 16)
!853 = !DILocation(line: 3546, column: 9, scope: !852)
!854 = !DILocalVariable(name: "i", scope: !855, file: !456, line: 3549, type: !7)
!855 = distinct !DILexicalBlock(scope: !849, file: !456, line: 3548, column: 10)
!856 = !DILocation(line: 3549, column: 13, scope: !855)
!857 = !DILocalVariable(name: "res", scope: !855, file: !456, line: 3549, type: !7)
!858 = !DILocation(line: 3549, column: 16, scope: !855)
!859 = !DILocalVariable(name: "argv_copy", scope: !855, file: !456, line: 3550, type: !29)
!860 = !DILocation(line: 3550, column: 19, scope: !855)
!861 = !DILocation(line: 3550, column: 78, scope: !855)
!862 = !DILocation(line: 3550, column: 69, scope: !855)
!863 = !DILocation(line: 3550, column: 67, scope: !855)
!864 = !DILocation(line: 3550, column: 43, scope: !855)
!865 = !DILocalVariable(name: "argv_copy2", scope: !855, file: !456, line: 3551, type: !29)
!866 = !DILocation(line: 3551, column: 19, scope: !855)
!867 = !DILocation(line: 3551, column: 79, scope: !855)
!868 = !DILocation(line: 3551, column: 70, scope: !855)
!869 = !DILocation(line: 3551, column: 68, scope: !855)
!870 = !DILocation(line: 3551, column: 44, scope: !855)
!871 = !DILocalVariable(name: "oldloc", scope: !855, file: !456, line: 3552, type: !95)
!872 = !DILocation(line: 3552, column: 15, scope: !855)
!873 = !DILocation(line: 3552, column: 31, scope: !855)
!874 = !DILocation(line: 3552, column: 24, scope: !855)
!875 = !DILocation(line: 3553, column: 14, scope: !876)
!876 = distinct !DILexicalBlock(scope: !855, file: !456, line: 3553, column: 13)
!877 = !DILocation(line: 3553, column: 24, scope: !876)
!878 = !DILocation(line: 3553, column: 28, scope: !876)
!879 = !DILocation(line: 3553, column: 39, scope: !876)
!880 = !DILocation(line: 3553, column: 43, scope: !876)
!881 = !DILocation(line: 3554, column: 21, scope: !882)
!882 = distinct !DILexicalBlock(scope: !876, file: !456, line: 3553, column: 51)
!883 = !DILocation(line: 3554, column: 13, scope: !882)
!884 = !DILocation(line: 3555, column: 18, scope: !882)
!885 = !DILocation(line: 3555, column: 13, scope: !882)
!886 = !DILocation(line: 3556, column: 18, scope: !882)
!887 = !DILocation(line: 3556, column: 13, scope: !882)
!888 = !DILocation(line: 3557, column: 18, scope: !882)
!889 = !DILocation(line: 3557, column: 13, scope: !882)
!890 = !DILocation(line: 3558, column: 13, scope: !882)
!891 = !DILocation(line: 3560, column: 13, scope: !855)
!892 = !DILocation(line: 3561, column: 9, scope: !855)
!893 = !DILocation(line: 3562, column: 16, scope: !894)
!894 = distinct !DILexicalBlock(scope: !855, file: !456, line: 3562, column: 9)
!895 = !DILocation(line: 3562, column: 14, scope: !894)
!896 = !DILocation(line: 3562, column: 21, scope: !897)
!897 = distinct !DILexicalBlock(scope: !894, file: !456, line: 3562, column: 9)
!898 = !DILocation(line: 3562, column: 25, scope: !897)
!899 = !DILocation(line: 3562, column: 23, scope: !897)
!900 = !DILocation(line: 3562, column: 9, scope: !894)
!901 = !DILocation(line: 3563, column: 60, scope: !902)
!902 = distinct !DILexicalBlock(scope: !897, file: !456, line: 3562, column: 36)
!903 = !DILocation(line: 3563, column: 65, scope: !902)
!904 = !DILocation(line: 3563, column: 44, scope: !902)
!905 = !DILocation(line: 3563, column: 29, scope: !902)
!906 = !DILocation(line: 3563, column: 39, scope: !902)
!907 = !DILocation(line: 3563, column: 42, scope: !902)
!908 = !DILocation(line: 3563, column: 13, scope: !902)
!909 = !DILocation(line: 3563, column: 24, scope: !902)
!910 = !DILocation(line: 3563, column: 27, scope: !902)
!911 = !DILocation(line: 3564, column: 18, scope: !912)
!912 = distinct !DILexicalBlock(scope: !902, file: !456, line: 3564, column: 17)
!913 = !DILocation(line: 3564, column: 28, scope: !912)
!914 = !DILocation(line: 3564, column: 17, scope: !912)
!915 = !DILocation(line: 3564, column: 36, scope: !912)
!916 = !DILocation(line: 3564, column: 32, scope: !912)
!917 = !DILocation(line: 3565, column: 9, scope: !902)
!918 = !DILocation(line: 3562, column: 32, scope: !897)
!919 = !DILocation(line: 3562, column: 9, scope: !897)
!920 = distinct !{!920, !900, !921, !922}
!921 = !DILocation(line: 3565, column: 9, scope: !894)
!922 = !{!"llvm.loop.mustprogress"}
!923 = !DILocation(line: 3566, column: 27, scope: !855)
!924 = !DILocation(line: 3566, column: 9, scope: !855)
!925 = !DILocation(line: 3567, column: 14, scope: !855)
!926 = !DILocation(line: 3567, column: 9, scope: !855)
!927 = !DILocation(line: 3568, column: 13, scope: !928)
!928 = distinct !DILexicalBlock(scope: !855, file: !456, line: 3568, column: 13)
!929 = !DILocation(line: 3568, column: 17, scope: !928)
!930 = !DILocation(line: 3569, column: 30, scope: !928)
!931 = !DILocation(line: 3569, column: 36, scope: !928)
!932 = !DILocation(line: 3569, column: 19, scope: !928)
!933 = !DILocation(line: 3569, column: 17, scope: !928)
!934 = !DILocation(line: 3569, column: 13, scope: !928)
!935 = !DILocation(line: 3570, column: 16, scope: !936)
!936 = distinct !DILexicalBlock(scope: !855, file: !456, line: 3570, column: 9)
!937 = !DILocation(line: 3570, column: 14, scope: !936)
!938 = !DILocation(line: 3570, column: 21, scope: !939)
!939 = distinct !DILexicalBlock(scope: !936, file: !456, line: 3570, column: 9)
!940 = !DILocation(line: 3570, column: 25, scope: !939)
!941 = !DILocation(line: 3570, column: 23, scope: !939)
!942 = !DILocation(line: 3570, column: 9, scope: !936)
!943 = !DILocation(line: 3571, column: 27, scope: !944)
!944 = distinct !DILexicalBlock(scope: !939, file: !456, line: 3570, column: 36)
!945 = !DILocation(line: 3571, column: 38, scope: !944)
!946 = !DILocation(line: 3571, column: 13, scope: !944)
!947 = !DILocation(line: 3572, column: 9, scope: !944)
!948 = !DILocation(line: 3570, column: 32, scope: !939)
!949 = !DILocation(line: 3570, column: 9, scope: !939)
!950 = distinct !{!950, !942, !951, !922}
!951 = !DILocation(line: 3572, column: 9, scope: !936)
!952 = !DILocation(line: 3573, column: 14, scope: !855)
!953 = !DILocation(line: 3573, column: 9, scope: !855)
!954 = !DILocation(line: 3574, column: 14, scope: !855)
!955 = !DILocation(line: 3574, column: 9, scope: !855)
!956 = !DILocation(line: 3575, column: 16, scope: !855)
!957 = !DILocation(line: 3575, column: 9, scope: !855)
!958 = !DILocation(line: 3577, column: 1, scope: !840)
!959 = distinct !DISubprogram(name: "__Pyx_main", scope: !456, file: !456, line: 3488, type: !960, scopeLine: 3490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !607)
!960 = !DISubroutineType(types: !961)
!961 = !{!7, !7, !29}
!962 = !DILocalVariable(name: "argc", arg: 1, scope: !959, file: !456, line: 3488, type: !7)
!963 = !DILocation(line: 3488, column: 27, scope: !959)
!964 = !DILocalVariable(name: "argv", arg: 2, scope: !959, file: !456, line: 3488, type: !29)
!965 = !DILocation(line: 3488, column: 43, scope: !959)
!966 = !DILocation(line: 3501, column: 9, scope: !967)
!967 = distinct !DILexicalBlock(scope: !959, file: !456, line: 3501, column: 9)
!968 = !DILocation(line: 3501, column: 61, scope: !967)
!969 = !DILocation(line: 3501, column: 66, scope: !967)
!970 = !DILocalVariable(name: "status", scope: !971, file: !456, line: 3503, type: !972)
!971 = distinct !DILexicalBlock(scope: !959, file: !456, line: 3502, column: 5)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyStatus", file: !13, line: 19, baseType: !14)
!973 = !DILocation(line: 3503, column: 18, scope: !971)
!974 = !DILocalVariable(name: "config", scope: !971, file: !456, line: 3504, type: !975)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyConfig", file: !13, line: 244, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyConfig", file: !13, line: 134, size: 3648, elements: !977)
!977 = !{!978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_config_init", scope: !976, file: !13, line: 135, baseType: !7, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "isolated", scope: !976, file: !13, line: 137, baseType: !7, size: 32, offset: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "use_environment", scope: !976, file: !13, line: 138, baseType: !7, size: 32, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "dev_mode", scope: !976, file: !13, line: 139, baseType: !7, size: 32, offset: 96)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "install_signal_handlers", scope: !976, file: !13, line: 140, baseType: !7, size: 32, offset: 128)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "use_hash_seed", scope: !976, file: !13, line: 141, baseType: !7, size: 32, offset: 160)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "hash_seed", scope: !976, file: !13, line: 142, baseType: !38, size: 64, offset: 192)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "faulthandler", scope: !976, file: !13, line: 143, baseType: !7, size: 32, offset: 256)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "tracemalloc", scope: !976, file: !13, line: 144, baseType: !7, size: 32, offset: 288)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "perf_profiling", scope: !976, file: !13, line: 145, baseType: !7, size: 32, offset: 320)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "remote_debug", scope: !976, file: !13, line: 146, baseType: !7, size: 32, offset: 352)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "import_time", scope: !976, file: !13, line: 147, baseType: !7, size: 32, offset: 384)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "code_debug_ranges", scope: !976, file: !13, line: 148, baseType: !7, size: 32, offset: 416)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "show_ref_count", scope: !976, file: !13, line: 149, baseType: !7, size: 32, offset: 448)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "dump_refs", scope: !976, file: !13, line: 150, baseType: !7, size: 32, offset: 480)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "dump_refs_file", scope: !976, file: !13, line: 151, baseType: !30, size: 64, offset: 512)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_stats", scope: !976, file: !13, line: 152, baseType: !7, size: 32, offset: 576)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "filesystem_encoding", scope: !976, file: !13, line: 153, baseType: !30, size: 64, offset: 640)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "filesystem_errors", scope: !976, file: !13, line: 154, baseType: !30, size: 64, offset: 704)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "pycache_prefix", scope: !976, file: !13, line: 155, baseType: !30, size: 64, offset: 768)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "parse_argv", scope: !976, file: !13, line: 156, baseType: !7, size: 32, offset: 832)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "orig_argv", scope: !976, file: !13, line: 157, baseType: !1000, size: 128, offset: 896)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyWideStringList", file: !13, line: 36, baseType: !1001)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 31, size: 128, elements: !1002)
!1002 = !{!1003, !1004}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1001, file: !13, line: 34, baseType: !75, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !1001, file: !13, line: 35, baseType: !29, size: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !976, file: !13, line: 158, baseType: !1000, size: 128, offset: 1024)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "xoptions", scope: !976, file: !13, line: 159, baseType: !1000, size: 128, offset: 1152)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "warnoptions", scope: !976, file: !13, line: 160, baseType: !1000, size: 128, offset: 1280)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "site_import", scope: !976, file: !13, line: 161, baseType: !7, size: 32, offset: 1408)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_warning", scope: !976, file: !13, line: 162, baseType: !7, size: 32, offset: 1440)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "warn_default_encoding", scope: !976, file: !13, line: 163, baseType: !7, size: 32, offset: 1472)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "inspect", scope: !976, file: !13, line: 164, baseType: !7, size: 32, offset: 1504)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !976, file: !13, line: 165, baseType: !7, size: 32, offset: 1536)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "optimization_level", scope: !976, file: !13, line: 166, baseType: !7, size: 32, offset: 1568)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "parser_debug", scope: !976, file: !13, line: 167, baseType: !7, size: 32, offset: 1600)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "write_bytecode", scope: !976, file: !13, line: 168, baseType: !7, size: 32, offset: 1632)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !976, file: !13, line: 169, baseType: !7, size: 32, offset: 1664)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !976, file: !13, line: 170, baseType: !7, size: 32, offset: 1696)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "user_site_directory", scope: !976, file: !13, line: 171, baseType: !7, size: 32, offset: 1728)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "configure_c_stdio", scope: !976, file: !13, line: 172, baseType: !7, size: 32, offset: 1760)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "buffered_stdio", scope: !976, file: !13, line: 173, baseType: !7, size: 32, offset: 1792)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "stdio_encoding", scope: !976, file: !13, line: 174, baseType: !30, size: 64, offset: 1856)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "stdio_errors", scope: !976, file: !13, line: 175, baseType: !30, size: 64, offset: 1920)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "check_hash_pycs_mode", scope: !976, file: !13, line: 179, baseType: !30, size: 64, offset: 1984)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "use_frozen_modules", scope: !976, file: !13, line: 180, baseType: !7, size: 32, offset: 2048)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "safe_path", scope: !976, file: !13, line: 181, baseType: !7, size: 32, offset: 2080)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "int_max_str_digits", scope: !976, file: !13, line: 182, baseType: !7, size: 32, offset: 2112)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "thread_inherit_context", scope: !976, file: !13, line: 183, baseType: !7, size: 32, offset: 2144)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "context_aware_warnings", scope: !976, file: !13, line: 184, baseType: !7, size: 32, offset: 2176)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "use_system_logger", scope: !976, file: !13, line: 186, baseType: !7, size: 32, offset: 2208)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_count", scope: !976, file: !13, line: 189, baseType: !7, size: 32, offset: 2240)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "pathconfig_warnings", scope: !976, file: !13, line: 196, baseType: !7, size: 32, offset: 2272)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "program_name", scope: !976, file: !13, line: 197, baseType: !30, size: 64, offset: 2304)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "pythonpath_env", scope: !976, file: !13, line: 198, baseType: !30, size: 64, offset: 2368)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "home", scope: !976, file: !13, line: 199, baseType: !30, size: 64, offset: 2432)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "platlibdir", scope: !976, file: !13, line: 200, baseType: !30, size: 64, offset: 2496)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "module_search_paths_set", scope: !976, file: !13, line: 203, baseType: !7, size: 32, offset: 2560)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "module_search_paths", scope: !976, file: !13, line: 204, baseType: !1000, size: 128, offset: 2624)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "stdlib_dir", scope: !976, file: !13, line: 205, baseType: !30, size: 64, offset: 2752)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "executable", scope: !976, file: !13, line: 206, baseType: !30, size: 64, offset: 2816)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "base_executable", scope: !976, file: !13, line: 207, baseType: !30, size: 64, offset: 2880)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !976, file: !13, line: 208, baseType: !30, size: 64, offset: 2944)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "base_prefix", scope: !976, file: !13, line: 209, baseType: !30, size: 64, offset: 3008)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "exec_prefix", scope: !976, file: !13, line: 210, baseType: !30, size: 64, offset: 3072)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "base_exec_prefix", scope: !976, file: !13, line: 211, baseType: !30, size: 64, offset: 3136)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "skip_source_first_line", scope: !976, file: !13, line: 214, baseType: !7, size: 32, offset: 3200)
